{
  "615180fe6a59caa2da6fb4ce09f26624e2eebf39f7aafeb20b6092885b21c151": {
    "company_name": "Ccube",
    "company_url": "https://www.linkedin.com/company/ccube-inc/life",
    "job_title": "AI-ML Solution Architect",
    "job_url": "https://www.linkedin.com/jobs/view/4243070379/?alternateChannel=search&refId=lHAPlyzs2MZlU1Mf16jUoQ%3D%3D&trackingId=oagsCDBOizljXufMS6gD6Q%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nHello Connections\n\nHope you are doing well!\n\nWe are looking for a\"AI-ML Solution Architect\"\n\nBelow is the JD for review.\n\nAI-ML Solution Architect\n\nRemote\n\nW2/Full Time Only\n\nKey Responsibilities:\n\nDesign and architect scalable AI platforms to develop, deploy AI solutions leveraging ML techniques and Deep Learning Techniques\nDrive Joint Architecture Design to collaborate with business stakeholders, data scientists, engineering teams, product, and other key partners to gather functional, non-functional requirements for solving AI use cases on the AI Platform\nEvaluate emerging technologies and tools in the AI area and do fitment analysis to the Enterprise AI Platform and capabilities strategy\nDefine and implement AI/ML architecture best practices, frameworks, and standards\nLead AI/ML infrastructure setup, including cloud services selection, data pipelines, and model deployment\nEnsure robustness, reliability, and scalability of AI/ML solutions in production environments\nDesign and implement data governance, security, and compliance measures for AI/ML platforms\nOptimize cross-functional teams and stakeholders.or performance, cost efficiency, and resource utilization\nProvide technical leadership and mentorship to AI/ML development teams\nCommunicate AI/ML architecture decisions and strategies to stakeholders and executives\n\nKey Requirements:\n\nProven experience as an AI/ML platform architect\nDeep understanding of ML algorithms, Deep Learning architecture, models, and frameworks (e.g., TensorFlow, PyTorch, Scikit-Learn)\nExpertise in cloud platforms (e.g., GCP, Azure) and their AI services\nStrong knowledge of Model development life cycle, software engineering principles, data engineering principles\nExperience with containerization and orchestration tools onprem and cloud (e.g., AKS, GKE, OpenShift Container Platform, Docker, Kubernetes) for deploying AI/ML models\nAbility to design and optimize distributed computing systems for AI/ML workloads\nFamiliarity withcross-functional teams and stakeholders. and automation tools in AI-ML contexts\nExcellent problem-solving skills and ability to address complex technical challenges\nEffective communication skills to collaborate with cross-functional teams and stakeholders\n\n[About Ccube]\n\nCcube: Pioneering Data-Driven Solutions in the Cloud\n\nCcube is a specialized firm that delivers measurable results across a wide range of industries by\n\nfocusing exclusively on Data and Artificial Intelligence within Cloud environments. We leverage\n\ncutting-edge technologies and innovative strategies to help our clients harness the power of data\n\nand achieve their business objectives.\n\nCore Competencies:\n\nStrategic Planning and Design of Data Systems: We collaborate with our clients to develop\n\ncomprehensive data strategies and design robust data systems that align with their business\n\ngoals. Our team of experts provides guidance on data architecture, data governance, and data\n\nmanagement best practices.\n\nDevelopment and Unification of Data Frameworks: We build and integrate data frameworks\n\nthat enable seamless data flow and analysis. Our solutions facilitate data ingestion, data\n\ntransformation, and data storage, ensuring data is readily available for business intelligence and\n\ndecision-making.\n\nAdvanced Data Analysis and Artificial Intelligence Applications: We employ sophisticated\n\ndata analysis techniques and artificial intelligence algorithms to extract valuable insights from\n\ndata. Our solutions include predictive modeling, machine learning, and natural language\n\nprocessing, enabling our clients to make data-driven decisions and optimize their operations.\n\nCloud Computing, Data Operations, and Machine Learning Operations: We leverage the\n\nscalability and flexibility of cloud computing to deliver efficient and cost-effective data solutions.\n\nOur team of experts manages data operations and machine learning operations, ensuring\n\nseamless integration and optimal performance.\n\nOrganizational Principles at Ccube:\n\nAt Ccube, we are guided by a set of core principles that shape our culture and drive our success:\n\nEfficiency: We strive to maximize efficiency by optimizing resource utilization and streamlining\n\nprocesses.\n\nClient Satisfaction: We are committed to providing exceptional service and exceeding our clients'\n\nexpectations.\n\nInnovation: We embrace innovation and continuously explore new technologies and approaches\n\nto deliver cutting-edge solutions.\n\nHumility: We maintain professional modesty and recognize that there is always room for\n\nimprovement.\n\nEmployee Advantages:\n\nCcube offers a stimulating and rewarding work environment with numerous benefits for our\n\nemployees:\n\nDynamic Startup Environment: We provide a fast-paced and entrepreneurial environment where\n\nemployees can learn, grow, and make a significant impact.\n\nCareer Growth Opportunities: We offer ample opportunities for career advancement and\n\nprofessional development.\n\nPerformance-Based Incentives: We reward high-performing employees with competitive\n\ncompensation and performance-based bonuses.\n\nEquity Participation: We offer equity participation options to eligible employees, providing them\n\nwith ownership and a stake in the company's success.\n\nProfessional Development Reimbursement: We encourage continuous learning and reimburse\n\nemployees for eligible professional development expenses.\n\nJoin Ccube and be part of a team that is shaping the future of data and AI in the cloud.\n\nPowered by JazzHR\n\nyunbcmZzLq",
    "scraped_at": "2025-06-05T14:48:53.228449"
  },
  "3cf5b8ba36bf091361634804ff270ef2ac745a2bf62ab320dfbeb3af27828e4e": {
    "company_name": "RED Global",
    "company_url": "https://www.linkedin.com/company/red-commerce/life",
    "job_title": "Data Scientist AI/ML",
    "job_url": "https://www.linkedin.com/jobs/view/4240312382/?alternateChannel=search&refId=lHAPlyzs2MZlU1Mf16jUoQ%3D%3D&trackingId=yPL4Lun2RRYggVRunup40A%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nData Scientist AI/ML - 6 months contract - Toronto (Hybrid) - Pharma\n\nWe are looking for AI/ML Data Scientist with strong hands-on experience in designing, building, and deploying advanced machine learning models on complex datasets. You will play a key role in developing AI products that drive impactful business outcomes, with a strong focus on both technical excellence and cross-functional collaboration.\n\nKey Responsibilities:\n\nDesign, develop, and implement ML models and AI solutions for complex datasets across supervised, unsupervised, deep learning, reinforcement learning, time series forecasting, and Bayesian methods.\nTranslate AI/ML concepts into business value by engaging with stakeholders and communicating technical insights in a clear, non-technical manner.\nBuild production-ready, reusable Python code libraries using functions and object-oriented programming (classes) in an agile development environment.\nCollaborate with cross-functional teams including business stakeholders, data engineers, and software developers to deliver integrated AI solutions.\nOperate within cloud-based and high-performance computing environments (e.g., AWS, GCP, Databricks, Apache Spark) to scale AI/ML solutions.\nContribute to the end-to-end development lifecycle including CI/CD pipelines, ML model orchestration, and monitoring.\nVisualize data and model outputs using tools such as Tableau, Power BI, or Plotly, to drive data storytelling and actionable insights.\nWork with APIs and various database systems (SQL, NoSQL, Snowflake) to extract, process, and integrate data sources efficiently.\nStay up-to-date with the latest developments in AI/ML and proactively bring new ideas and approaches to the team.\n\nRequired Qualifications:\n\nMaster’s degree (or PhD preferred) in Computer Science, Mathematics, Physics, Statistics, or a related quantitative discipline.\nHands-on AI/ML experience, including deploying solutions in a production environment.\nDeep understanding of machine learning theory and practical application across a wide range of techniques.\nStrong programming skills in Python; familiarity with R or Scala is a plus.\nProficiency in working with cloud platforms such as AWS, GCP, or Azure.\nExperience using version control systems such as Git and familiarity with agile development practices.\nExcellent communication and interpersonal skills, with a demonstrated ability to work collaboratively in team environments.",
    "scraped_at": "2025-06-05T14:48:58.523299"
  },
  "9114dcc50a695999649dae2b218cc5cbe24994d048f655835cafb894f8c3b5c8": {
    "company_name": "Product Manager Accelerator",
    "company_url": "https://www.linkedin.com/company/pmaccelerator/life",
    "job_title": "AI UI/UX Designer Intern - AI ML/Gen AI Design & Development",
    "job_url": "https://www.linkedin.com/jobs/view/4243868808/?alternateChannel=search&refId=lHAPlyzs2MZlU1Mf16jUoQ%3D%3D&trackingId=zBz%2BXIVsxGoGUYCSCg1TZA%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nRole Overview:\nWe are seeking passionate and motivated AI UI/UX Designer Interns for the Summer 2025 semester to partner with other professionals within the USA. This internship is ideal for individuals with a strong interest in AI, eager to learn and explore cutting-edge AI tools and frameworks and want to have experience interning at a U.S. based company. As part of our team, you will work on projects involving large language models (LLMs), machine learning, prompt engineering, GenAI application development, ChatGPT API integration, and data pipeline development. You will collaborate with a multidisciplinary team, including AI-software engineers, data scientists, and product managers from our PM Accelerator community to bring innovative tech ideas to life.\n Requirements:\nInternational Candidates (non-US or Canada) must be willing to overlap at least 4-hours per day to communicate with US teams. The times can be negotiable with the teams once accepted and joining on an AI product. Fluency in English is necessary. \nUI/UX Designer can be existing working digital marketing professionals with design experience, UI/UX designers with skills in Figma, Sketch, AdobeXD or accredited college students Bachelors/Masters/PhD (User Experience, Human Computer Interaction, UI/UX Design, Computer/Software engineering with design experience).\n\nDuring your internship, you will work with PM Accelerator’s existing PM students, who are within the USA and around the world, inside of the AI PM bootcamp. They will drive real world user pain points into AI minimum-viable-product (MVP) solutions.\n Team Structure will be the following:\nUI/UX designers\nAI/ML Engineers - Front-end and/or Backend, or Data Science \nProduct Managers from the PMA community\n\nKey Responsibilities:\nCollaborate with product managers, designers, and data scientists to design and develop AI-driven and GenAI applications.\nDevelop user personas and user journeys to visualize user behavior and inform design decisions.\nCreate wireframes, prototypes, and mockups to iterate on design solutions and communicate design concepts effectively.\nParticipate in regular team meetings and contribute to the agile development process.\nEngage in continuous learning and exploration of GenAI tools and frameworks, applying them in real-world scenarios.\n\nRequired Skills:\nStrong interest in AI and a willingness to learn and explore GenAI tools and frameworks.\nUser Research: User Interviews, Surveys, Usability Testing, A/B Testing, User Personas, User Journeys, Competitive Analysis\nUX Design: Information Architecture, Interaction Design, User Flows, Wireframing, Prototyping, Low-Fidelity & High-Fidelity Mockups\nUI Design: Visual Design, Typography, Color Theory, Iconography, Accessibility (WCAG), Responsive Design, Design Systems\nSoftware/Tools: Figma, Sketch, Adobe XD, etc..\nExcellent problem-solving skills and ability to work in a collaborative environment.\nStrong communication skills, both written and verbal.\n\nBenefits:\nHands-On AI Experience: Master the skills needed to develop and launch real-life GenAI products, a significant advantage for your future career.\nFree AI Designer Certification: Upon successful completion of the internship, you will receive an AI Designer Certification.\nLinkedIn Recognition: Add your role as an AI UI/UX Designer to your LinkedIn experience section, highlighting your work on the project.\nTech Advisor Support: Access weekly office hours hosted by our tech advisors to help guide your design thinking process\nEducational Resources: Gain access to recommended tech courses \nNetworking Opportunities: Connect with UI/UX Designer job referral opportunities within our AI Project community channel.\nSchool Credit: Eligible to receive school credit if required by your university.\nFully-remote: We welcome qualified candidates from all over the world to apply for this position.\n\nNote: This is an unpaid internship opportunity with CPT and OPT sponsorship available for eligible candidates. If you already graduated, you are welcome to apply as well.\n\nInternship Timeline Options:\nOption 1: Late-June to Early-September\nOption 2: Mid-September to Late-November\nOption 3: Mid-January to Late-March (2026)\n\nThe internship program is a 3-month duration\n\nQualified candidates are encouraged to continue to a 6-month internship\n\nApplication Process:\nTo apply, please submit the following information:\nResume\nLink to your LinkedIn profile\nWhat time do you want to do the internship: Option 1, 2, 3, or all of them\nCover letter explaining your interest in AI, why you are interested in this role, and how you hope to contribute to our team. \nLink to your designs (low-fidelity & high-fidelity) - if available \n\nApplications will be reviewed on a rolling basis.",
    "scraped_at": "2025-06-05T14:49:03.904925"
  },
  "19d4eee8c73b28bc308d71b5750a6380b4ae27e71b27d48e81ee912425cfed6b": {
    "company_name": "Extreme Networks",
    "company_url": "https://www.linkedin.com/company/extreme-networks/life",
    "job_title": "Senior AI/ML Engineer – Generative AI & Autonomous Agents (9746)",
    "job_url": "https://www.linkedin.com/jobs/view/4212856668/?alternateChannel=search&refId=lHAPlyzs2MZlU1Mf16jUoQ%3D%3D&trackingId=NslWz3WK1geI4wCyuEH4Dw%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nOver 50,000 customers globally trust our end-to-end, cloud-driven networking solutions. They rely on our top-rated services and support to accelerate their digital transformation efforts and deliver unprecedented progress. With double-digit growth year over year, no provider is better positioned to deliver scalable outcomes than Extreme.\n\nInclusion is one of our core values and in our DNA. We are committed to fostering an inclusive workplace that embraces our differences and creates an atmosphere where all our employees thrive because of their differences, not in spite of them.\n\nBecome part of Something big with Extreme! As a global networking leader, learn why there’s no better time to join the Extreme team.\n\nSenior AI/ML Engineer – Generative AI & Autonomous Agents \n\nIntroduction\n\nAt Extreme Networks, we create effortless networking experiences that empower people and organizations to advance. As part of our growing AI Competence Center, we are seeking a Senior AI/ML Engineer with expertise in Generative AI, multi-agent systems, and LLM-based application development . In this role, you will help build the next generation of AI-native systems that combine traditional machine learning, generative models, and autonomous agents. Your work will power intelligent, real-time decisions for network design, optimization, security, and support.\n\nKey Responsibilities\n\nDesign and implement the business logic and modeling that governs agent behavior, including decision-making workflows, tool usage, and interaction policies. \nDevelop and refine LLM-driven agents using prompt engineering, retrieval-augmented generation (RAG), fine-tuning, or function calling. \nUnderstand and model the domain knowledge behind each agent: engage with network engineers, learn the operational context, and encode this understanding into effective agent behavior. \nApply traditional ML modeling techniques (classification, regression, clustering, anomaly detection) to enrich agent capabilities.\nContribute to the data engineering pipeline that feeds agents, including data extraction, transformation, and semantic chunking.\nBuild modular, reusable AI components and integrate them with backend APIs, vector stores, and network telemetry pipelines. \nCollaborate with other AI engineers to create multi-agent workflows, including planning, refinement, execution, and escalation steps.\nTranslate GenAI prototypes into production-grade, scalable, and testable services in collaboration with platform and engineering teams. \nWork with frontend developers to design agent experiences and contribute to UX interactions with human-in-the-loop feedback.\nStay up to date on trends in LLM architectures, agent frameworks, evaluation strategies, and GenAI standards.\n\nQualifications\n\nMaster’s or PhD in Computer Science, Artificial Intelligence, Machine Learning, or a related field.5+ years of experience in ML/AI engineering, including 2+ years working with transformer models or LLM systems. \nStrong knowledge of ML fundamentals, with hands-on experience building and deploying traditional ML models. \nSolid programming skills in Python, with experience integrating AI modules into cloud-native microservices. \nExperience with LLM frameworks (e.g., LangChain, AutoGen, Semantic Kernel, Haystack), and vector databases (e.g., FAISS, Weaviate, Pinecone).\nFamiliarity with prompt engineering techniques for system design, memory management, instruction tuning, and tool-use chaining.\nStrong understanding of RAG architectures, including semantic chunking, metadata design, and hybrid retrieval.\nHands-on experience with data preprocessing, ETL workflows, and embedding generation.\nProven ability to work with cloud platforms like AWS or Azure for model deployment, data storage, and orchestration. \nExcellent collaboration and communication skills, including cross-functional work with product managers, network engineers, and backend teams.\n\nNice To Have\n\nExperience with LLMOps tools, open-source agent frameworks, or orchestration libraries.\nFamiliarity with Docker, Docker Compose, and container-based development environments.\nBackground in enterprise networking, SD-WAN, or network observability tools.Contributions to open-source AI or GenAI libraries.\n\nExtreme Networks, Inc. ( EXTR ) creates effortless networking experiences that enable all of us to advance. We push the boundaries of technology leveraging the powers of machine learning, artificial intelligence, analytics, and automation. Over 50,000 customers globally trust our end-to-end, cloud-driven networking solutions and rely on our top-rated services and support to accelerate their digital transformation efforts and deliver progress like never before. For more information, visit Extreme's website or follow us on Twitter, LinkedIn, and Facebook.\n\nWe encourage people from underrepresented groups to apply. Come Advance with us! In keeping with our values, no employee or applicant will face discrimination/harassment based on: race, color, ancestry, national origin, religion, age, gender, marital domestic partner status, sexual orientation, gender identity, disability status, or veteran status. Above and beyond discrimination/harassment based on “protected categories,” Extreme Networks also strives to prevent other, subtler forms of inappropriate behavior (e.g., stereotyping) from ever gaining a foothold in our organization. Whether blatant or hidden, barriers to success have no place at Extreme Networks.",
    "scraped_at": "2025-06-05T14:49:06.713503"
  },
  "4a755afb299299870b79760b89b02470b7a39de55ebb872e8140c28f5239a5b3": {
    "company_name": "Synlico Inc.",
    "company_url": "https://www.linkedin.com/company/synlico-inc/life",
    "job_title": "ML Performance Engineer",
    "job_url": "https://www.linkedin.com/jobs/view/4238811886/?alternateChannel=search&refId=lHAPlyzs2MZlU1Mf16jUoQ%3D%3D&trackingId=9%2F2t5thzFQlQ2E8gUReNWA%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nSynlico Inc. is a resident company of Johnson & Johnson Innovation – JLABS, a premier life science incubator program. Synlico envisions rewriting medicine by bringing causality to cellular biology. We are an AI-powered Drug Discovery startup developing cutting-edge AI platform to combat diseases with the latest advancements in single-cell bioinformatics, machine learning, and causal discovery. We are a passionate team of young scientists and professionals who value innovation and teamwork. Our research is highly interdisciplinary and team oriented. We are seeking a talented and enthusiastic machine learning scientist who will lead/participate in several of our projects with our science team. Our HQ is at South San Francisco, CA, United States. For more information, please visit www.synlico.com.\n\nJob Description:\nThis is a project based remote working contractor position in Canada.\n\nResponsibilities\n• Build scalable ML training and inference pipelines.\n• Optimize deep-learning frameworks (e.g., PyTorch, TensorFlow) to enhance performance.\n• Identify and eliminate performance bottlenecks in AI systems through detailed profiling and analysis.\n• Work with GPUs and other accelerators to push efficiency limits.\n• Partner closely with our scientist to integrate and productize performance improvements.\n\nJob Requirement:\nBachelor’s or Master’s degree in Computer Science, Engineering, or a related field with 3+ year relevant of industry experience.\nExpertise in ML frameworks such as PyTorch, TensorFlow and etc.\nExperience with distributed computing, high-performance networking, or large-scale ML systems\nFluency in parallelism strategies that balance computation, communication, and memory to improve throughput and latency of large models.\nProven use of performance-analysis tools and profilers for large-scale systems, with an ability to diagnose and resolve bottlenecks.\nSolid understanding of computer architecture, GPU architectures, low-level operating-system foundations, and performance-engineering techniques.\nDeep understanding of machine-learning and deep-learning concepts, supported by a track record of impactful ML-systems research in industrial practice.\n\nSynlico is an equal opportunity employer. At Synlico, we value differences and are committed to a diverse workplace that fosters inclusion for all employees. Synlico provides a work environment that respects each individual and is free of all forms of employment discrimination because of race, color, religion, sex, national origin, sexual orientation, gender identity, disability, or veteran status.",
    "scraped_at": "2025-06-05T14:49:09.964117"
  },
  "45ed7342cb43c35b83a2bbce1546f2f822e80441e2f1240318251bacd1c6ba86": {
    "company_name": "Senstar",
    "company_url": "https://www.linkedin.com/company/senstar/life",
    "job_title": "AI/ML Developer",
    "job_url": "https://www.linkedin.com/jobs/view/4219032796/?alternateChannel=search&refId=lHAPlyzs2MZlU1Mf16jUoQ%3D%3D&trackingId=saMcFa22QT2mlKQb%2Be2LnQ%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nWho We Are\n\nSenstar is a global leader and innovator in Security Solutions, dedicated to delivering cutting-edge technology that helps organizations across industries safeguard their most valuable assets. Our proven track record of excellence and commitment to innovation ensures that we provide comprehensive, high-quality solutions to meet the ever-evolving security needs of our clients.\n\nWe Are In Search Of...\n\nA highly skilled and motivated Artificial Intelligence (AI) and Machine Learning (ML) Software Engineer with deep expertise in machine learning, deep learning, and computer vision. The ideal candidate will have a solid foundation in algorithms, statistics, and applied machine learning, particularly in deep neural networks such as Convolutional Neural Networks (CNNs) including YOLO. Experience in C++ and embedded systems is a strong plus, especially for real-time and resource-constrained applications.\n\nThis is an opportunity to work on cutting-edge AI applications—from object detection to intelligent perception systems—and deploy them efficiently on embedded hardware platforms at scale.\n\nKey Responsibilities\n\nDesign, develop, and deploy deep learning models including models for computer vision tasks such as object detection, classification, segmentation, and tracking.\nWork with CNN architectures including YOLO, EfficientDet, and others for real-time vision use cases.\nOptimize models for performance and deployment by applying techniques such as quantization, pruning, and layer fusion.\nAdapt models for embedded inference using runtimes such as TensorRT, ONNX Runtime, or TFLite.\nEvaluate and fine-tune models using performance metrics such as precision, recall, mAP, and F1 score.\nPreprocess and annotate large datasets, build robust data pipelines, and explore data augmentation strategies.\nBenchmark and tune inference latency, memory footprint, and power consumption on embedded platforms.\nCollaborate with cross-functional teams including hardware, firmware, and application software teams to integrate ML models into production environments.\n(Optional) Write high-performance C++ code to accelerate or integrate model inference on edge devices.\n\nWhat you bring…\n\nBachelor’s or Master’s degree in Computer Science, Engineering, Mathematics, or related field (PhD is a plus).\n3+ years of experience in machine learning and deep learning.\nProficiency in Python and ML libraries such as PyTorch, TensorFlow, OpenCV, NumPy, and scikit-learn.\nHands-on experience with object detection frameworks (e.g., YOLOv5/v8, Detectron2, SSD, Faster R-CNN).\nExperience deploying models to embedded platforms (e.g., ARM, NVIDIA Jetson, or microcontrollers) and optimizing for performance.\nFamiliarity with quantization-aware training, post-training quantization, and other model compression techniques.\nSolid understanding of probability, statistics, optimization, and linear algebra as applied to ML.\nExperience training models on large-scale datasets using GPUs.\nStrong problem-solving skills and ability to write clean, efficient, and well-documented code.\n\nWhat We Offer…\n\nInnovation: An opportunity to develop industry-leading security solutions.\n\nCollaborative Culture: Join a passionate, results-driven team where collaboration and innovation are at the core of everything we do. Your contributions will be valued, and your ideas will help drive success.\n\nContinuous Professional Development: We are committed to your growth, offering ample opportunities for learning and advancement within a fast-paced, evolving industry.\n\nWork-Life Balance: Enjoy a flexible work environment that promotes work-life balance, allowing you to thrive both personally and professionally.\n\nCompetitive Compensation & Benefits: Receive a competitive salary, performance-based incentives, and a comprehensive benefits package designed to support your health, well-being, and ongoing professional development.\n\nAccessibility and Inclusion: At Senstar, we are committed to building an inclusive and accessible environment that includes a variety of backgrounds, perspectives, and skills. We firmly believe, an accessible and inclusive workplace makes us stronger, more competitive, and innovative. Should you require an accommodation through any stage of the recruiting or hiring process please let us know.\n\nIf you're ready to join a forward-thinking team, showcase industry-leading solutions, and make an impact on a global scale, apply now and help us shape the future of Security!",
    "scraped_at": "2025-06-05T14:49:13.941084"
  },
  "c68dc6ed5538eab7ff1f8d3d72a2a41ffcd09262e90053067725e911a4f59c01": {
    "company_name": "Serve Robotics",
    "company_url": "https://www.linkedin.com/company/serverobotics/life",
    "job_title": "Software Engineer, ML Infrastructure",
    "job_url": "https://www.linkedin.com/jobs/view/4126252511/?alternateChannel=search&refId=lHAPlyzs2MZlU1Mf16jUoQ%3D%3D&trackingId=tOK6%2Fji1gkrmSALFpBjZrA%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nAt Serve Robotics, we’re reimagining how things move in cities. Our personable sidewalk robot is our vision for the future. It’s designed to take deliveries away from congested streets, make deliveries available to more people, and benefit local businesses.\n\nThe Serve fleet has been delighting merchants, customers, and pedestrians along the way in Los Angeles while doing commercial deliveries. We’re looking for talented individuals who will grow robotic deliveries from surprising novelty to efficient ubiquity.\n\nWho We Are\n\nWe are tech industry veterans in software, hardware, and design who are pooling our skills to build the future we want to live in. We are solving real-world problems leveraging robotics, machine learning and computer vision, among other disciplines, with a mindful eye towards the end-to-end user experience. Our team is agile, diverse, and driven. We believe that the best way to solve complicated dynamic problems is collaboratively and respectfully.\n\nWhat You'll Be Doing\n\nAI/ML is a core part of our autonomy. Our ML infrastructure empowers us to train and test all kinds of ML models for various real-world tasks. We also use it to mine useful data from terabytes of sensor recordings that we capture every day. As we rapidly grow our fleet of robots and expand into new cities we are scaling our investment in ML infrastructure.\n\nWe are looking for an engineer who will join our Machine Learning Infrastructure (ML Infra) team on a mission to build and improve this platform.\n\nResponsibilities\n\nDevelop and maintain highly scalable data processing pipelines for data curation, annotation, search and ml feature extraction.\nBuild and improve our active learning pipelines. Ensure the scalability of our training jobs and inference endpoints.\nDevelop and maintain our orchestration and scheduling systems.\nCollaborate with autonomy engineers to build new features for our autonomy data platform, improving data accessibility and developer productivity.\nBuild integrations with annotation providers to efficiently annotate large scale datasets\nDevelop infrastructure components using IaC(Infrastructure as Code) and implement CI/CD processes to streamline ongoing development of the platform.\nDevelop monitoring and alerting frameworks to ensure platform reliability, stability and cost efficiency.\nCollaborate with ML Engineers in accelerating the ml development velocity.\nWork with the data team to ensure SLAs around data quality and availability. Optimise storage costs by tuning retention policies and improving data access patterns.\n\nQualifications\n\nBS or MS in computer science (or equivalent work experience) with focus in data engineering and machine learning\n2+ years of industry experience developing big data processing and/or machine learning pipelines\n1+ years of hands on experience with cloud platforms (AWS/GCP/Azure)\nProficient in Python\nSolid understanding of system design fundamentals and distributed computing concepts\n\nWhat Makes You Standout\n\nExperience with terabyte scale data\nExperience with orchestration engines like Airflow, Prefect\nExperience with data discovery tools and methodologies like RAG, Vector Search\nExperience with databases. E.g BigQuery, Postgres, MySQL, MongoDB.\nExperience with vector search databases. E.g MongoDB Atlas, Pinecone,\nExperience with IaC and CI/CD. E.g Terraform, Jenkins, Github Actions\nExperience with big data frameworks such as Apache Spark/Beam/Hadoop",
    "scraped_at": "2025-06-05T14:49:16.804304"
  },
  "89681de80ef7178ef9efb0c115fa7c044924fd9055fd3e4846640ceb4e41fc21": {
    "company_name": "Hire DigITalent Inc.",
    "company_url": "https://www.linkedin.com/company/hire-digitalent/life",
    "job_title": "AI/ML Lead",
    "job_url": "https://www.linkedin.com/jobs/view/4240426047/?alternateChannel=search&refId=lHAPlyzs2MZlU1Mf16jUoQ%3D%3D&trackingId=2QA99T%2FfaHOpsSP1lO4oFg%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nOur client is looking for a contract resources to take on the role AI/ML Lead for a dynamic, rapidly growing AI Lab. The AI/ML Lead is an exciting role within the Lab - researching, designing and building the core machine learning algorithms at the heart of our AI Innovation products. This will be a 12-month contract to start, and will be two days in office per week in downtown Toronto.\n\nInteract with relevant teams to identify business challenges where AI and machine learning can help, and define the short-term to long-term AI/ML roadmap aligned with business goals.\nApply comprehensive Machine Learning and AI knowledge to propose optimal solutions to key challenges\nCreate detailed proposals and project plans, flagging any limitations of proposed solution\nResearch newly emerging cutting-edge AI and ML technologies, agentic AI frameworks and best practices, identifying potential applications to consumer goods\nDesign and prototype experimental solutions, particularly machine learning models and agentic AI agents; define success metrics beyond traditional model accuracy\nDeliver through squads that blend internal resources with academic researchers and niche AI vendors\nRepresent Machine Learning and Agentic AI in cross-functional governance of projects, engaging with leadership stakeholders in AI Lab, external partners and internal business groups.\nWork with relevant teams to establish Agentic AI governance frameworks, especially around autonomy, fallback mechanisms, and human-in-the-loop control\nInfluence company AI strategy by advising senior leaders on the opportunities and risks related to autonomous AI systems and their implications on workforce, compliance, and customer trust.\nAttract top AI/ML talent and build a strong, diverse team culture. Lead and grow a team of LLM Engineers, Data Scientists, and Research Scientists, providing technical guidance and career mentorship\nSupport the growth of the AI Lab by contributing to activities such as tool and partner selection, best practice definition, recruitment, and creation of training materials\n\nRelevant Experience:\nMinimum of B.S. in a relevant technical field (e.g. Computer Science, AI, Statistics, Engineering); preferably a postgraduate (Masters or Doctorate) degree\n10 years experience building AI and data science solutions to solve business problems, or 7-8 years for those with a PhD)\nExperience managing the work of team members.\nExperience working with academic collaborators or 3rd party resource vendors is a bonus\nExperience presenting insights and influencing decisions of senior non-technical stakeholders\nExperience in Consumer Goods industry is a bonus\nAI / Data Science techniques such as Machine Learning, Deep Learning, Reinforcement Learning, Large Language Models, Graph Databases, Advanced Optimization Expert\nML applications including Forecasting, NLP & Computer Vision Expert\nCoding – preferably in Python Fully Operational\nDevelopment in cloud based Data science platform e.g. MS Azure Databricks, Apache Spark Fully Operational\n\nThank you for your interest, only qualified candidates will be contacted.",
    "scraped_at": "2025-06-05T14:49:19.951680"
  },
  "b97378a9160c51fc322b83e9e9938fa20aecaf88934e80f5cdeadaa54ebadb14": {
    "company_name": "UST",
    "company_url": "https://www.linkedin.com/company/ustglobal/life",
    "job_title": "AI/ML Application Security Analyst",
    "job_url": "https://www.linkedin.com/jobs/view/4237230094/?alternateChannel=search&refId=lHAPlyzs2MZlU1Mf16jUoQ%3D%3D&trackingId=RaSTRsLaccXH4uEpMkokLQ%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nRole Description\n\nAI/ML Application Security Analyst\n\nLead II - Data Science\n\nWho We Are\n\nBorn digital, UST transforms lives through the power of technology. We walk alongside our clients and partners, embedding innovation and agility into everything they do. We help them create transformative experiences and human-centered solutions for a better world.\n\nUST is a mission-driven group of 29,000+ practical problem solvers and creative thinkers in more than 30 countries. Our entrepreneurial teams are empowered to innovate, act nimbly, and create a lasting and sustainable impact for our clients, their customers, and the communities in which we live.\n\nWith us, you’ll create a boundless impact that transforms your career—and the lives of people across the world.\n\nVisit us at UST.com.\n\nYou Are\n\nWe are seeking a highly skilled and motivated Application Security Analyst to join our dynamic team. In this role, you will be at the forefront of securing our cutting-edge applications and AI/ML systems. You will lead efforts to protect our applications from a wide range of threats, ensuring the integrity, confidentiality, and availability of our data and systems. This position requires understanding of application security, including SSPM using CASB, Zero Trust Security, and advanced application protection techniques.\n\nThe Opportunity\n\n Security Assessment and Implementation:\n Conduct comprehensive security assessments of applications and AI/ML systems to identify vulnerabilities and implement robust security measures.\n Develop and enforce security policies, standards, and procedures to protect against threats such as data breaches, DDoS attacks, and unauthorized data egress.\n SSPM using CASB, and Zero Trust Security:\n Implement and manage SaaS Security Posture Management (SSPM) solutions using existing CASB to ensure continuous security compliance.\n Design and enforce Zero Trust Security frameworks to ensure secure access to applications and data, minimizing the risk of unauthorized access.\n Application Protection:\n Utilize and manage advanced security technologies including web application firewalls (WAF), API security, DDoS protection, bot mitigation, and data loss prevention (DLP) to safeguard applications.\n Continuously monitor and respond to security incidents, performing root cause analysis and implementing corrective actions.\n Leverage AI technologies to enhance the protection of applications, utilizing AI-driven threat detection and response mechanisms.\n Data Egress Responsibility:\n Secure and monitor data movements to prevent unauthorized data egress, ensuring the protection of sensitive information.\n Collaborate with developers, DevOps, and data scientists to implement secure data handling practices and monitor data flows.\n AI/ML Application Security:\n Support the security of AI/ML applications, including integrating security practices into the MLOps pipeline and ensuring the secure deployment of large language models (LLMs).\n Conduct risk assessments, vulnerability scans and implement mitigation strategies for AI/ML-related vulnerabilities. Staying updated on the latest advancements and threats in AI/ML security is critical.\n Stay updated on latest AI/ML security guidelines/governance, not to exclude, OWASP, NIST and ISO/IEC JTC 1/SC 42. Implementing these recommendations with existing AI/ML security infrastructure.\n Collaboration and Communication:\n Work closely with cross-functional teams to integrate security practices into the application development lifecycle, fostering a culture of security awareness.\n Provide security training and awareness programs for developers, DevOps, and other stakeholders to enhance the overall security posture of the organization.\n\nThis position description identifies the responsibilities and tasks typically associated with the performance of the position. Other relevant essential functions may be required.\n\nWhat You Need\n\n Bachelor’s or Master’s degree in Computer Science, Cybersecurity, Data Science, or a related field.\n Experience:\n 7+ years of experience in application security, cybersecurity, or a related field.\n Proven experience with SSPM, ASPM, CSPM, and Zero Trust Security frameworks.\n Familiarity with AI/ML security, including MLSecOps, GenAI and LLMs.\n Skills:\n Strong knowledge of web application firewall (WAF), API security, DDoS protection, bot mitigation, runtime application self-protection (RASP), and data loss prevention (DLP) technologies.\n Proficiency in programming languages such as Python, Java, or C++.\n Preferred Qualifications:\n Certifications:\n CISSP, CISM, CompTIA Security+, CAITI, or equivalent.\n Certifications in cloud security (e.g., AWS Certified Security Specialty, Azure Security Engineer Associate).\n Additional Skills:\n Experience with cloud platforms (AWS, Azure, Google Cloud).\n Experience/knowledge of GenAI security monitoring tools\n Knowledge of regulatory compliance standards (e.g., GDPR, CCPA)\n\nCompensation can differ depending on factors including but not limited to the specific office location, role, skill set, education, and level of experience. UST provides a reasonable range of compensation for roles that may be hired in various U.S. markets as set forth below.\n\nRole Location: Ontario\n\nCompensation Range: $98,000-$120,000\n\nBenefits\n\nFull-time, regular employees accrue a minimum of 10 days of paid vacation per year, receive 6 days of paid sick leave each year (pro-rated for new hires throughout the year), paid holidays, and are eligible for paid bereavement leave and jury duty. They and their dependents residing in Canada are eligible for Supplemental Healthcare coverage, as well as Company-paid Employee Only basic life insurance and accidental death and dismemberment coverage.\n\nFull-time temporary employees receive 6 days of paid sick leave each year (pro-rated for new hires throughout the year). They and their dependents residing in Canada are eligible for Supplemental Healthcare coverage, as well as Company-paid Employee Only basic life insurance and accidental death and dismemberment coverage.\n\nPart-time regular and temporary employees receive 6 days of paid sick leave each year (pro-rated for new hires throughout the year).\n\nAll Canadian employees who work in a province, territory or locality with more generous paid sick leave benefits than specified here will receive the benefit of those sick leave laws.\n\nWhat We Believe\n\nWe proudly embrace the values that have shaped UST since day one. We build our culture of Humility, Humanity, and Integrity. These values inspire us to nurture a people-first, human centric culture that fosters diversity, prioritizes sustainable solutions, and keeps our people and clients at the forefront of all decisions.\n\nHumility\n\nWe will listen, learn, be empathetic and help selflessly in our interactions with everyone.\n\nHumanity\n\nThrough business, we will better the lives of those less fortunate than ourselves.\n\nIntegrity\n\nWe honor our commitments and act with responsibility in all our relationships.\n\nAn Equal Opportunity Workplace, Free of Discrimination and Harassment\n\nAt UST, we strive to provide a work environment free of discrimination and harassment. We are an equal opportunity employer and employment decisions are based on merit and business needs. Our Human Rights Policy further illustrates our stand on this. We are committed to following fair employment practices that provide equal opportunities to all employees. We do not discriminate or allow harassment on the basis of race, color, religion, disability, gender, national origin, sexual orientation, gender identity, gender expression, age, genetic information, military status, or any other legally protected status. At UST, we value diversity and believe that a diverse workplace builds a competitive advantage.\n\nUn lieu de travail à égalité des chances, sans Discrimination et harcèlement\n\nChez UST, nous nous efforçons de fournir un environnement de travail exempt de discrimination et harcèlement. Nous sommes un employeur garantissant l'égalité des chances et des décisions en matière d'emploi sont basés sur le mérite et les besoins de l'entreprise. Notre politique en matière de droits de l'homme illustre notre position à ce sujet. Nous nous engageons à respecter un emploi équitable des pratiques qui offrent des chances égales à tous les employés. Nous ne faisons pas discriminer ou permettre le harcèlement sur la base de la race, de la couleur, de la religion, du handicap, genre, origine nationale, orientation sexuelle, identité de genre, expression de genre, âge, informations génétiques, statut militaire ou tout autre statut légalement protégé. Chez UST, nous valorisons la diversité et pensons qu'un lieu de travail diversifié crée un avantage compétitif.\n\nUST reserves the right to periodically redefine your roles and responsibilities based on the requirements of the organization and/or your performance.\n\n#UST\n\nSkills\n\nArtificial Intelligence,Machine Learning,Security Analysis\n\n\nDesired Skills and Experience\nArtificial Intelligence,Machine Learning,Security Analysis",
    "scraped_at": "2025-06-05T14:49:23.083540"
  },
  "2ef5bc0c7387c152ebac7a67c9c1feb2653d67ff34d724a0e193874ca667b56d": {
    "company_name": "Deloitte",
    "company_url": "https://www.linkedin.com/company/deloitte/life",
    "job_title": "Machine Learning (ML) Engineer",
    "job_url": "https://www.linkedin.com/jobs/view/4211799317/?alternateChannel=search&refId=lHAPlyzs2MZlU1Mf16jUoQ%3D%3D&trackingId=yqI9gkkPM5MtvjxfFTVPhA%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nJob Type: PermanentWork Model: HybridReference code: 127082Primary Location: Toronto, ONAll Available Locations: Toronto, ON\n\nOur Purpose\n\nAt Deloitte, our Purpose is to make an impact that matters. We exist to inspire and help our people, organizations, communities, and countries to thrive by building a better future. Our work underpins a prosperous society where people can find meaning and opportunity. It builds consumer and business confidence, empowers organizations to find imaginative ways of deploying capital, enables fair, trusted, and functioning social and economic institutions, and allows our friends, families, and communities to enjoy the quality of life that comes with a sustainable future. And as the largest 100% Canadian-owned and operated professional services firm in our country, we are proud to work alongside our clients to make a positive impact for all Canadians.\n\nBy living our Purpose, we will make an impact that matters.\n\nHave many careers in one Firm.\nEnjoy flexible, proactive, and practical benefits that foster a culture of well-being and connectedness.\nLearn from deep subject matter experts through mentoring and on the job coaching\n\n\nAre you passionate about solving complex analytical problems, learning about the latest in cutting-edge Al and continuing to develop your analytical and business development skills? If you answered yes, then we have an opportunity waiting for you!\n\nWhat will your typical day look like?\n\nAs a Machine Learning Operations Engineer, you will take a hands-on role in delivering advisory services to high growth organizations with a diverse team consisting of data scientists, data architects, software developers, information designers, and business/industry leaders. You will work with the team to design, develop, deploy, and manage machine learning models at scale in production for our clients. You will play a role in pitches and proposal bids, and will assist in different areas of project of project management, including client projects and internal initiatives.\n\nAbout The Team\n\nDeloitte AI and Data, Deloitte's Artificial Intelligence (Al) practice is comprised of Al/ML experts with hands-on experience in developing and deploying Al/ML solutions to create competitive advantage for the Canadian businesses as part of their overall Data and Al/ML transformations journey. AI and Data Data Science team works together with Canadian businesses to envision and craft the solutions that drive automation, optimization, efficiency and many cases new opportunities with being mindful of driving responsible and transparent Al. We strive for empowering our clients' organization to become data and insight driven organizations with Al/ML first mindset to produce tangible business outcomes.\n\nData Science team will work with our clients to:\n\n Assess, recommend and create business capability roadmaps where Data Science can provide a significant business value and impact\n Harnessing data to craft best Al/ML driven solutions solving business problems and creating business opportunities\n Deploy Al/ML solutions with the state-of-the-art MLOps practices\n Leverage visual analytics to maximize business gain from data driven insights and findings\n\nEnough about us, let’s talk about you\n\nYou are someone with:\n\n3+ years relevant work experience with building and automating data analytics and Machine Learning (ML) pipelines\nGood understanding of ML and Al concepts. Hands-on experience in ML model development.\nExperience in operationalization of Machine Learning projects (MLOps) using at least one of the popular frameworks or platforms (e.g. Kubeflow, AWS Sagemaker, Google Al Platform, Azure Machine Learning, DataRobot, MLFlow).\nStrong experience in Python used both for ML and automation tasks.\nDatabase and programming languages experience and data manipulation and integration skills using SQL, Oracle, Hadoop, NoSQL Databases, or similar tools\nExperience with Kubernetes and the ecosystem of Cloud Native tools.\nAbility to work with data with significant ambiguity, develop creative approaches to analytical problems, and interpret data and results from a business/industry perspective\nStrong oral and written communication skills\nMinimum Bachelor degree in Computer Science, Software Engineering, Electrical Engineering, Computer Engineering or related field.\nExperience with Azure or AWS platforms is an asset\nProject management experience is an asset\nProfessional services, consulting, or advisory experience is an asset \n\nTotal Rewards\n\nThe salary range for this position is $72,000 - $138,000, and individuals may be eligible to participate in our bonus program. Deloitte is fair and competitive when it comes to the salaries of our people. We regularly benchmark across a variety of positions, industries, sectors, targets, and levels. Our approach is grounded on recognizing people's unique strengths and contributions and rewarding the value that they deliver.\n\nOur Total Rewards Package extends well beyond traditional compensation and benefit programs and is designed to recognize employee contributions, encourage personal wellness, and support firm growth. Along with a competitive base salary and variable pay opportunities, we offer a wide array of initiatives that differentiate us as a people-first organization. On top of our regular paid vacation days, some examples include: $4,000 per year for mental health support benefits, a $1,300 flexible benefit spending account, firm-wide closures known as \"Deloitte Days\", dedicated days of for learning (known as Development and Innovation Days), flexible work arrangements and a hybrid work structure.\n\nOur promise to our people: Deloitte is where potential comes to life.\n\nBe yourself, and more.\n\nWe are a group of talented people who want to learn, gain experience, and develop skills. Wherever you are in your career, we want you to advance.\n\nYou Shape How We Make Impact.\n\nDiverse perspectives and life experiences make us better. Whoever you are and wherever you’re from, we want you to feel like you belong here. We provide flexible working options to support you and how you can contribute.\n\nBe the leader you want to be \n\nSome guide teams, some change culture, some build essential expertise. We offer opportunities and experiences that support your continuing growth as a leader.\n\nHave as many careers as you want.\n\nWe are uniquely able to offer you new challenges and roles – and prepare you for them. We bring together people with unique experiences and talents, and we are the place to develop a lasting network of friends, peers, and mentors.\n\nThe next step is yours\n\nAt Deloitte, we are all about doing business inclusively – that starts with having diverse colleagues of all abilities. Deloitte encourages applications from all qualified candidates who represent the full diversity of communities across Canada. This includes, but is not limited to, people with disabilities, candidates from Indigenous communities, and candidates from the Black community in support of living our values, creating a culture of Diversity Equity and Inclusion and our commitment to our AccessAbility Action Plan , Reconciliation Action Plan and the BlackNorth Initiative .\n\nWe encourage you to connect with us at accessiblecareers@deloitte.ca if you require an accommodation for the recruitment process (including alternate formats of materials, accessible meeting rooms or other accommodations) or indigenouscareers@deloitte.ca for any questions relating to careers for Indigenous peoples at Deloitte (First Nations, Inuit, Métis).\n\nBy applying to this job you will be assessed against the Deloitte Global Talent Standards. We’ve designed these standards to provide our clients with a consistent and exceptional Deloitte experience globally.\n\nDeloitte Canada has 20 offices with representation across most of the country. We acknowledge that Deloitte offices stand on traditional, treaty, and unceded territories in what is now known as Canada. We recognize that Indigenous Peoples have been the caretakers of this land since time immemorial, nurturing its resources and preserving its natural beauty. We acknowledge this land is still home to many First Nations, Inuit, and Métis Peoples, who continue to maintain their deep connection to the land and its sacred teachings. We humbly acknowledge that we are all Treaty people, and we commit to fostering a relationship of respect, collaboration, and stewardship with Indigenous communities in our shared goal of reconciliation and environmental sustainability.",
    "scraped_at": "2025-06-05T14:49:26.096482"
  },
  "753ded649829770ed3747be9e37d052b4279445b059e106ba19795a24f3612e8": {
    "company_name": "Scotiabank",
    "company_url": "https://www.linkedin.com/company/scotiabank/life",
    "job_title": "Senior AI/ML Engineer",
    "job_url": "https://www.linkedin.com/jobs/view/4238493184/?alternateChannel=search&refId=lHAPlyzs2MZlU1Mf16jUoQ%3D%3D&trackingId=PTqJbpS0mjYcEgeTzlGDvg%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nRequisition ID: 226989\n\nJoin a purpose driven winning team, committed to results, in an inclusive and high-performing culture.\n\nOverview\n\nWe are seeking a seasoned and strategic Senior AI/ML Engineer to join our Global Wealth Management Technology (GWMT) team.\n\nThis role is ideal for a hands-on engineer with 5–7 years of experience in building scalable AI/ML systems, enabling production-grade workflows, and mentoring junior engineers. You will drive innovation at the intersection of financial data, cloud infrastructure, and advanced machine learning.\n\nWhy Join Us\n\nScotiabank’s Global Wealth Management (GWM) division is dedicated to delivering personalized financial advice, investment management, and estate planning solutions to clients globally.\nAs part of this forward-thinking organization, you'll help develop intelligent, secure, and scalable platforms that elevate both client and advisor experiences. \nYour work will directly contribute to the next generation of wealth services through data-driven innovation and responsible AI practices.\n\nKey Responsibilities\n\nLead the development, deployment, and monitoring of complex AI/ML models, including deep learning and natural language applications.\nBuild and manage scalable ML pipelines using tools like Airflow, dbt, or Google Dataflow for both batch and streaming data workloads.\nArchitect and optimize data workflows using modern data warehousing and lake technologies such as Databricks, BigQuery, Synapse, and Delta Lake.\nDesign and operate real-time pipelines using Kafka, Pub/Sub, or similar event-streaming platforms.\nImplement and maintain robust CI/CD processes for ML using MLflow, Kubeflow, or equivalent orchestration tools.\nDevelop and deploy models on cloud-native infrastructure using Azure ML, Vertex AI, Docker, and Kubernetes.\nApply MLOps best practices for versioning, monitoring, retraining, and explainability.\nMentor L7 engineers, support code reviews, and contribute to a collaborative engineering culture.\nEnsure secure model development, including encryption, RBAC, and compliance with GDPR, PIPEDA, and GLBA.\nCollaborate with data engineers, architects, and product teams to translate financial business problems into machine learning solutions.\n\nMinimum Qualifications\n\n5–7 years of professional experience delivering AI/ML solutions in production environments.\nProficiency in Python and ML libraries such as TensorFlow, PyTorch, Scikit-learn, and XGBoost.\nExperience building or contributing to at least one production-grade RAG pipeline, using vector databases such as Azure Cognitive Search, GCP Vertex AI Matching Engine, FAISS, or Pinecone.\nHands-on experience with orchestration frameworks like LangChain, LlamaIndex, or Semantic Kernel for chaining context-aware agentic workflows.\nProven experience with data pipeline orchestration and ML lifecycle tools (e.g., Airflow, MLflow, Kubeflow).\nHands-on experience with cloud platforms (Azure, GCP) and container orchestration (Docker, Kubernetes).\nStrong understanding of data architecture concepts, including ETL, streaming, and warehouse modeling.\nDemonstrated experience mentoring junior engineers and leading technical initiatives.\n\nPreferred Skills\n\nExperience using managed vector search platforms like Azure AI Search and GCP Matching Engine in retrieval-augmented systems.\nProficiency in Terraform, Pulumi, or Azure Resource Manager (ARM) for infrastructure automation.\nFamiliarity with observability and monitoring stacks (Prometheus, Grafana, Azure Monitor, GCP Logging).\nKnowledge of model explainability frameworks such as SHAP, LIME, or counterfactual analysis tools.\nPrior exposure to financial services data, models, or regulatory environments is a bonus.\n\nWhat’s In It For You\n\nYou'll get to work with and learn from diverse industry leaders, who have hailed from top technology companies around the world.\nWe foster an environment of innovation and continuous learning. We have an inclusive and collaborative working environment that encourages creativity, curiosity, and celebrates success!\nWe provide employees with an environment that is safe, inclusive, and reflective of all communities by promoting fair and equitable treatment and prioritizing unconscious bias and anti-racism training.\nWe offer a competitive total rewards package, including a performance bonus, company matching programs (pension & Employee Share Ownership), generous vacation; health/medical/wellness benefits; employee banking privileges.\nWhen in person collaboration is required, you can take advantage of our new state of the art ecosystems with a design focus on enabling collaboration through both environment and technology.\n\nScotiatechnology, #AIMLEngineer, #Wealthmanagement Li-Hybrid\n\nLocation(s): Canada : Ontario : Toronto\n\nScotiabank is a leading bank in the Americas. Guided by our purpose: \"for every future\", we help our customers, their families and their communities achieve success through a broad range of advice, products and services, including personal and commercial banking, wealth management and private banking, corporate and investment banking, and capital markets.\n\nAt Scotiabank, we value the unique skills and experiences each individual brings to the Bank, and are committed to creating and maintaining an inclusive and accessible environment for everyone. If you require accommodation (including, but not limited to, an accessible interview site, alternate format documents, ASL Interpreter, or Assistive Technology) during the recruitment and selection process, please let our Recruitment team know. If you require technical assistance, please click here. Candidates must apply directly online to be considered for this role. We thank all applicants for their interest in a career at Scotiabank; however, only those candidates who are selected for an interview will be contacted.",
    "scraped_at": "2025-06-05T14:49:28.823174"
  },
  "ac8ab00c5aa7225f047e3a67884ac0cf3d3f7c8e5237e7890933310a608a72e8": {
    "company_name": "Shopify",
    "company_url": "https://www.linkedin.com/company/shopify/life",
    "job_title": "Applied ML Engineering, GenAI / AI Agent (Americas)",
    "job_url": "https://www.linkedin.com/jobs/view/4229150727/?alternateChannel=search&refId=lHAPlyzs2MZlU1Mf16jUoQ%3D%3D&trackingId=iB2vULuhN4vVUw7aKwT8bw%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nAbout The Role\n\nRole Overview:\n\nAt Shopify, we are developing an innovative AI Personal Shopper designed to redefine the online shopping experience for buyers. Our aim is to provide an exceptional concierge service tailored to individual preferences and needs, revolutionizing how customers interact with Shop and Storefronts.\n\nLeveraging cutting-edge AI technology, including Large Language Models (LLM) and advanced machine learning algorithms, we will harness the power of data analytics and build upon the solid platform foundation of the Assistant projects in Shopify. This enables us to deliver personalized recommendations, exclusive offers, and insightful suggestions that cater to each user's unique taste. Our AI technology will analyze user behavior, preferences, and inventory levels in real-time, ensuring that shoppers receive highly relevant and customized suggestions. Our AI Personal Shopper will be an indispensable ally for every shopper, assisting with everything from curating outfits to finding the perfect gifts.\n\nTo expedite this effort, we are seeking Machine Learning Engineering (MLE) leads and individual contributors to join our team and help shape the future of online shopping. Together, we will create an unparalleled shopping experience that exceeds customer expectations and redefines the e-commerce landscape.\n\nYou and your team won't just be working on theoretical concepts – you'll be at the forefront of implementing AI systems at scale, directly empowering our merchants. We're all about creating tangible solutions that make a real difference in the day to day lives of entrepreneurs.\n\nKey outputs:\n\nDeveloping and deploying Generative AI, natural language processing and machine learning models\nProducing system design and architecture of scalable AI/ML systems\nDesigning and implementing data pipelines for fine-tuning LLMs \nSolving high impact data problems and delivering business impact through data and machine learning products\nPrioritizing and communicating to technical and non-technical audiences alike\n\n\nQualifications:\n\nDemonstrated mastery building data products that use generative AI, RLHF and fine-tuning LLMs\nEnd-to-end experience of training, evaluating, testing and deploying machine learning products at scale\nExperience building data pipelines and driving ETL design decisions leveraging disparate data sources\nExperience with the following: Python, shell scripting, streaming and batch data pipelines, vector databases, DBT, BigQuery, BigTable or equivalent, orchestration tools\nExperience with running machine learning in parallel environments (e.g. distributed clusters, GPU optimization)\n\n\nThis role may require on-call work\n\nAbout Shopify\n\nOpportunity is not evenly distributed. Shopify puts independence within reach for anyone with a dream to start a business. We propel entrepreneurs and enterprises to scale the heights of their potential. Since 2006, we’ve grown to over 8,300 employees and generated over $1 trillion in sales for millions of merchants in 175 countries.\n\nThis is life-defining work that directly impacts people’s lives as much as it transforms your own. This is putting the power of the few in the hands of the many, is a future with more voices rather than fewer, and is creating more choices instead of an elite option.\n\nAbout You\n\nMoving at our pace brings a lot of change, complexity, and ambiguity—and a little bit of chaos. Shopifolk thrive on that and are comfortable being uncomfortable. That means Shopify is not the right place for everyone.\n\nBefore you apply, consider if you can:\n\nCare deeply about what you do and about making commerce better for everyone\nExcel by seeking professional and personal hypergrowth\nKeep up with an unrelenting pace (the week, not the quarter)\nBe resilient and resourceful in face of ambiguity and thrive on (rather than endure) change\nBring critical thought and opinion\nUse AI tools reflexively as part of your fundamental workflow\nEmbrace differences and disagreement to get shit done and move forward\nWork digital-first for your daily work",
    "scraped_at": "2025-06-05T14:49:32.652435"
  },
  "63ea25f6261d756301fbfc7d874de5bbd84284addb3ec557b3d273c1ac6292e2": {
    "company_name": "Amazon Web Services (AWS)",
    "company_url": "https://www.linkedin.com/company/amazon-web-services/life",
    "job_title": "Delivery Consultant - GenAI/ML, AWS Industries",
    "job_url": "https://www.linkedin.com/jobs/view/4181780685/?alternateChannel=search&refId=lHAPlyzs2MZlU1Mf16jUoQ%3D%3D&trackingId=KVegc3KUDKaSSWkPUyyRfw%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nDescription\n\nAre you looking to work at the forefront of Machine Learning and AI? Would you be excited to apply cutting edge Generative AI algorithms to solve real world problems with significant impact? Machine learning (ML) has been strategic to Amazon from the early years. We are pioneers in areas such as recommendation engines, product search, eCommerce fraud detection, and large-scale optimization of fulfillment center operations. The AWS Industries Team at AWS helps AWS customers implement Generative AI solutions and realize transformational business opportunities for AWS customers in the most strategic industry verticals. This is a team of architects, data scientists, and engineers working step-by-step with customers to build bespoke solutions that harness the power of generative AI.\n\nThe Amazon Web Services Professional Services (ProServe) team is seeking a skilled Delivery Consultant to join our team at Amazon Web Services (AWS). In this role, you'll work closely with customers to design, implement, and manage AWS solutions that meet their technical requirements and business objectives. You'll be a key player in driving customer success through their cloud journey, providing technical expertise and best practices throughout the project lifecycle.\n\nPossessing a deep understanding of AWS products and services, as a Delivery Consultant you will be proficient in architecting complex, scalable, and secure solutions tailored to meet the specific needs of each customer. You’ll work closely with stakeholders to gather requirements, assess current infrastructure, and propose effective migration strategies to AWS. As trusted advisors to our customers, providing guidance on industry trends, emerging technologies, and innovative solutions, you will be responsible for leading the implementation process, ensuring adherence to best practices, optimizing performance, and managing risks throughout the project.\n\nThe AWS Professional Services organization is a global team of experts that help customers realize their desired business outcomes when using the AWS Cloud. We work together with customer teams and the AWS Partner Network (APN) to execute enterprise cloud computing initiatives. Our team provides assistance through a collection of offerings which help customers achieve specific outcomes related to enterprise cloud adoption. We also deliver focused guidance through our global specialty practices, which cover a variety of solutions, technologies, and industries.\n\nKey job responsibilities\n\nAs an experienced technology professional, you will be responsible for:\n\nDesigning, implementing, and building complex, scalable, and secure GenAI and ML applications and models built on AWS tailored to customer needs\nProviding technical guidance and implementation support throughout project delivery, with a focus on using AWS AI/ML services\nCollaborating with customer stakeholders to gather requirements and propose effective model training, building, and deployment strategies\nActing as a trusted advisor to customers on industry trends and emerging technologies\nSharing knowledge within the organization through mentoring, training, and creating reusable artifacts\n\nAbout The Team\n\nAbout AWS:\n\nDiverse Experiences: AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job below, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\n\nWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\n\nInclusive Team Culture - Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.\n\nMentorship & Career Growth - We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\n\nWork/Life Balance - We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\n\nBasic Qualifications\n\n Experience developing software code in one or more programming languages (java, python, etc.)\n Bachelor of Science degree in Computer Science, or related technical, math, or scientific field (or equivalent experience)\n 2+ years of cloud based solution (AWS or equivalent), system, network and operating system experience\n 2+ years of experience hosting and deploying GenAI/ML solutions (e.g., for training, fine tuning, and inferences)\n\nPreferred Qualifications\n\n AWS experience preferred, with proficiency in a wide range of AWS services such as SageMaker, Bedrock, EMR, S3, OpenSearch Service, Step Functions, Lambda, and EC2\n Strong working knowledge of deep learning, machine learning and statistics\n Hands on experience with deep learning (e.g., CNN, RNN, LSTM, Transformer), machine learning, CV, GNN, or distributed training\n Strong communication skills with the ability to explain technical concepts to both technical and non-technical audiences\n\nAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\nThe base salary for this position ranges from $99,900/year up to $166,900/year. Salary is based on a number of factors and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. Applicants should apply via our internal or external career site.\n\n\nCompany - Amazon Web Services Canada, Inc.\n\nJob ID: A2923489",
    "scraped_at": "2025-06-05T14:49:35.425848"
  },
  "062326f6cd105d0ca7cf9601370516ce7d1d07607b9fc0e0ba235263e647161b": {
    "company_name": "Sanofi",
    "company_url": "https://www.linkedin.com/company/sanofi/life",
    "job_title": "ML Engineer",
    "job_url": "https://www.linkedin.com/jobs/view/4244019590/?alternateChannel=search&refId=lHAPlyzs2MZlU1Mf16jUoQ%3D%3D&trackingId=r%2FQxVQLwK6ndCY9vT4HqUw%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nReference No. R2791160\n\nPosition Title: MLOps Engineer\n\nDepartment: MLOps Engineering\n\nLocation: Toronto, Ontario, Hybrid\n\nAbout The Job\n\nOur Hubs are a crucial part of how we innovate, improving performance across every Sanofi department and providing a springboard for the amazing work we do. Build a career and you can be part of transforming our business while helping to change millions of lives. Ready?\n\nSanofi has recently embarked on a vast and ambitious digital transformation program. A cornerstone of this roadmap is the acceleration of its data transformation and of the adoption of artificial intelligence (AI) and machine learning (ML) solutions, to accelerate R&D, manufacturing and commercial performance and bring better drugs and vaccines to patients faster, to improve health and save lives.\n\nWe are an innovative global healthcare company with one purpose: to chase the miracles of science to improve people’s lives. We’re also a company where you can flourish and grow your career, with countless opportunities to explore, make connections with people, and stretch the limits of what you thought was possible. Ready to get started?\n\nAbout You\n\nYou are a dynamic MLOps Engineer interested in challenging the status quo to ensure seamless AI/ML Engineering Operations that scale up Sanofi's AI solutions for the patients of tomorrow. You are an influencer and a future leader who has deployed AI/ML solutions with technically robust lifecycle management and infrastructural support. You are deeply interested in improvement opportunities and always thrive to demonstrate ability to deliver using AI/ML Engineering skills while working across the full stack and moving fluidly between programming languages and technologies.\n\nMain Responsibilities\n\nWork in an agile development pod to design, build and maintain cloud hosted AI/ML products with automated pipelines that run, monitor, and retrain ML Models \nImplement automated ML pipelines (e.g., training and inference) working closely with other peers e.g., data scientists and data engineers \nSupport life cycle management of deployed AI/ML apps (e.g., new releases, change management, monitoring and troubleshooting) \nWork as subject matter expert in MLOps (e.g., develop and maintain enterprise standards, user guides, release notes, FAQs) \nBuild processes and reusable components supporting seamless ML Operations (e.g., app monitoring, troubleshooting, life cycle management and customer support) \nWalk stakeholders and solution partners through solutions and reviewing product change and development needs \nMaintain effective relationships with app userbase to develop education and communication content as per life cycle events \nResearch and gain expertise on emerging tools and technologies. An enthusiasm to ask questions and try and learn new things is essential \n\nKey Technical Skills\n\nUniversity degree (Bachelor, Master or PhD) in Computer Science, Information Systems, Software Engineering, or another quantitative field. \nMinimum 2 years of experience in building, deploying, monitoring and maintaining AI/ML applications utilizing cloud technologies (e.g., AWS, GCP, Azure, Snowflake etc.). \nAbility to work across the full stack and move fluidly between programming languages (e.g., Python) and MLOps technologies (e.g. Github, Argo, Metaflow, WandB, Snowflake, AWS SageMaker) \nExperience in implementing CI/CD pipelines for AI/ML driven app development \nExperience in building and deploying apps with large scale data and ML pipelines \nAbility to assess new technologies and compile architecture decision records (ADRs) \nExperience working in an agile team supporting and working with cross-functional teams \nKnowledge of relational (e.g., Postgres SQL) and non-relational databases (e.g., Graph database, Vector Database etc.) \nExperience in visualization technologies (e.g. Python DASH, Tableau, PowerBI) \nExperience in developing and maintaining backend APIs (e.g. REST) \nExperience in provisioning cloud infrastructure leveraging Infrastructure as a code tools (e.g.: Docker, Kubernetes, Terraform) \nExperience in cloud-based ML engineering in an industrial setting within a global organization (technology company preferred) \nExperience in working within compliance (e.g. quality, regulatory - data privacy, GxP, SOX) and knowledge in cybersecurity is a plus \n\nWhy Choose Us? \n\nBring the miracles of science to life alongside a supportive, future-focused team.\nDiscover endless opportunities to grow your talent and drive your career, whether it’s through a promotion or lateral move, at home or internationally.\nEnjoy a thoughtful, well-crafted rewards package that recognizes your contribution and amplifies your impact.\nTake good care of yourself and your family, with a wide range of health and wellbeing benefits including high-quality healthcare, prevention and wellness programs\n\nThis position is for a current vacant role that we are actively hiring for.\n\nSanofi is an equal opportunity employer committed to diversity and inclusion. Our goal is to attract, develop and retain highly talented employees from diverse backgrounds, allowing us to benefit from a wide variety of experiences and perspectives. We welcome and encourage applications from all qualified applicants. Accommodations for persons with disabilities required during the recruitment process are available upon request.\n\n#GD-SP\n\n#DBBCA\n\nAll compensation will be determined commensurate with demonstrated experience. Employees may be eligible to participate in Company employee benefit programs, and additional benefits information can be found here.\n\nLes employés peuvent être admissibles à participer aux programmes d'avantages sociaux de l'entreprise. Des informations supplémentaires sur les avantages sociaux peuvent être trouvées ici.",
    "scraped_at": "2025-06-05T14:49:38.112044"
  },
  "8dd4d8a92ffbe8c8b428a54943fd76f50730d475d651b2a0e3ff63cb32be8038": {
    "company_name": "Ansys",
    "company_url": "https://www.linkedin.com/company/ansys-inc/life",
    "job_title": "R&D Engineer II - Desktop AI/ML",
    "job_url": "https://www.linkedin.com/jobs/view/4209248442/?alternateChannel=search&refId=lHAPlyzs2MZlU1Mf16jUoQ%3D%3D&trackingId=eHG3M6YhIldwCGWe4eiH6A%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nRequisition #: 15764\n\nOur Mission: Powering Innovation That Drives Human Advancement  \n\nWhen visionary companies need to know how their world-changing ideas will perform, they close the gap between design and reality with Ansys simulation. For more than 50 years, Ansys software has enabled innovators across industries to push boundaries by using the predictive power of simulation. From sustainable transportation to advanced semiconductors, from satellite systems to life-saving medical devices, the next great leaps in human advancement will be powered by Ansys.\n\nInnovate With Ansys, Power Your Career. \n\nSummary\n\nThe R&D Engineer II contributes to the development of software products and supporting systems. In this role, the R&D Engineer II will collaborate with a team of expert professionals to understand customer requirements and accomplish development objectives. This includes the\n\ntransformation and componentization of industry-leading Electronics products, and integration\n\ninto an emerging Python developer ecosystem.\n\nResponsibilities\n\n Performs moderately complex development activities, including the design, implementation, maintenance, testing and documentation of software modules and subsystems \n Understands and employs best practices \n Performs moderately complex bug verification, release testing and beta support for assigned products. Researches problems discovered by QA or product support and develops solutions \n Understands the marketing requirements for a product, including target environment, performance criteria and competitive issues \n Works under the general supervision of a development manager \n\nMinimum Qualifications\n\n BS in Engineering, Computer Science, or related field with 2 years' experience or MS \n Working experience with software design and development methodologies \n Demonstrated experience with C++ and Python \n\nPreferred Qualifications\n\n MS in Engineering or Computer Science \n Experience as a software developer working with AI/ML to include data science aspects, implementation of appropriate ML algorithms, model packaging/deployment, and LLMs \n Experience in a large-scale commercial software development environment \n Good communication and interpersonal skills \n Ability to learn quickly and to collaborate with others in a geographically distributed team \n\nAt Ansys, we know that changing the world takes vision, skill, and each other. We fuel new ideas, build relationships, and help each other realize our greatest potential. We are ONE Ansys. We operate on three key components: our commitments to stakeholders, our values that guide how we work together, and our actions to deliver results. As ONE Ansys, we are powering innovation that drives human advancement\n\nOur Commitments\n\nAmaze with innovative products and solutions\nMake our customers incredibly successful\nAct with integrity\nEnsure employees thrive and shareholders prosper\n\nOur Values\n\nAdaptability: Be open, welcome what’s next\nCourage: Be courageous, move forward passionately\nGenerosity: Be generous, share, listen, serve\nAuthenticity: Be you, make us stronger\n\nOur Actions\n\nWe commit to audacious goals\nWe work seamlessly as a team\nWe demonstrate mastery\nWe deliver outstanding results\n\nVALUES IN ACTION\n\nAnsys is committed to powering the people who power human advancement. We believe in creating and nurturing a workplace that supports and welcomes people of all backgrounds; encouraging them to bring their talents and experience to a workplace where they are valued and can thrive.\n\nOur culture is grounded in our four core values of adaptability, courage, generosity, and authenticity. Through our behaviors and actions, these values foster higher team performance and greater innovation for our customers.\n\nWe’re proud to offer programs, available to all employees, to further impact innovation and business outcomes, such as employee networks and learning communities that inform solutions for our globally minded customer base.\n\nWelcome What’s Next In Your Career At Ansys\n\nAt Ansys, you will find yourself among the sharpest minds and most visionary leaders across the globe. Collectively, we strive to change the world with innovative technology and transformational solutions. With a prestigious reputation in working with well-known, world-class companies, standards at Ansys are high — met by those willing to rise to the occasion and meet those challenges head on. Our team is passionate about pushing the limits of world-class simulation technology, empowering our customers to turn their design concepts into successful, innovative products faster and at a lower cost. Ready to feel inspired? Check out some of our recent customer stories, here and here .\n\nAt Ansys, it’s about the learning, the discovery, and the collaboration. It’s about the “what’s next” as much as the “mission accomplished.” And it’s about the melding of disciplined intellect with strategic direction and results that have, can, and do impact real people in real ways. All this is forged within a working environment built on respect, autonomy, and ethics.\n\nCREATING A PLACE WE’RE PROUD TO BE\n\nAnsys is an S&P 500 company and a member of the NASDAQ-100. We are proud to have been recognized for the following more recent awards, although our list goes on: Newsweek’s Most Loved Workplace globally and in the U.S., Gold Stevie Award Winner, America’s Most Responsible Companies, Fast Company World Changing Ideas, Great Place to Work Certified (China, Greece, France, India, Japan, Korea, Spain, Sweden, Taiwan, and U.K.).\n\nFor more information, please visit us at www.ansys.com\n\nAnsys is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other protected characteristics.\n\nAnsys does not accept unsolicited referrals for vacancies, and any unsolicited referral will become the property of Ansys. Upon hire, no fee will be owed to the agency, person, or entity.",
    "scraped_at": "2025-06-05T14:49:41.293041"
  },
  "150bc11b0f7985eb2117cd09c64c5f51ac0043cd3888a42c0e0a89319be1cd8e": {
    "company_name": "Amazon Web Services (AWS)",
    "company_url": "https://www.linkedin.com/company/amazon-web-services/life",
    "job_title": "Delivery Consultant - GenAI/ML, AWS Industries",
    "job_url": "https://www.linkedin.com/jobs/view/4181783316/?alternateChannel=search&refId=lHAPlyzs2MZlU1Mf16jUoQ%3D%3D&trackingId=N3bNamPyyHxUecOTeuDmVw%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nDescription\n\nAre you looking to work at the forefront of Machine Learning and AI? Would you be excited to apply cutting edge Generative AI algorithms to solve real world problems with significant impact? Machine learning (ML) has been strategic to Amazon from the early years. We are pioneers in areas such as recommendation engines, product search, eCommerce fraud detection, and large-scale optimization of fulfillment center operations. The AWS Industries Team at AWS helps AWS customers implement Generative AI solutions and realize transformational business opportunities for AWS customers in the most strategic industry verticals. This is a team of architects, data scientists, and engineers working step-by-step with customers to build bespoke solutions that harness the power of generative AI.\n\nThe Amazon Web Services Professional Services (ProServe) team is seeking a skilled Delivery Consultant to join our team at Amazon Web Services (AWS). In this role, you'll work closely with customers to design, implement, and manage AWS solutions that meet their technical requirements and business objectives. You'll be a key player in driving customer success through their cloud journey, providing technical expertise and best practices throughout the project lifecycle.\n\nPossessing a deep understanding of AWS products and services, as a Delivery Consultant you will be proficient in architecting complex, scalable, and secure solutions tailored to meet the specific needs of each customer. You’ll work closely with stakeholders to gather requirements, assess current infrastructure, and propose effective migration strategies to AWS. As trusted advisors to our customers, providing guidance on industry trends, emerging technologies, and innovative solutions, you will be responsible for leading the implementation process, ensuring adherence to best practices, optimizing performance, and managing risks throughout the project.\n\nThe AWS Professional Services organization is a global team of experts that help customers realize their desired business outcomes when using the AWS Cloud. We work together with customer teams and the AWS Partner Network (APN) to execute enterprise cloud computing initiatives. Our team provides assistance through a collection of offerings which help customers achieve specific outcomes related to enterprise cloud adoption. We also deliver focused guidance through our global specialty practices, which cover a variety of solutions, technologies, and industries.\n\nKey job responsibilities\n\nAs an experienced technology professional, you will be responsible for:\n\nDesigning, implementing, and building complex, scalable, and secure GenAI and ML applications and models built on AWS tailored to customer needs\nProviding technical guidance and implementation support throughout project delivery, with a focus on using AWS AI/ML services\nCollaborating with customer stakeholders to gather requirements and propose effective model training, building, and deployment strategies\nActing as a trusted advisor to customers on industry trends and emerging technologies\nSharing knowledge within the organization through mentoring, training, and creating reusable artifacts\n\nAbout The Team\n\nAbout AWS:\n\nDiverse Experiences: AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job below, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\n\nWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\n\nInclusive Team Culture - Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.\n\nMentorship & Career Growth - We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\n\nWork/Life Balance - We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\n\nBasic Qualifications\n\n Experience developing software code in one or more programming languages (java, python, etc.)\n Bachelor of Science degree in Computer Science, or related technical, math, or scientific field (or equivalent experience)\n 2+ years of cloud based solution (AWS or equivalent), system, network and operating system experience\n 2+ years of experience hosting and deploying GenAI/ML solutions (e.g., for training, fine tuning, and inferences)\n\nPreferred Qualifications\n\n AWS experience preferred, with proficiency in a wide range of AWS services such as SageMaker, Bedrock, EMR, S3, OpenSearch Service, Step Functions, Lambda, and EC2\n Strong working knowledge of deep learning, machine learning and statistics\n Hands on experience with deep learning (e.g., CNN, RNN, LSTM, Transformer), machine learning, CV, GNN, or distributed training\n Strong communication skills with the ability to explain technical concepts to both technical and non-technical audiences\n\nAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\nThe base salary for this position ranges from $99,900/year up to $166,900/year. Salary is based on a number of factors and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. Applicants should apply via our internal or external career site.\n\n\nCompany - Amazon Web Services Canada, Inc.\n\nJob ID: A2923489",
    "scraped_at": "2025-06-05T14:49:44.214480"
  },
  "dbb4606f8ee7f502f14cad10e859199aa95ece86cbab759ac3c771854e4ca229": {
    "company_name": "Enable",
    "company_url": "https://www.linkedin.com/company/enable-software/life",
    "job_title": "Tech Lead Platform Engineer - AI & ML Ops",
    "job_url": "https://www.linkedin.com/jobs/view/4213386563/?alternateChannel=search&refId=lHAPlyzs2MZlU1Mf16jUoQ%3D%3D&trackingId=b8%2BrXgzdD9647ThkqvGW5w%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nManaging pricing and rebates shouldn’t be a hassle. Enable’s intelligent platform is built for the speed of today’s market, eliminating disconnects between pricing strategy and rebate execution. We help companies to increase profitability and simplify the complex with accurate, AI-powered insights, real-time performance monitoring, agreement optimization, and simplified rebate management.\n\nAfter securing $291M in Series A-D funding and acquiring Flintfox in 2025, Enable is positioned for continued, significant growth. Since the launch of our flagship product in 2016, we have been rapidly scaling our client base, product offerings, and built a team of top-tier professionals committed to reshaping the industry.\n\nWant a glimpse into life at Enable? Visit our  Life at Enable  page to learn how you can be part of our journey.\n\nJob Summary\n\nWe are seeking a Tech Lead Platform Engineer – AI & MLOps to drive the evolution of Enable’s cloud-native platform, ensuring scalability, reliability, and efficiency across all aspects of our SaaS infrastructure. This role will focus on architecting and optimizing our platform for high-performance distributed systems while also enabling machine learning (MLOps) capabilities for AI-driven applications.\n\nAs a key technical leader, you will collaborate across teams to develop best-in-class platform solutions that support product engineering, data engineering, and AI/ML teams. You will establish best practices, automate workflows, and ensure that Enable’s infrastructure is secure, resilient, and future-proof.\n\nKey Responsibilities - SaaS Platform Engineering\n\nDesign, build, and optimize a cloud-native, multi-tenant SaaS platform that scales with Enable’s rapid growth.\nDevelop and maintain core infrastructure components, including compute, networking, observability, and CI/CD pipelines.\nImplement best practices for cloud cost optimization, security, and system reliability.\nEnhance API gateways, identity management, and service orchestration for seamless integration across services.\n\n\nKey Responsibilities - MLOps & AI Infrastructure\n\nArchitect and manage scalable AI/ML pipelines for model training, deployment, and monitoring.\nDevelop and maintain MLOps workflows using tools like Kubeflow and MLflow.\nOptimize ML model inference for real-time and batch processing in a production SaaS environment.\nCollaborate with data scientists and ML engineers to streamline model lifecycle management.\n\n\nKey Responsibilities - Automation, Observability & Performance\n\nImplement and refine Infrastructure-as-Code (IaC) practices using Terraform or Pulumi.\nBuild self-healing, automated monitoring solutions for system health, application performance, and security.\nImprove CI/CD processes to support high-velocity engineering teams with minimal operational overhead.\nEstablish robust logging, tracing, and metrics collection for visibility into SaaS application performance.\n\n\nKey Responsibilities - Cross-Functional Collaboration & Leadership\n\nWork closely with engineering teams to ensure platform capabilities support product innovation and reliability.\nPartner with security teams to ensure compliance with SaaS security and compliance standards and best practices.\nImplement monitoring, logging, and alerting solutions to track model and system performance, ensuring compliance with best practices.\nDefine and document platform engineering best practices to elevate team-wide capabilities.\nMentor junior and mid-level engineers, fostering a culture of technical excellence and continuous learning.\n\n\nQualifications\n\n8+ years of experience in platform, DevOps, or cloud engineering, with at least 3+ years in SaaS environments.\nBachelor’s degree in Computer Science, Engineering, or a related field.\nExpertise in architecting, deploying, and managing cloud-native applications on AWS, GCP, or Azure.\nStrong experience with Kubernetes, serverless computing, and container orchestration.\nProficiency in modern Infrastructure-as-Code (Terraform, Pulumi) and CI/CD tools (GitHub Actions, ArgoCD).\nExperience in distributed systems, service mesh technologies (Istio, Linkerd), and event-driven architectures.\nHands-on experience with databases (SQL, NoSQL, vector DBs), ensuring high availability and performance.\nDeep understanding of SaaS security principles, identity management, and compliance frameworks (SOC 2, ISO 27001).\nStrong programming and automation skills in Python, SQL, and Bash.\nStrong experience with microservices architecture and API development.\nFamiliarity with MLOps frameworks and ML model operationalization.\n\n\nPreferred Qualifications\n\nExperience building and maintaining large-scale data processing pipelines.\nExpertise in observability tools such as Prometheus, Grafana, OpenTelemetry, or ELK stack.\nFamiliarity with real-time data processing and messaging platforms (Kafka, Pub/Sub, Kinesis).\nBackground in high-availability, globally distributed architectures.\nWork experience in cutting-edge AI and MLOps challenges at the intersection of ML, engineering, and cloud infrastructure.\nCertifications in cloud computing (e.g., AWS Certified DevOps Engineer, Azure DevOps Engineer).\nContributions to open-source DevOps, platform, or MLOps tooling.\n\n\nJob Title\n\nOnce hired this person will have the job title Tech Lead II, Platform Engineer - AI & ML Ops\n\n\nTotal Rewards\n\nAt Enable, we’re committed to your professional development and growth. Starting pay is determined by factors like location, skills, experience, market conditions, and internal parity.\n\nBenefits\n\nSalary/TCC is just one component of Enable’s total rewards package. Enable is committed to investing in the holistic health and wellbeing of all Enablees and their families. Our benefits and perks include, but are not limited to:\n\n Paid Time Off:  Take the time you need to relax and recharge\n\n Wellness Benefit:  Quarterly incentive dedicated to improving your health and well-being\n\n Comprehensive Insurance:  Health and life coverage for you and your family\n\n Retirement Plan:  Build your future with our retirement savings plan\n\n Lucrative Bonus Plan:  Enjoy a rewarding bonus structure subject to company or individual performance\n\n Equity Program:  Benefit from our equity program with additional options tied to tenure and performance\n\n Career Growth:  Explore new opportunities with our internal mobility program\n\n Additional Perks: \n\nFree Food: Complimentary meals, snacks, and drinks on-site in our global offices \n\nTraining: Access a range of workshops and courses designed to boost your professional growth and take your career to new heights \n\nPets: Bring your pets to our welcoming, pet-friendly offices\n\nAccording to LinkedIn's Gender Insights Report, women apply for 20% fewer jobs than men, despite similar job search behaviors. At Enable, we’re committed to closing this gap by encouraging women and underrepresented groups to apply, even if they don’t meet all qualifications.\n\nEnable is an equal opportunity employer, fostering an inclusive, accessible workplace that values diversity. We provide fair, discrimination-free employment, ensuring a harassment-free environment with equitable treatment.\n\nWe welcome applications from all backgrounds. If you need reasonable adjustments during recruitment or in the role, please let us know.",
    "scraped_at": "2025-06-05T14:49:46.816968"
  },
  "8de45e6c627906771d0d131206c779ee70cd1f7555500e91be86f5414eedb29a": {
    "company_name": "Thomson Reuters",
    "company_url": "https://www.linkedin.com/company/thomson-reuters/life",
    "job_title": "Lead Applied Scientist, NLP/ML/GenAI",
    "job_url": "https://www.linkedin.com/jobs/view/4196164887/?alternateChannel=search&refId=lHAPlyzs2MZlU1Mf16jUoQ%3D%3D&trackingId=OVDif9B2sKfzD91TnTwx7A%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nAre you excited about working at the forefront of applied research in an industry setting? Thomson Reuters Labs in Toronto is seeking scientists with a passion for solving problems using state-of-the-art information retrieval, natural language processing and generative AI.\n\nWhat does Thomson Reuters Labs do? We experiment, we build, we deliver. We support the organization and our customers through applied research in informational retrieval, natural language processing and machine learning. We work closely with product and domain experts to identify compelling solutions at the intersection of user needs and technical feasibility. Our team is responsible for designing the next generation of tax, accounting and audit compliance software for Tax Professionals and Corporates in the US, and across the global markets. We own AI innovation for Thomson Reuters’ core tax products, including CoCounsel for Tax, Checkpoint Edge, Cloud Audit Suite, SurePrep and ONESOURCE.\n\nAbout The Role\n\nLead Applied Scientists are experts in Machine Learning / NLP, responsible for the design and delivery of AI solutions that enhance Thomson Reuters' products. They leverage information retrieval techniques, prompting workflows, model training and evaluation design to build and optimize solutions. Their work ensures AI technologies are effectively aligned with business objectives, driving product innovation and value.\n\nAs a Lead Applied Scientist, you will:\n\nInnovate and drive solution delivery as a technical leader\nBe fully accountable for all research deliverables\nProvide input to the business and Labs leadership on long term AI strategy.\nLead and drive stakeholder engagement with other functions (UX, Product, Tech)\nDevelop in-depth knowledge of customer problems and data\nMaintain scientific and technical expertise in one or more relevant areas as demonstrated through product deliverables, published research, and intellectual property.\nMentor and coach other scientists and engineers on best practices\nPublications at relevant venues such as ACL, EMNLP, NAACL, NeurIPS, ICLR, SIGIR, or KDD.\n\n\nAbout You\n\nYou’re a fit for the role of Lead Applied Scientist if your background includes:\n\nPhD in a relevant discipline or Master’s plus a comparable level of experience \n7+ years of hands-on experience building IR / NLP systems for commercial applications \nExperience writing production code and ensuring well-managed software delivery \nDemonstrable experience translating complex problems into successful AI applications \nProfessional experience scaling yourself and leading through others, in an applied research setting\nOutstanding communication, problem solving, and analysis skills \nCollaborating with Product, Engineering and Business Stakeholders in an agile manner to demonstrate value and iterate with customer feedback\n\n\nWhat’s in it For You?\n\nFlexibility & Work-Life Balance: Flex My Way is a set of supportive workplace policies designed to help manage personal and professional responsibilities, whether caring for family, giving back to the community, or finding time to refresh and reset. This builds upon our flexible work arrangements, including work from anywhere for up to 8 weeks per year, empowering employees to achieve a better work-life balance.\nCareer Development and Growth: By fostering a culture of continuous learning and skill development, we prepare our talent to tackle tomorrow’s challenges and deliver real-world solutions. Our Grow My Way programming and skills-first approach ensures you have the tools and knowledge to grow, lead, and thrive in an AI-enabled future.\nIndustry Competitive Benefits: We offer comprehensive benefit plans to include flexible vacation, two company-wide Mental Health Days off, access to the Headspace app, retirement savings, tuition reimbursement, employee incentive programs, and resources for mental, physical, and financial wellbeing.\nCulture: Globally recognized, award-winning reputation for inclusion and belonging, flexibility, work-life balance, and more. We live by our values: Obsess over our Customers, Compete to Win, Challenge (Y)our Thinking, Act Fast / Learn Fast, and Stronger Together.\nSocial Impact: Make an impact in your community with our Social Impact Institute. We offer employees two paid volunteer days off annually and opportunities to get involved with pro-bono consulting projects and Environmental, Social, and Governance (ESG) initiatives.\nMaking a Real-World Impact: We are one of the few companies globally that helps its customers pursue justice, truth, and transparency. Together, with the professionals and institutions we serve, we help uphold the rule of law, turn the wheels of commerce, catch bad actors, report the facts, and provide trusted, unbiased information to people all over the world.\n\n\nIn the United States, Thomson Reuters offers a comprehensive benefits package to our employees. Our benefit package includes market competitive health, dental, vision, disability, and life insurance programs, as well as a competitive 401k plan with company match. In addition, Thomson Reuters offers market leading work life benefits with competitive vacation, sick and safe paid time off, paid holidays (including two company mental health days off), parental leave, sabbatical leave. These benefits meet or exceeds the requirements of paid time off in accordance with any applicable state or municipal laws. Finally, Thomson Reuters offers the following additional benefits: optional hospital, accident and sickness insurance paid 100% by the employee; optional life and AD&D insurance paid 100% by the employee; Flexible Spending and Health Savings Accounts; fitness reimbursement; access to Employee Assistance Program; Group Legal Identity Theft Protection benefit paid 100% by employee; access to 529 Plan; commuter benefits; Adoption & Surrogacy Assistance; Tuition Reimbursement; and access to Employee Stock Purchase Plan.\n\nThomson Reuters complies with local laws that require upfront disclosure of the expected pay range for a position. The base compensation range varies across locations.\n\nFor any eligible US locations, unless otherwise noted, the base compensation range for this role is $157,500 - $292,500.\n\nThis role may also be eligible for an Annual Bonus based on a combination of enterprise and individual performance.\n\nBase pay is positioned within the range based on several factors including an individual’s knowledge, skills and experience with consideration given to internal equity. Base pay is one part of a comprehensive Total Reward program which also includes flexible and supportive benefits and other wellbeing programs.\n\nAbout Us\n\nThomson Reuters informs the way forward by bringing together the trusted content and technology that people and organizations need to make the right decisions. We serve professionals across legal, tax, accounting, compliance, government, and media. Our products combine highly specialized software and insights to empower professionals with the data, intelligence, and solutions needed to make informed decisions, and to help institutions in their pursuit of justice, truth, and transparency. Reuters, part of Thomson Reuters, is a world leading provider of trusted journalism and news.\n\nWe are powered by the talents of 26,000 employees across more than 70 countries, where everyone has a chance to contribute and grow professionally in flexible work environments. At a time when objectivity, accuracy, fairness, and transparency are under attack, we consider it our duty to pursue them. Sound exciting? Join us and help shape the industries that move society forward.\n\nAs a global business, we rely on the unique backgrounds, perspectives, and experiences of all employees to deliver on our business goals. To ensure we can do that, we seek talented, qualified employees in all our operations around the world regardless of race, color, sex/gender, including pregnancy, gender identity and expression, national origin, religion, sexual orientation, disability, age, marital status, citizen status, veteran status, or any other protected classification under applicable law. Thomson Reuters is proud to be an Equal Employment Opportunity Employer providing a drug-free workplace.\n\nWe also make reasonable accommodations for qualified individuals with disabilities and for sincerely held religious beliefs in accordance with applicable law. More information on requesting an accommodation here.\n\nLearn more on how to protect yourself from fraudulent job postings here.\n\nMore information about Thomson Reuters can be found on thomsonreuters.com.",
    "scraped_at": "2025-06-05T14:49:50.097785"
  },
  "b531bb6ba7345ef6a32bdebf7790ee12ff14b38018e71e85b3ab787f85b21f17": {
    "company_name": "Scotiabank",
    "company_url": "https://www.linkedin.com/company/scotiabank/life",
    "job_title": "Principal AI/ML Engineer",
    "job_url": "https://www.linkedin.com/jobs/view/4238494125/?alternateChannel=search&refId=lHAPlyzs2MZlU1Mf16jUoQ%3D%3D&trackingId=n5TTn0IFdlJemdrRsDoRwg%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nRequisition ID: 226991\n\nJoin a purpose driven winning team, committed to results, in an inclusive and high-performing culture.\n\nOverview\n\nGlobal Wealth Management Technology (GWMT) is seeking an exceptional and forward-thinking Principal AI/ML Engineer to help shape and execute the next generation of intelligent solutions within GWMT.\n\nThis role is ideal for a highly competent engineer with 7–9 years of hands-on experience who can architect robust AI/ML systems, align with enterprise strategy, and elevate technical excellence across domains. You will play a pivotal role in translating business vision into AI-driven outcomes, championing scalable design, and fostering a collaborative engineering culture.\n\nWhy Join Us\n\nScotiabank’s Global Wealth Management (GWM) division empowers millions of clients worldwide with personalized financial planning, investment strategies, and advisory services.\nAs part of GWMT, you’ll work on high-impact problems that blend financial insight with advanced machine learning. You will shape cloud-native, secure, and explainable AI/ML systems that enhance advisor intelligence and client experience—while aligning to regulatory, operational, and strategic priorities.\nYou won’t just be joining a team—you’ll be helping define the future of AI in wealth management. \nOur engineering culture values autonomy, intellectual rigor, and business alignment. We’re building intelligent platforms that integrate with every layer of our advisory experience. \nYou’ll collaborate with industry veterans and technologists who are passionate about impact, precision, and doing meaningful work at scale.\nIf you’re looking to shape architectures that endure and solve hard problems that matter—this is your runway.\n\nKey Responsibilities\n\nArchitect scalable and secure ML solutions using cloud-native technologies (Azure, GCP) and distributed processing frameworks.\nLead the design, integration, and optimization of complex AI/ML systems—including RAG, agentic workflows, and multi-model orchestration.\nDevelop and maintain advanced ML Ops pipelines with robust CI/CD, testing, retraining, and observability baked in.\nTranslate evolving business objectives and regulatory requirements into practical AI frameworks and platform capabilities.\nOwn technical vision and best practices around explainability, privacy, compliance (e.g., PIPEDA, GLBA, GDPR), and governance.\nCollaborate closely with engineering leads, enterprise architects, and data teams to establish end-to-end ML infrastructure that is resilient, performant, and measurable.\nMentor senior and junior engineers alike, guiding architectural reviews, solution scoping, and delivery excellence.\n\nMinimum Must Have Qualifications\n\n7–9 years of experience building and deploying AI/ML systems in production, with a track record of leading end-to-end architecture.\nDemonstrated experience with financial services data, models, and regulatory environments (e.g., compliance logging, auditability, explainability).\nStrong applied experience with retrieval-augmented generation (RAG) systems and vector databases, including Azure Cognitive Search, GCP Matching Engine, FAISS, or Weaviate. \nProficiency in orchestration frameworks such as LangChain, LlamaIndex, or Semantic Kernel.\nHands-on expertise in infrastructure-as-code tools such as Terraform, ARM, or Pulumi.\nDeep understanding of ML lifecycle tools, including Airflow, MLflow, Kubeflow, and model registry/versioning.\nExpertise in observability stacks such as Prometheus, Grafana, Azure Monitor, or GCP Cloud Logging.\nCloud-native deployment skills (Azure ML, Vertex AI) and containerization (Docker, Kubernetes).\n\nPreferred Skills\n\nExperience designing federated learning systems or privacy-preserving ML architectures.\nFamiliarity with AI risk and controls frameworks (e.g., model validation, fairness auditing, adversarial robustness).\nAbility to present and defend architectural decisions to both technical and executive audiences.\nContributor to open-source ML/AI tools or research publications.\nExperience shaping platform-level strategies in enterprise environments or across business domains.\n\nWhat’s In It For You\n\nYou'll get to work with and learn from diverse industry leaders, who have hailed from top technology companies around the world.\nWe foster an environment of innovation and continuous learning. We have an inclusive and collaborative working environment that encourages creativity, curiosity, and celebrates success!\nWe provide employees with an environment that is safe, inclusive, and reflective of all communities by promoting fair and equitable treatment and prioritizing unconscious bias and anti-racism training.\nWe offer a competitive total rewards package, including a performance bonus, company matching programs (pension & Employee Share Ownership), generous vacation; health/medical/wellness benefits; employee banking privileges.\nWhen in person collaboration is required, you can take advantage of our new state of the art ecosystems with a design focus on enabling collaboration through both environment and technology.\n\nScotiaTechnoloy ,# AIMLArchitect, #AIMLEngineer\n\nLocation(s): Canada : Ontario : Toronto",
    "scraped_at": "2025-06-05T14:49:53.453158"
  },
  "c5bbfd0d2f939ce5dd1f832bfc87c144070d633d685bbcafdaaba07faeb5fc2d": {
    "company_name": "Ubisoft Montréal",
    "company_url": "https://www.linkedin.com/company/ubisoft-montreal/life",
    "job_title": "Senior ML Data Scientist _ Content Creation Technology Group",
    "job_url": "https://www.linkedin.com/jobs/view/4127671589/?alternateChannel=search&refId=lHAPlyzs2MZlU1Mf16jUoQ%3D%3D&trackingId=VSvwCa7ukpjflC2rFA16WQ%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nCompany Description\n\nJob Description\n\nThe Content Creation Technology Group (CCTG) is looking for a Senior ML Data scientist to work in a team that develops machine learning solutions to improve the player experience, including a project on bots that simulate real competing players. The Senior ML Data scientist will create highly efficient self-learning systems that can adapt and evolve over time, pushing the boundaries of AI technology. Join us and be at the forefront of innovation in the field of machine learning.\n\nMain responsibilities: \n\n\nCreate, validate, test and update ML algorithms and models. \nIdentify, prepare, and analyze data for training and testing purposes. \nConduct experiments, perform statistical analysis, fine-tune and optimize models. \nUse analytical rigor and statistical methods to analyze large amounts of data, developing actionable insights using advanced statistical techniques such as predictive statistical models, user/player profiling, segmentation analysis, survey design, analysis and data mining. \nOversee and design various proofs of concept to validate AI projects. \nResearch new ways for modeling and predicting behavior and design experiments to answer targeted questions. \n\n\nOther responsibilities: \n\n\nCollaborating with cross-functional teams to define project requirements and objectives. \nConducting research to stay up to date with the latest advancements. \nDocumentation, presentations, and knowledge sharing to communicate complex AI concepts to both technical and non-technical collaborators. \nMentor other members of the team. \n\n\nQualifications\n\nEducation: \n\n\nMaster's degree and/or Ph.D. preferred in applied math, statistics, machine learning or equivalent experience. \n\n\nRelevant Experience: \n\n\n3 to 5 years of complex experience and job-related in-depth expertise. \n\n\nCore Skills: \n\n\nAbility to use and develop machine learning algorithms and related proven methods. \nAbility to use advanced data science techniques. \nAbility to use statistics to understand behavior of systems and/or players. \nBeing Familiar with Big Data Technology (Hadoop, Casandra, MongoDB, ElasticSearch). \nPassion for using data science to solve problems. \nAbility to quickly assess a problem both qualitatively and quantitatively. \n\n\nOther skills: \n\n\nSoftware engineering skills. \nBeing familiar with distributed computing to train models. \nProficient in Python and have experience with libraries and frameworks such as PyTorch and/or TensorFlow. \nA good knowledge of cloud-based platforms is an asset. \nTeam player with excellent organizational, communication and interpersonal skills. \nBusiness value oriented. \nBilingualism (French, English).",
    "scraped_at": "2025-06-05T14:49:56.161193"
  },
  "eb0a50a7cf29208c5c05aa8b97f37a622dfc05f66620588c2cc01756622ee85b": {
    "company_name": "Oracle",
    "company_url": "https://www.linkedin.com/company/oracle/life",
    "job_title": "Software Developer 4 - NetSuite AI/ML",
    "job_url": "https://www.linkedin.com/jobs/view/4237802243/?alternateChannel=search&refId=lHAPlyzs2MZlU1Mf16jUoQ%3D%3D&trackingId=EP9H5Xj%2Bsla8dhmJi7Iqhg%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nJob Description\n\nAbout Oracle NetSuite \n\nOur goal is to transform how businesses operate. We help businesses achieve their vision, no matter the size or industry. We’re the #1 cloud business software, supporting more than 40,000 organizations, in more than 100 countries. Find out more about Oracle NetSuite at www.netsuite.com .\n\nOverview\n\nThe ML Operations team at Oracle-NetSuite is growing and we are looking for a strong, agile ML Ops Developer to help us invent the future. This team fills the role of a Data Engineering team but aims to provide ML tools as a service to downstream consumers. As part of our team, you will help design and develop infrastructure services to assist internal customers with their machine learning initiatives. Participating in design discussions with the team and contributing your ideas will give you a chance to help shape the future of our platform, while also ensuring end-to-end security and compliance concerns are met. You'll also be expected to help maintain and improve code quality by providing meaningful contributions to code reviews. If you are passionate about data, automation, and complex problem-solving, then we want to hear from you.\n\nCareer Level - IC4\n\nResponsibilities\n\n RESPONSIBILITIES \n\nAs an ML Ops Developer, you will play a pivotal role in building the foundation for Machine Learning at Oracle NetSuite. Key responsibilities include:\n\nDeveloping and maintaining tools and APIs that help orchestrate our Machine Learning Pipelines and infrastructure: Create, scale, and optimize our ML infrastructure to enable the seamless deployment and scalability of our AI models.\n\nAutomating Machine Learning workflows, data ETL, model deployments, and monitoring: Implement robust automation solutions for the ML workflow, from data extraction and transformation (ETL) to model deployment and monitoring.\n\nCollaboration with Data Scientists: Collaborate closely with data scientists to understand their needs, develop tools, platforms, and environments that streamline their workflow, and assist in transforming their prototypes into production-ready models.\n\nTroubleshooting and debugging: Provide expert troubleshooting and debugging support, address issues in the infrastructure and workflow, and create robust solutions to prevent future problems.\n\nPreferred Qualifications\n\nBachelor's or Master's degree in Computer Science, Engineering, or a related field.\n\nProficiency in programming languages such as Python, Java, or Scala.\n\nProven experience in ML Ops, DevOps, Data Engineering, or a similar role.\n\nGood understanding of cloud technologies (E.g., OCI, AWS, Google Cloud, Azure) and containerization tools (E.g., Docker).\n\nExcellent problem-solving skills and the ability to troubleshoot complex ML infrastructure issues.\n\nStrong communication skills, with the ability to work collaboratively in a team environment.\n\nNice to Have \n\nStrong experience with ML infrastructure and technologies (E.g., TensorFlow, PyTorch, Keras).\n\nFamiliarity with ML lifecycle management tools (E.g., MLflow, Kubeflow, Kubernetes).\n\nExperience with CI/CD tools (E.g., TeamCity, GitLab CI, CircleCI) and working with data ETL.\n\nQualifications\n\nDisclaimer:\n\nCertain US customer or client-facing roles may be required to comply with applicable requirements, such as immunization and occupational health mandates.\n\nRange and benefit information provided in this posting are specific to the stated locations only\n\nCA: Hiring Range in CAD from: $76,700 - $167,600 per year.\n\nUS: Hiring Range in USD from: $96,800 - $223,400 per year. May be eligible for bonus and equity.\n\nOracle maintains broad salary ranges for its roles in order to account for variations in knowledge, skills, experience, market conditions and locations, as well as reflect Oracle’s differing products, industries and lines of business.\n\nCandidates are typically placed into the range based on the preceding factors as well as internal peer equity.\n\nOracle US offers a comprehensive benefits package which includes the following:\n\n Medical, dental, and vision insurance, including expert medical opinion\n Short term disability and long term disability\n Life insurance and AD&D\n Supplemental life insurance (Employee/Spouse/Child)\n Health care and dependent care Flexible Spending Accounts\n Pre-tax commuter and parking benefits\n 401(k) Savings and Investment Plan with company match\n Paid time off: Flexible Vacation is provided to all eligible employees assigned to a salaried (non-overtime eligible) position. Accrued Vacation is provided to all other employees eligible for vacation benefits. For employees working at least 35 hours per week, the vacation accrual rate is 13 days annually for the first three years of employment and 18 days annually for subsequent years of employment. Vacation accrual is prorated for employees working between 20 and 34 hours per week. Employees working fewer than 20 hours per week are not eligible for vacation.\n 11 paid holidays\n Paid sick leave: 72 hours of paid sick leave upon date of hire. Refreshes each calendar year. Unused balance will carry over each year up to a maximum cap of 112 hours.\n Paid parental leave\n Adoption assistance\n Employee Stock Purchase Plan\n Financial planning and group legal\n Voluntary benefits including auto, homeowner and pet insurance\n\n\nThe role will generally accept applications for at least three calendar days from the posting date or as long as the job remains posted.\n\nCareer Level - IC4\n\nAbout Us\n\nAs a world leader in cloud solutions, Oracle uses tomorrow’s technology to tackle today’s challenges. We’ve partnered with industry-leaders in almost every sector—and continue to thrive after 40+ years of change by operating with integrity.\n\nWe know that true innovation starts when everyone is empowered to contribute. That’s why we’re committed to growing an inclusive workforce that promotes opportunities for all.\n\nOracle careers open the door to global opportunities where work-life balance flourishes. We offer competitive benefits based on parity and consistency and support our people with flexible medical, life insurance, and retirement options. We also encourage employees to give back to their communities through our volunteer programs.\n\nWe’re committed to including people with disabilities at all stages of the employment process. If you require accessibility assistance or accommodation for a disability at any point, let us know by emailing accommodation-request_mb@oracle.com or by calling +1 888 404 2494 in the United States.\n\nOracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans’ status, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.",
    "scraped_at": "2025-06-05T14:49:59.259677"
  },
  "72b1c4b2ae0dc93740ebd71eacae4f1434bfaf5ea92af03da158958cc653a392": {
    "company_name": "BioRender",
    "company_url": "https://www.linkedin.com/company/biorender/life",
    "job_title": "Head of ML",
    "job_url": "https://www.linkedin.com/jobs/view/4210872417/?alternateChannel=search&refId=lHAPlyzs2MZlU1Mf16jUoQ%3D%3D&trackingId=nisZY7APLdmK1WRByiof%2Bw%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nLead ML Innovation at the Frontier of Scientific Communication\n\nAt BioRender, we're not just building tools — we're changing how science is communicated, understood, and accelerated. Every day, scientists use BioRender to tell the story of a new vaccine, cancer therapy, or fundamental biological discovery. Your work will help make those breakthroughs understandable to collaborators, investors, clinicians, students, and even the public — and ultimately get discoveries to market faster.\n\nWe're looking for a visionary Head of ML to help us build something extraordinary: tools that transform how scientific knowledge is created, shared, and understood. This isn't just about making pretty pictures – it's about democratizing scientific knowledge and accelerating discovery on a global scale.\n\nThe Challenge\n\nScientists are struggling to communicate their work in a world drowning in information. The tools they use to visualize and explain their research haven't fundamentally changed in decades. We're changing that.\n\nOur tools are already used by over a million scientists worldwide. With over 24 million scientific figures created, no one else has our depth of experience in scientific communication. Over 3 million researchers at the world’s top universities, pharmaceutical companies, and scientific journals rely on us every day to help them communicate their work.\n\nBut we're just getting started. With ML, we can create tools that fundamentally change how scientific knowledge is created and shared – making it more accessible, understandable, and impactful for everyone.\n\nWhat You’ll Build\n\nAs BioRender’s Head of ML, you’ll lead the transformation of figure creation from a manual, expert-driven process into one that’s intelligent, intuitive, and automated — without compromising scientific accuracy or visual quality. You’ll architect systems that deeply understand biological language, experimental context, and visual storytelling. You will:\n\nInvent and scale ML-powered figure generation that converts natural language descriptions (e.g. “Create a figure of a tissue sample preparation protocol”) into accurate, editable, and publication-ready scientific figures.\nDesign multimodal learning systems that understand the relationships between biological text, icons, diagrams, and templates — and generate figures grounded in scientific semantics, not just visual patterns.\nBuild generative visual models that learn from BioRender’s proprietary dataset: tens of millions of labeled scientific icons, diagrams, templates, and user-generated figures — the world's richest corpus of visual scientific knowledge.\nDevelop user-facing creative ML tools that scientists trust and love — from intelligent figure auto-complete and layout optimization, to context-aware suggestions and scientific diagram summarization.\nShip high-impact ML infrastructure that powers new experiences across BioRender's ecosystem — from slide generation and visual storyboarding to contextual education and scientific communication in new formats.\n\nAll of this will be built within the constraints of scientific accuracy, user editability, and domain trust — a challenge as hard as it is meaningful.\n\nWho You Are\n\nYou're an ML leader with a rare combination of technical depth and user obsession. You’re excited to take on some of the hardest UX and ML challenges in visual creativity — in a domain (biology) where getting it right matters. You might be a strong fit if:\n\nYou’ve built and led frontier ML teams in areas like generative modeling, computer vision, or multimodal learning — and shipped products with millions of users.\nYou deeply understand generative models (transformers, diffusion, image/text embedding models, etc.) and have applied them to real-world creative workflows — especially where visual accuracy and human-in-the-loop tooling matter.\nYou think beyond models. You know success is measured in delight, trust, and adoption by real users. You think holistically about model training, UX scaffolding, latency tradeoffs, prompt design, evaluation frameworks, and safety/guardrails.\nYou’re curious about biology and motivated by the idea of helping scientists share their discoveries faster, clearer, and further. Experience in life sciences is a bonus, but not required.\nYou lead with clarity and ambition. You set technical vision, rally world-class ML talent, and prioritize ruthlessly to drive toward step-change innovation, not incremental improvements.\n\nWhy BioRender?\n\nA data and domain moat you can’t find anywhere else\n\nBioRender is the only company in the world with this kind of data:\n\n30M+ professionally curated scientific icons and components\nTop quartile for profitability and revenue growth, users in 200+ countries\nMillions of annotated user-generated figures and templates, spanning every field of biology\nDeep semantic metadata about biological systems, experimental techniques, and visual storytelling conventions\nA product scientists already love. We’re not starting from zero. BioRender is used by over 1.5 million scientists at 800+ institutions and every top pharma company. NPS scores rival the best creative tools in the world. With the trust and adoption of the scientific community, we’re uniquely positioned to introduce ML into scientific workflows in a way that feels magical — not disruptive.\nWork your way: Remote-first with team members across North America (and a Toronto office if you want it)\n\nWe care about what you can do, not how you learned to do it. If you're excited about using ML to transform scientific communication, we want to talk – regardless of your background or path.\n\nBioRender is an Equal Opportunity Employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.",
    "scraped_at": "2025-06-05T14:50:02.036879"
  },
  "ea66457626454716c645c45404ce130911146c977dd7916831e228274d52d66c": {
    "company_name": "Autodesk",
    "company_url": "https://www.linkedin.com/company/autodesk/life",
    "job_title": "Senior and Principal Software Developer, AI/ML Platform",
    "job_url": "https://www.linkedin.com/jobs/view/4181602591/?alternateChannel=search&refId=lHAPlyzs2MZlU1Mf16jUoQ%3D%3D&trackingId=bRTMR7HOR7FqvuGxaXakdg%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nJob Requisition ID #\n\n25WD84833\n\n25WD84833, Développeur logiciel senior et principal, Plateforme IA/ML\n\nFrench translation will follow!/La traduction en français suivra!\n\nPrésentation du poste\n\nNous recherchons des ingénieurs logiciels seniors et principaux dynamiques et enthousiastes pour développer notre plateforme IA/ML de nouvelle génération utilisée dans le développement de la suite de produits et services d'Autodesk. Rejoignez notre équipe dynamique et en pleine expansion pour contribuer à la création de capacités innovantes permettant un développement plus rapide et plus sûr de l'apprentissage automatique et des solutions d'IA générative, renforçant ainsi l'intelligence des produits et services logiciels d'Autodesk. Vous collaborerez avec la recherche et l'ingénierie de produits de divers domaines, notamment la conception, la construction, la fabrication et les médias et divertissements, afin de fournir la plateforme qui prend en charge le cycle de vie complet du développement de l'IA/ML.\n\nNous recrutons des ingénieurs logiciels de différents niveaux pour la plateforme IA/AA au Canada.\n\nResponsabilités\n\nConception de systèmes innovants: diriger la conception et l'ingénierie de systèmes logiciels pour la plateforme IA/AA, en contribuant au cycle de développement complet de l'AA\nAutomatisation et rationalisation: identifier et mettre en œuvre des opportunités d'automatisation et de rationalisation des processus de développement de l'AA, en favorisant l'efficacité et l'efficience\nAutomatisation des flux de travail: développer des systèmes complets pour automatiser et optimiser les processus laborieux, en les intégrant de manière transparente dans notre plateforme afin de rationaliser les opérations\nDéploiement de solutions de ML: développer des outils pour créer et déployer des artefacts de ML dans des environnements de production, facilitant une transition en douceur du développement au déploiement\nGestion des Big Data: automatiser et orchestrer les tâches liées à la gestion de la transformation et du traitement des Big Data, en créant des magasins de données à grande échelle pour les artefacts de ML\nServices évolutifs: Concevoir et mettre en œuvre des services de prédiction et d'inférence évolutifs à faible latence pour répondre aux divers besoins de nos utilisateurs\nCollaboration interfonctionnelle: Collaborer avec diverses équipes, notamment des chercheurs en apprentissage automatique, des développeurs, des chefs de produit, des architectes logiciels et des opérations, en favorisant un environnement de travail collaboratif et cohésif\nLeadership architectural: Prendre en charge les composants critiques de la plateforme, fournir des orientations architecturales et contribuer au succès global de la plateforme IA/ML\n\nQualifications Minimales\n\nLicence en informatique ou expérience pratique équivalente\n3 à 8 ans d'expérience en développement et ingénierie de logiciels, avec une solide expérience dans la fourniture de systèmes et de services de production\nExpertise dans les langages de programmation tels que Python, Java, Go, les langages de script et SQL\nCompétences avérées en matière de résolution de problèmes, avec la capacité de décomposer les problèmes en éléments gérables\nExpérience approfondie des technologies cloud Amazon AWS (Amazon Web Services) ou Azure\nExcellente expérience en matière de conception de systèmes évolutifs et d'architecture logicielle distribuée\nExpérience approfondie des technologies de big data, notamment NoSQL, Hadoop, Spark, Hive et les pipelines de données\nSolide expertise des plateformes de données, englobant la conception et la mise en œuvre de systèmes évolutifs et efficaces de stockage, de récupération et de traitement des données\nExcellentes compétences en communication et en collaboration, favorisant le travail d'équipe et l'échange efficace d'informations\nConnaissance des méthodologies de développement agiles, notamment le CI/CD et le développement piloté par les tests\nConnaissance pratique du traitement, de la formation, du déploiement ou des opérations de données cloud, telles que Snowflake ou Databricks\nConnaissance pratique des principes de mise en réseau cloud et de leurs implications en matière de sécurité pour les organisations détenant des données sensibles\n\nQualifications Préférées\n\nExpérience du déploiement de projets et de solutions basés sur l'apprentissage automatique dans des environnements de production\nConnaissance des pratiques d'opérations d'apprentissage automatique\nExpérience des grands modèles de langage open source sur Hugging Face, tels que Llama et Mixtral\nExpérience des bibliothèques ML telles que PyTorch, TensorFlow, XGBoost, Pandas et ScikitLearn\nExpérience de l'analyse statistique\nCollaboration antérieure avec des scientifiques des données et des chercheurs\nExpérience pratique de la construction d'une infrastructure centrée sur Kubernetes et des processus CI/CD\nExpérience pratique de l'automatisation des corrections de vulnérabilités et du travail avec les équipes de sécurité des grandes entreprises\n\n_____________________________________________________________________________\n\n25WD84833, Senior and Principal Software Developer, AI/ML Platform\n\nPosition Overview\n\nWe are seeking a dynamic and enthusiastic senior software and principal software engineers to develop our next-generation AI/ML platform used in the development of Autodesk’s suite of products and services. Join our dynamic and rapidly expanding team to help build innovative capabilities that enable faster and more secure development of machine learning and generative AI solutions, bolstering the intelligence of Autodesk software products and services. You will collaborate with research and product engineering from various domains including design, construction, manufacturing, and media & entertainment to deliver the platform that supports full AI/ML development lifecycle.\n\nWe are hiring for multiple levels of Software Engineers, AI/ML Platform in Canada\n\nResponsibilities\n\nInnovative System Design: Lead the design and engineering of software systems for the AI/ML Platform, contributing to the full ML development lifecycle\nAutomation and Streamlining: Identify and implement opportunities to automate and streamline ML development processes, fostering efficiency and effectiveness\nWorkflow Automation: Develop comprehensive systems to automate and optimize laborious processes, integrating them seamlessly into our platform to streamline operations\nML Solution Deployment: Develop tools for building and deploying ML artifacts in production environments, facilitating a smooth transition from development to deployment\nBig Data Management: Automate and orchestrate tasks related to managing big data transformation and processing, building large-scale data stores for ML artifacts\nScalable Services: Design and implement low-latency, scalable prediction, and inference services to support the diverse needs of our users\nCross-Functional Collaboration: Collaborate across diverse teams, including machine learning researchers, developers, product managers, software architects, and operations, fostering a collaborative and cohesive work environment\nArchitectural Leadership: Take ownership of critical components of the platform, providing architectural direction, and contributing to the overall success of the AI/ML Platform\n\nMinimum Qualifications\n\nBS in Computer Science, or equivalent practical experience\n3-8 years of experience in software development and engineering, with a solid record of delivering production systems and services\nExpertise in programming languages such as Python, Java, Go, scripting languages and SQL\nDemonstrated created problem-solving skills with the ability to break down problems into manageable components\nIn-depth experience with Amazon AWS (Amazon Web Services) or Azure cloud technologies\nExcellent track record in scalable system design and distributed software architecture\nIn-depth experience working with big data technologies, including NoSQL, Hadoop, Spark, Hive, and data pipelines\nStrong expertise in data platforms, encompassing the design and implementation of scalable and efficient data storage, retrieval, and processing systems\nExcellent communication and collaboration skills, fostering teamwork and effective information exchange\nFamiliarity with agile development methodologies, including CI/CD & test-driven development\nWorking knowledge with cloud data processing, training, deployment, or operations, such as Snowflake or Databricks\nWorking knowledge of cloud networking principles and their security implications for organizations holding sensitive data\n\nPreferred Qualifications\n\nExposure to deploying ML-enabled projects and solutions to production environments\nFamiliarity with Machine Learning Operations practices\nExposure to open-source Large Language Models on Hugging Face like Llama & Mixtral\nExposure to ML libraries such as PyTorch, TensorFlow, XGBoost, Pandas, and ScikitLearn\nExposure to statistical analysis\nPast collaboration with data scientists and researchers\nHands-on experience building on Kubernetes centric infrastructure and CI/CD processes\nHands-on experience automating vulnerability fixes and working with security teams at large enterprise companies\n\nLearn More / Plus d'information\n\nAbout Autodesk / À Propos D’Autodesk\n\nWelcome to Autodesk! Amazing things are created every day with our software – from the greenest buildings and cleanest cars to the smartest factories and biggest hit movies. We help innovators turn their ideas into reality, transforming not only how things are made, but what can be made.\n\nWe take great pride in our culture here at Autodesk – our Culture Code is at the core of everything we do. Our values and ways of working help our people thrive and realize their potential, which leads to even better outcomes for our customers.\n\nWhen you’re an Autodesker, you can be your whole, authentic self and do meaningful work that helps build a better future for all. Ready to shape the world and your future? Join us!\n\nBienvenue à Autodesk ! Des choses incroyables sont créées chaque jour avec nos logiciels - des bâtiments les plus écologiques et des voitures les plus propres aux usines les plus intelligentes et aux plus grands films à succès. Nous aidons les innovateurs à transformer leurs idées en réalité, transformant non seulement la façon dont les choses sont faites, mais ce qui peut être fait.\n\nNous sommes très fiers de notre culture ici chez Autodesk - notre code en matière de culture est au cœur de tout ce que nous faisons. Nos valeurs et nos méthodes de travail aident nos employés à prospérer et à réaliser leur potentiel, ce qui conduit à des résultats encore meilleurs pour nos clients.\n\nLorsque vous êtes un employé Autodesk, vous pouvez être entier et authentique et effectuer un travail significatif qui aide à construire un avenir meilleur pour tous. Prêt à façonner le monde et votre avenir? Joignez-vous à nous !\n\nSalary transparency / Transparence salariale\n\nSalary is one part of Autodesk’s competitive compensation package. Offers are based on the candidate’s experience and geographic location. In addition to base salaries, we also have a significant emphasis on discretionary annual cash bonuses, commissions for sales roles, stock or long-term incentive cash grants, and a comprehensive benefits package.\n\nLe salaire est l'un des éléments de l'offre compétitive d'Autodesk. Les offres sont basées sur l'expérience et la situation géographique du candidat. Outre les salaires de base, nous accordons également une grande importance aux primes annuelles discrétionnaires en espèces, aux commissions pour les fonctions de vente, aux actions ou aux primes d'encouragement à long terme en espèces, ainsi qu'à un ensemble complet d'avantages sociaux.\n\nDiversity & Belonging / Diversité et appurtenance\n\nWe take pride in cultivating a culture of belonging and an equitable workplace where everyone can thrive. Learn more here: https://www.autodesk.com/company/diversity-and-belonging\n\nNous sommes fiers de cultiver une culture d’appartenance et un milieu de travail équitable où tout le monde peut s’épanouir. Pour en savoir plus, cliquez ici : https://www.autodesk.com/company/diversity-and-belonging\n\nAre you an existing contractor or consultant with Autodesk? \n\nÊtes-vous un sous-traitant ou un consultant existant d’Autodesk ?\n\nPlease search for open jobs and apply internally (not on this external site).\n\nVeuillez rechercher des emplois vacants et postuler à l’interne (pas sur ce site externe).",
    "scraped_at": "2025-06-05T14:50:04.880809"
  },
  "2f496b11b1be54caca2c0dd87cc9b7f305e85e23afb0a42a1381c0eaa87d5921": {
    "company_name": "Ubisoft Montréal",
    "company_url": "https://www.linkedin.com/company/ubisoft-montreal/life",
    "job_title": "ML OPS Senior _ Groupe Technologique Création de contenu",
    "job_url": "https://www.linkedin.com/jobs/view/4127672592/?alternateChannel=search&refId=lHAPlyzs2MZlU1Mf16jUoQ%3D%3D&trackingId=dOyKbEzy2OOoBHcJhjcLaw%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nDescription Du Poste\n\nLe Content Creation Technology Group (CCTG) est à la recherche d'un ML Ops senior qui travaillera au sein d'une équipe qui développe des solutions d’apprentissage automatique pour améliorer l'expérience joueur, entre autres avec un projet sur des robots visant à simuler de vrais joueurs concurrents. Le rôle du ML Ops senior sera de définir les meilleures pratiques et les principes de conception pour aider l'équipe à livrer notre ambitieuse feuille de route de fonctionnalités.\n\nPrincipales responsabilités: \n\n\nConcevoir et développer des systèmes d'apprentissage automatique et des schémas basés sur les requis et les objectifs de l'entreprise. \nOptimiser les solutions existantes pour améliorer les performances, l'évolutivité et l'efficacité. \nContribuer à l’industrialisation des projets d’apprentissage automatique, en se concentrant sur la création de pipelines et du déroulement des opérations de travail. \nAdapter et améliorer l'utilisation des modèles, faciliter l'utilisation des outils et les adapter aux besoins des utilisateurs. \nCréer des outils pour soutenir et intégrer les modèles d'apprentissage automatique dans un pipeline multi-processus. \nAméliorer les librairies et frameworks d'apprentissage automatique existants. \nCollaborer avec les équipes de production du jeu, l'équipe de science des données, l'équipe de recherche et d'autres parties prenantes. \n\n\nAutres responsabilités: \n\n\nMener des recherches pour rester au courant des dernières avancées technologiques. \nDocumentation, présentations et partage des connaissances pour communiquer des concepts d'IA complexes aux collaborateurs techniques et non techniques. \nCréation de preuves de concepts pour satisfaire les exigences sur les orientations du produit. \n\n\nQualifications\n\nFormation: \n\n\nBaccalauréat en informatique ou en génie informatique ou équivalent. Une spécialisation en apprentissage automatique est un atout. \n\n\nExpérience pertinente: \n\n\nUn minimum de 5 ans d'expérience en génie logiciel. \nUn minimum de 2 ans d'expérience en apprentissage automatique. \n\n\nCompétences: \n\n\nUne bonne connaissance d'un pipeline d'apprentissage automatique de production ; de la formation et du déploiement de l’apprentissage automatique au suivi de la performance des modèles/behavioral-drift. \nMaîtrise de Python et expérience des librairies et frameworks tels que PyTorch et/ou TensorFlow. \nUne bonne connaissance des plateformes MLOps telles que Databricks et/ou ClearML. \nUne bonne connaissance de la technologie des conteneurs tels que Docker et/ou Kubernetes. \nUne bonne connaissance des notions de base de l'apprentissage automatique et de l'apprentissage profond. \nUne bonne connaissance des plateformes infonuagiques est un atout. \nUne bonne connaissance des produits de base de données est un atout.\n\n\nInformations complémentaires\n\nQuoi nous envoyer\n\n\nVotre CV mettant en valeur votre formation, votre expérience, vos compétences et les jeux livrés",
    "scraped_at": "2025-06-05T14:50:09.051256"
  },
  "96ca1c3d5467afe3ee314a90b7f590eed1020786d749b164d6969c41871b1ddc": {
    "company_name": "Oracle",
    "company_url": "https://www.linkedin.com/company/oracle/life",
    "job_title": "Software Developer 4 - NetSuite AI/ML",
    "job_url": "https://www.linkedin.com/jobs/view/4237808019/?alternateChannel=search&refId=lHAPlyzs2MZlU1Mf16jUoQ%3D%3D&trackingId=inO9UikDw7mOdcjxM8ilzg%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nJob Description\n\nAbout Oracle NetSuite \n\nOur goal is to transform how businesses operate. We help businesses achieve their vision, no matter the size or industry. We’re the #1 cloud business software, supporting more than 40,000 organizations, in more than 100 countries. Find out more about Oracle NetSuite at www.netsuite.com .\n\nOverview\n\nThe ML Operations team at Oracle-NetSuite is growing and we are looking for a strong, agile ML Ops Developer to help us invent the future. This team fills the role of a Data Engineering team but aims to provide ML tools as a service to downstream consumers. As part of our team, you will help design and develop infrastructure services to assist internal customers with their machine learning initiatives. Participating in design discussions with the team and contributing your ideas will give you a chance to help shape the future of our platform, while also ensuring end-to-end security and compliance concerns are met. You'll also be expected to help maintain and improve code quality by providing meaningful contributions to code reviews. If you are passionate about data, automation, and complex problem-solving, then we want to hear from you.\n\nCareer Level - IC4\n\nResponsibilities\n\n RESPONSIBILITIES \n\nAs an ML Ops Developer, you will play a pivotal role in building the foundation for Machine Learning at Oracle NetSuite. Key responsibilities include:\n\nDeveloping and maintaining tools and APIs that help orchestrate our Machine Learning Pipelines and infrastructure: Create, scale, and optimize our ML infrastructure to enable the seamless deployment and scalability of our AI models.\n\nAutomating Machine Learning workflows, data ETL, model deployments, and monitoring: Implement robust automation solutions for the ML workflow, from data extraction and transformation (ETL) to model deployment and monitoring.\n\nCollaboration with Data Scientists: Collaborate closely with data scientists to understand their needs, develop tools, platforms, and environments that streamline their workflow, and assist in transforming their prototypes into production-ready models.\n\nTroubleshooting and debugging: Provide expert troubleshooting and debugging support, address issues in the infrastructure and workflow, and create robust solutions to prevent future problems.\n\nPreferred Qualifications\n\nBachelor's or Master's degree in Computer Science, Engineering, or a related field.\n\nProficiency in programming languages such as Python, Java, or Scala.\n\nProven experience in ML Ops, DevOps, Data Engineering, or a similar role.\n\nGood understanding of cloud technologies (E.g., OCI, AWS, Google Cloud, Azure) and containerization tools (E.g., Docker).\n\nExcellent problem-solving skills and the ability to troubleshoot complex ML infrastructure issues.\n\nStrong communication skills, with the ability to work collaboratively in a team environment.\n\nNice to Have \n\nStrong experience with ML infrastructure and technologies (E.g., TensorFlow, PyTorch, Keras).\n\nFamiliarity with ML lifecycle management tools (E.g., MLflow, Kubeflow, Kubernetes).\n\nExperience with CI/CD tools (E.g., TeamCity, GitLab CI, CircleCI) and working with data ETL.\n\nQualifications\n\nDisclaimer:\n\nCertain US customer or client-facing roles may be required to comply with applicable requirements, such as immunization and occupational health mandates.\n\nRange and benefit information provided in this posting are specific to the stated locations only\n\nCA: Hiring Range in CAD from: $76,700 - $167,600 per year.\n\nUS: Hiring Range in USD from: $96,800 - $223,400 per year. May be eligible for bonus and equity.\n\nOracle maintains broad salary ranges for its roles in order to account for variations in knowledge, skills, experience, market conditions and locations, as well as reflect Oracle’s differing products, industries and lines of business.\n\nCandidates are typically placed into the range based on the preceding factors as well as internal peer equity.\n\nOracle US offers a comprehensive benefits package which includes the following:\n\n Medical, dental, and vision insurance, including expert medical opinion\n Short term disability and long term disability\n Life insurance and AD&D\n Supplemental life insurance (Employee/Spouse/Child)\n Health care and dependent care Flexible Spending Accounts\n Pre-tax commuter and parking benefits\n 401(k) Savings and Investment Plan with company match\n Paid time off: Flexible Vacation is provided to all eligible employees assigned to a salaried (non-overtime eligible) position. Accrued Vacation is provided to all other employees eligible for vacation benefits. For employees working at least 35 hours per week, the vacation accrual rate is 13 days annually for the first three years of employment and 18 days annually for subsequent years of employment. Vacation accrual is prorated for employees working between 20 and 34 hours per week. Employees working fewer than 20 hours per week are not eligible for vacation.\n 11 paid holidays\n Paid sick leave: 72 hours of paid sick leave upon date of hire. Refreshes each calendar year. Unused balance will carry over each year up to a maximum cap of 112 hours.\n Paid parental leave\n Adoption assistance\n Employee Stock Purchase Plan\n Financial planning and group legal\n Voluntary benefits including auto, homeowner and pet insurance\n\n\nThe role will generally accept applications for at least three calendar days from the posting date or as long as the job remains posted.\n\nCareer Level - IC4\n\nAbout Us\n\nAs a world leader in cloud solutions, Oracle uses tomorrow’s technology to tackle today’s challenges. We’ve partnered with industry-leaders in almost every sector—and continue to thrive after 40+ years of change by operating with integrity.\n\nWe know that true innovation starts when everyone is empowered to contribute. That’s why we’re committed to growing an inclusive workforce that promotes opportunities for all.\n\nOracle careers open the door to global opportunities where work-life balance flourishes. We offer competitive benefits based on parity and consistency and support our people with flexible medical, life insurance, and retirement options. We also encourage employees to give back to their communities through our volunteer programs.\n\nWe’re committed to including people with disabilities at all stages of the employment process. If you require accessibility assistance or accommodation for a disability at any point, let us know by emailing accommodation-request_mb@oracle.com or by calling +1 888 404 2494 in the United States.\n\nOracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans’ status, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.",
    "scraped_at": "2025-06-05T14:50:11.683303"
  },
  "af5b1f1ade3d936afa922093693da9599239a6e7ab326c21926f04497d857782": {
    "company_name": "Rumble",
    "company_url": "https://www.linkedin.com/company/rumble-com/life",
    "job_title": "Principal ML Data Engineer",
    "job_url": "https://www.linkedin.com/jobs/view/4240234917/?alternateChannel=search&refId=tCzXz6JSJnALkq9IF%2FtJqw%3D%3D&trackingId=WyFZaCtwoOuA8%2Fql1w3mrA%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nRumble is a high-growth neutral video platform that is creating the rails and independent infrastructure designed to be immune to cancel culture. Rumble’s mission is to restore the Internet to its roots by making it free and open once again.\n\nWhat you will do: \n\nRumble is seeking an experienced Principal ML Data Engineer who will be responsible for setting requirements for data collection, preprocessing, analyzing large amounts of data, building / deploying models and algorithms capable of learning and predicting future data points.\n\nIn this key role you will be responsible for:\n\nAnalyze large amounts of data to discover trends and patterns to develop a KPI driven solution.\nIdentify valuable data sources and set requirements, and assist in the implementation.\nUndertake and execute preprocessing of structured and unstructured data.\nBuild / deploy predictive models and machine-learning algorithms from the ground up.\nPropose solutions and strategies to business challenges and KPIs.\nCollaborate with engineering and product development teams.\nTraining and retraining ML systems and models as needed.\nAssist in the management and running of ML specific servers / infrastructure / VMs.\nOther duties, as assigned.\n\n\nRequired Qualifications:\n\n5+ years of combined expert level experience using one or more of the following languages Python, Java, or C++\n3+ years working with, running and performing administrative tasks on linux based operating systems\n2+ years of experience of building machine learning models for business application and KPIs\nAlgorithm and model development and execution experience for large-scale applications\nExtensive knowledge and practical experience in deep neural networks and other recommendation systems, including convolutional neural networks (CNNs), recurrent neural networks (RNNs), residual neural networks and collaborative filtering techniques.\nExperienced in MLOps to design, implement, and manage scalable pipelines for model deployment, monitoring, and continuous improvement in production environments.\nStrong fundamentals in problem solving, algorithm design and complexity analysis.\nSuperior verbal and written communication and presentation skills, ability to convey rigorous mathematical concepts and considerations to non-experts.\n\n\nPreferred Qualification:\n\nExperience contributing, working with, or maintaining open-source projects.\nExperience working with any or all of the following: SQL, ClickHouse, Kafka and Redis\n\n\nDesired Qualification:\n\nSignificant peer reviewed scientific contributions in premier journals and conferences are a plus.\nUnderstanding of network concepts\nWorking experience with online video, and ad technologies\n\n\nWhy Our Team Loves Working Here:\n\nWe are making a significant financial impact for our video creator community; we’re proud of their success stories\nWe enjoy challenging the status quo and going head-to-head against Big Tech\nWe aren’t afraid to try new things; we act fast and want to win \nWe pay competitive salaries and provide great benefits\n\n\nEEO Statement: \n\nRumble is an equal opportunity employer.  We promote an equal playing field where everyone has the same opportunities regardless of race, religion, color, national origin, sex, sexual orientation, age, veteran status, disability status, or any other applicable characteristics protected by law. Rumble is an active participant in the e-verify program.\n\nPhysical demands of the position:\n\nWhile performing the duties of this job, the employee is regularly required to sit for prolonged periods of time while using a computer and/or keyboard. The employee is required to communicate verbally and hear. The employee may be required to walk, reach with hands and arms, balance, and stoop or kneel. The employee may occasionally be required to lift and/or move up to 15 pounds. Specific vision abilities required by this job include clarity of vision at approximately 20 inches or less (i.e., working with small objects or reading small print), including the use of computers.",
    "scraped_at": "2025-06-05T14:50:45.934668"
  },
  "031db578b3b107f63128cf6ba73786ad0109038e873ef1724766eab655cf23e7": {
    "company_name": "Xero",
    "company_url": "https://www.linkedin.com/company/xero/life",
    "job_title": "Senior ML Engineer",
    "job_url": "https://www.linkedin.com/jobs/view/4161880587/?alternateChannel=search&refId=tCzXz6JSJnALkq9IF%2FtJqw%3D%3D&trackingId=x40rHOvla4At6aizyH0cZQ%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\n\n\n\nOur Purpose \n At Xero, we’re here to help you supercharge your business. We do this by automating routine tasks, surfacing actionable insights and connecting businesses with the right data, advisors and apps. When that happens, we’re not only making life better for small business, we’ll be building a stronger economy that can change the world. \n\n\n The AI team at Xero brings together ML Engineers and Applied Scientists to build systems that power Xero's next generation of beautiful, insightful products. \n\n\nAbout The Team\n\n\n The AI Products group exists to collaboratively build products that use AI and ML to reduce toil and deliver the right insight at the right time. Working within the Data & Science team, you will join a diverse, globally distributed team of scientists, engineers, product managers, and analysts who help Xero turn data into beautiful, insightful products. \n\n\n ML engineers design and build the infrastructure and services that power AI products that serve millions of customers every day. They also work closely with Applied Scientists through the research and development process to create harnesses and interfaces to safely take models from research to production environments. As a Sr.ML Engineer, you will lead delivery programs and co-lead research programs that push the boundaries of what's possible with today's technology. \n \n\nAbout The Role\nLeading the design of our AI research and production infrastructure and services, ensuring that our services scale while preserving flexibility for research teams\nOwning our strategy for managing the growth rate of technical debt and costs across our stack\nMaking sure we're solving the right problems with the right methods\nSharing knowledge with colleagues and lifting the bar for the AI Products team\nWorking with teams across Xero to improve the quality and usability of data \nBuilding Xero's profile in market through public facing content and events\n \n\nAbout You\nYou have 6+ years of experience delivering ML and AI products at scale\nYou are drawn to solving hard problems and understanding how things work\nYou are comfortable learning new frameworks (distributed processing, ML, etc) and applying them to real problems\nYou are willing to dive into the unknown, and allow new information to change your decisions\nConstant learning and growth are an important part of who you are\nYou are always willing to learn from others and ask for help\n \n\nWhat you’ll Bring With You\nStrong coding and system design skills in Python or another language used in web scale data and AI applications\nStrong SQL skills and understanding of distributed processing (data, ML, etc)\nExcellent written and verbal communication skills for communicating technical concepts to technical and business stakeholders\nExperience developing sensible standards and mentoring early career ML engineers\nFamiliarity with AI frameworks (PyTorch or Tensor-flow) is a nice to have. \nFamiliarity with MLFlow Tools a big plus\n \n\nWhy Xero?\nDiversity of people brings diversity of thought, and we like that. Our human-first culture of respect, fairness, and inclusion is what helps Xeros thrive and work and beyond, and that includes our candidates. Research has shown that women and underrepresented groups are less likely to apply to jobs unless they meet every single competency or experience, but you could be just the right person for this role. If you are excited about working at Xero, but your past experience doesn't align perfectly, we encourage you to apply anyway.\n\n\nOffering very generous paid leave to use however you’d like (plus statutory holidays!), dedicated paid leave to care for your physical and mental wellbeing as well as an Employee Assistance Program to access mental health care for you and your family, health insurance and dental reimbursement with vision allowances, a healthcare spending account, fertility and family forming financial support, wellbeing and sports programmes, employee resource groups, 26 weeks of parental leave for primary caregivers, an Employee Share Plan, beautiful offices with shared meals, flexible working, career development, and many other benefits that reflect our human value, you’ll do the best work of your life at Xero.",
    "scraped_at": "2025-06-05T14:50:48.702757"
  },
  "c1b343dc479bf593fdc07e30011835d3606097702819d1867a7f7dd31d048fc6": {
    "company_name": "Google",
    "company_url": "https://www.linkedin.com/company/google/life",
    "job_title": "Cloud Developer II, AI/ML, Professional Services",
    "job_url": "https://www.linkedin.com/jobs/view/4224660454/?alternateChannel=search&refId=tCzXz6JSJnALkq9IF%2FtJqw%3D%3D&trackingId=JNz2BsQmKPs4bP2OUt128A%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nFor United States applicants:\n\nThe application window will be open until at least 05/09/2025. This opportunity will remain online based on business needs which may be before or after the specified date.\n\nNote: By applying to this position you will have an opportunity to share your preferred working location from the following: Atlanta, GA, USA; Chicago, IL, USA; Austin, TX, USA; Boulder, CO, USA; Toronto, ON, Canada.Minimum qualifications:\n\nBachelor's degree in Computer Science or equivalent practical experience.\n6 years of experience building machine learning solutions and working with technical customers.\nExperience designing cloud enterprise solutions and supporting customer projects to completion.\nExperience coding in one or more general purpose languages (e.g., Python, Java, Go, C or C++) including data structures, algorithms, and software design.\n\nPreferred qualifications:\n\nExperience with deep learning frameworks (e.g., Tensorflow, pyTorch, XGBoost).\nExperience working with recommendation engines, data pipelines, or distributed machine learning.\nKnowledge of data warehousing concepts, including data warehouse technical architectures, infrastructure components, ETL/ ELT and reporting/analytic tools and environments (e.g., Apache Beam, Hadoop, Spark, Pig, Hive, MapReduce, Flume).\nUnderstanding of the auxiliary practical concerns in production machine learning systems.\n\nAbout The Job\n\nThe Google Cloud Consulting Professional Services team guides customers through the moments that matter most in their cloud journey to help businesses thrive. We help customers transform and evolve their business through the use of Google’s global network, web-scale data centers, and software infrastructure. As part of an innovative team in this rapidly growing business, you will help shape the future of businesses of all sizes and use technology to connect with customers, employees, and partners.\n\nIn this role, you will design and implement machine learning solutions for customer use cases, leveraging core Google products including TensorFlow, DataFlow, and Vertex AI. You will work with customers to identify opportunities to apply machine learning in their business, and travel to customer sites to deploy solutions and deliver workshops to educate and empower customers. Additionally, you will work closely with Product Management and Product Engineering to build and constantly drive excellence in our products.\n\nYou will be working with Google's largest and most ambitious Cloud customers. Together with the team you will support customer implementation of Google Cloud products through architecture guidance, best practices, data migration, capacity planning, implementation, troubleshooting, monitoring, etc.\n\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.\n\nFor United States only:\n\nThe US base salary range for this full-time position is $147,000-$216,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.\n\nPlease note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google .\n\nResponsibilities\n\n Be a trusted technical advisor to customers and solve complex machine learning tests. \nCoach customers on the practical tests in machine learning systems feature extraction and feature definition, data validation, monitoring, and management of features and models.\nWork with Customers, Partners, and Google Product teams to deliver tailored solutions into production.\n Create and deliver best practice recommendations, tutorials, blog articles, and sample code. \nTravel up to 30% for in-region for meetings, technical reviews, and onsite delivery activities.\n\n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
    "scraped_at": "2025-06-05T14:50:51.351987"
  },
  "c54df7cdcc1ab4021726c04123d6043b6f128176fa9ad5dbd3b3cd4c8d5b5345": {
    "company_name": "Aurora Solar",
    "company_url": "https://www.linkedin.com/company/aurora-solar/life",
    "job_title": "Senior Software Engineer, Full-stack ML & Geo Data",
    "job_url": "https://www.linkedin.com/jobs/view/4212207559/?alternateChannel=search&refId=tCzXz6JSJnALkq9IF%2FtJqw%3D%3D&trackingId=ghFZl23ZChe4AO8tqRum1g%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nAbout Aurora Solar\n\nAurora is on a mission to create a future of solar for all. Our award-winning software puts the power of data and technology into the hands of every solar professional to make solar adoption simple and predictable. Our software has designed millions of solar projects so far, empowering solar companies to sell, design, and install residential and commercial solar arrays accurately, seamlessly, and at scale.\n\nWe are a remote-first collaborative team of sustainable energy enthusiasts who love what we do. We’ve been named one of \"The Best Remote Companies To Work for in 2025\" by BuiltIn.com and have been recognized for the second time as a Certified Green Business (CGB) with the city of San Francisco. We’re in this together to support the world’s transition to solar.\n\nAbout The Team\n\nThe AI & Data team builds and maintains computer-vision & machine-learning pipelines to automate the design of residential solar systems. We also manage the satellite imagery and lidar data sources that feed into these pipelines and other areas of the Aurora application. Ultimately, our work empowers customers to build more solar faster. We are a tight-knit group that prioritizes mutual respect and shared learning opportunities.\n\nAbout The Role\n\nIn this role, you’ll provide full-stack development support, focusing on maintaining and improving our machine-learning infrastructure and geographic (“geo”) data services for fast and accurate solar designs. You’ll collaborate with machine-learning and geo experts, with opportunities to learn and contribute to our computer-vision pipelines.\n\nYour Impact \n\nMaintain and improve backend infrastructure for ML and Geo systems, including evaluation, regression, test coverage, dataset storage & organization, model training & serving, and imagery & 3D data processing\nDevelop and deploy intuitive frontend features, and share your expertise by providing guidance on teammates' projects\nTake ownership of team services, including participating in our on-call rotation to ensure our systems are always running smoothly\nContribute your talents to the development of our cutting-edge machine-learning pipeline, actively participating in code reviews and process improvements that keep us at the forefront of innovation\nGuarantee the reliability of our application through automated tests and debugging\nPower our sustainable energy culture by building tools that make solar design more accurate and accessible, directly contributing to Aurora's mission of a solar-powered future\n\nWhat You Bring\n\nAcademic background or equivalent skills in computer science or a related field, providing a solid foundation for your contributions. \n3+ years of hands-on experience with Python and backend web development (such as Ruby on Rails), showcasing your ability to build robust and scalable systems\n1+ years of experience crafting engaging user interfaces with JavaScript, TypeScript, and React, demonstrating your full-stack capabilities\n1+ years of experience with GraphQL\nFamiliarity with computer vision & machine learning concepts\nDemonstrated skills in design, development, technical documentation, architecture, build systems, code refactoring, and testing, showcasing your commitment to writing clean, efficient, and well-tested code\nEffective communication skills, including: describing complex concepts in a clear manner, providing concise project updates to the team, providing actionable comments in code reviews\nEffective collaboration skills in pairing with other developers, jointly developing a project proposal, and code reviews\nStrong alignment with Aurora's values and a passion for being a part of the renewable energy revolution\n\nNice to Haves\n\nExperience with AWS, Kubernetes, Git, PostgreSQL, or Docker\nExperience deploying and maintaining ML infrastructure in production\nExperience working with geospatial data pipelines (e.g. imagery and lidar) \n\nWhat We Offer\n\n🏖️Flexible PTO - Take the time when you need it\n🍼Parental Leave - 16 weeks with 100% base salary + gradual return to work\n💰WFH Stipend - An initial $675 CAD(Non-engineers) or $1000 CAD (Engineering roles) \n🏢 Coworking Stipend - $400 CAD / month if you prefer to be at a coworking facility near you \n☀️Energize Fridays - Company-wide days to log off and recharge\n📶Connectivity Stipend - Up to $125 CAD / month towards internet or phone\nLearning & Development - $970/annually to use towards professional development (You have to complete 90 days of employment to receive this stipend)\n🩺Medical, Dental, and Vision - Aurora will cover 100% of premiums for employee-only and dependent coverage of our supplemental medical, dental, and vision plans\n\nPlease take a look at our 2025 Canadian Benefits Booklet for a deeper dive into our offerings\n\nPlease note that stipend amounts are based on USD; local currency amounts may vary with FX rate fluctuations\n\nWhere Aurorans are: Aurora currently has teams within the US, Canada, Mexico, and Germany with additional locations on the horizon. We’re united in our work to support the world’s transition to solar!\n\nAurora is dedicated to building a diverse and inclusive workforce of people who believe in and are passionate about creating a future of solar energy for all. We are an equal opportunity employer, we welcome and consider qualified applicants regardless of gender identity, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences. We encourage you to apply even if you believe that you do not meet all of the above criteria!\n\nAurora is committed to creating an inclusive and accessible experience for all candidates. If you require a reasonable accommodation that would better enable your success during the application or interview process, please complete this form.\n\nFor San Francisco applicants: Pursuant to the San Francisco Fair Chance Ordinance, we will consider qualified applicants with arrest and conviction records for employment.",
    "scraped_at": "2025-06-05T14:50:54.414598"
  },
  "3fcca9606019b69a8f15461ee7bc1fbb4fc83ea7a469279c89bd151145902083": {
    "company_name": "RBC",
    "company_url": "https://www.linkedin.com/company/rbc/life",
    "job_title": "Senior ML Researcher Lead",
    "job_url": "https://www.linkedin.com/jobs/view/4241086370/?alternateChannel=search&refId=tCzXz6JSJnALkq9IF%2FtJqw%3D%3D&trackingId=jtA69jcVzsgT3PwNPk5pTA%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nJob Summary\n\nJob Description\n\nWhat’s the opportunity?\n\nRBC Borealis is at the forefront of artificial intelligence research and development, driving the innovative edge for the Royal Bank of Canada (RBC). Our team is dedicated to advancing the science of AI, delivering cutting-edge solutions that create substantial value for RBC and its customers. As part of RBC, you will have the opportunity to contribute to impactful projects within a leading financial institution, harnessing the power of AI to revolutionize the financial services industry.\n\nWe are looking for a Senior Researcher for AI Solutions. The role focuses on technical leadership with the goal of delivering products for the financial services industry. The candidate will play a critical role in shaping and leading our product, technical solution, reputation, and practice. The role includes engagement with technical and business stakeholders to shape and deliver on project roadmaps. Mentorship and contributions to talent development is also a core component of the role.\n\nYour responsibilities include:\n\nTechnical Leadership. Provide technical leadership and scientific guidance to AI projects, working within and across teams;\nResearch Innovation. Develop innovative machine learning approaches and novel intellectual property;\nProduct Delivery. Iteratively refine and deliver machine learning concepts from proof of concept through to product delivery;\nResearch Leadership. Contribute to defining our research vision, publish papers, and communicate internally and externally around machine learning research;\nMentorship. Collaborate with team members including other researchers, engineers, and interns to grow and develop their skills in AI research and solutioning. \n\nYou’re our ideal candidate if you have:\n\nA Ph.D. degree in Computer Science or a related technical field;\nAt least 2 years of experience as a machine learning researcher or engineer in a product-centric environment or equivalent experience;\nExpertise in machine learning, with experience in recommender systems, experimental design, or reinforcement learning being a plus;\nExperience delivering high-impact machine learning products;\nExperience of mentorship including junior researchers and engineers and experienced high-performance researchers;\nInvolvement across the research and development lifecycle, from prototyping to production, engaging with stakeholders to develop solutions that meet business needs;\nThe ability to formulate and drive a research project independently;\nExceptional communication skills;\nA history of high quality academic publications (e.g., NeurIPS, ACL, EMNLP, CVPR, ICLR, ICML etc.). \n\nWhat’s in it for you?\n\nLead a team that thinks progressively and works collaboratively. We care about seeing each other reach full potential;\nA comprehensive Total Rewards Program including bonuses and flexible benefits, competitive compensation, commissions, and stock options where applicable;\nLeaders who support your development through coaching and managing opportunities;\nAbility to make a difference and lasting impact from a local-to-global scale.\n\nAbout RBC Borealis\n\nRBC Borealis is the driving force behind Royal Bank of Canada’s AI and data innovation. As part of Canada’s largest financial institution, we bring together a team of architects, engineers, scientists, and product experts on a mission to revolutionize finance through world-class research, solutions, and a resilient data platform. With locations across Toronto, Waterloo, Montreal, Calgary, and Vancouver, we’re at the forefront of AI research and platform development. With a focus on cutting-edge research in areas like time series forecasting, causal machine learning, and responsible AI, we are seamlessly integrating AI research and data engineering, to solve critical challenges in the financial industry. We are building intelligent, and scalable, data-driven solutions that will help communities thrive and drive innovation for our customers across the bank.\n\nInclusion and Equal Opportunity Employment\n\nRBC is an equal opportunity employer committed to diversity and inclusion. We are pleased to consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veterans status, Aboriginal/Native American status or any other legally-protected factors. Disability-related accommodations during the application process are available upon request.\n\nJob Skills\n\nData Science, Decision Making, Deep Learning, Emerging Technologies, Group Problem Solving, Machine Learning, Multi-Level Communication, Programming Languages\n\nAdditional Job Details\n\nAddress:\n\n777 BAY ST, TH 27:TORONTO\n\nCity:\n\nTORONTO\n\nCountry:\n\nCanada\n\nWork hours/week:\n\n37.5\n\nEmployment Type:\n\nFull time\n\nPlatform:\n\nTECHNOLOGY AND OPERATIONS\n\nJob Type:\n\nRegular\n\nPay Type:\n\nSalaried\n\nPosted Date:\n\n2025-05-30\n\nApplication Deadline:\n\nNote: Applications will be accepted until 11:59 PM on the day prior to the application deadline date above\n\nInclusion and Equal Opportunity Employment\n\nAt RBC, we believe an inclusive workplace that has diverse perspectives is core to our continued growth as one of the largest and most successful banks in the world. Maintaining a workplace where our employees feel supported to perform at their best, effectively collaborate, drive innovation, and grow professionally helps to bring our Purpose to life and create value for our clients and communities. RBC strives to deliver this through policies and programs intended to foster a workplace based on respect, belonging and opportunity for all.\n\nJoin our Talent Community\n\nStay in-the-know about great career opportunities at RBC. Sign up and get customized info on our latest jobs, career tips and Recruitment events that matter to you.\n\nExpand your limits and create a new future together at RBC. Find out how we use our passion and drive to enhance the well-being of our clients and communities at jobs.rbc.com</a/span>",
    "scraped_at": "2025-06-05T14:50:56.977369"
  },
  "83fda81c4065f723968959647f6c197fe30d59d3747ee1339bddae00fe5febe9": {
    "company_name": "Autodesk",
    "company_url": "https://www.linkedin.com/company/autodesk/life",
    "job_title": "Senior and Principal Software Developer, AI/ML Platform",
    "job_url": "https://www.linkedin.com/jobs/view/4181604494/?alternateChannel=search&refId=tCzXz6JSJnALkq9IF%2FtJqw%3D%3D&trackingId=wXkok6dVlkgUGASqd9elCA%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nJob Requisition ID #\n\n25WD84833\n\n25WD84833, Développeur logiciel senior et principal, Plateforme IA/ML\n\nFrench translation will follow!/La traduction en français suivra!\n\nPrésentation du poste\n\nNous recherchons des ingénieurs logiciels seniors et principaux dynamiques et enthousiastes pour développer notre plateforme IA/ML de nouvelle génération utilisée dans le développement de la suite de produits et services d'Autodesk. Rejoignez notre équipe dynamique et en pleine expansion pour contribuer à la création de capacités innovantes permettant un développement plus rapide et plus sûr de l'apprentissage automatique et des solutions d'IA générative, renforçant ainsi l'intelligence des produits et services logiciels d'Autodesk. Vous collaborerez avec la recherche et l'ingénierie de produits de divers domaines, notamment la conception, la construction, la fabrication et les médias et divertissements, afin de fournir la plateforme qui prend en charge le cycle de vie complet du développement de l'IA/ML.\n\nNous recrutons des ingénieurs logiciels de différents niveaux pour la plateforme IA/AA au Canada.\n\nResponsabilités\n\nConception de systèmes innovants: diriger la conception et l'ingénierie de systèmes logiciels pour la plateforme IA/AA, en contribuant au cycle de développement complet de l'AA\nAutomatisation et rationalisation: identifier et mettre en œuvre des opportunités d'automatisation et de rationalisation des processus de développement de l'AA, en favorisant l'efficacité et l'efficience\nAutomatisation des flux de travail: développer des systèmes complets pour automatiser et optimiser les processus laborieux, en les intégrant de manière transparente dans notre plateforme afin de rationaliser les opérations\nDéploiement de solutions de ML: développer des outils pour créer et déployer des artefacts de ML dans des environnements de production, facilitant une transition en douceur du développement au déploiement\nGestion des Big Data: automatiser et orchestrer les tâches liées à la gestion de la transformation et du traitement des Big Data, en créant des magasins de données à grande échelle pour les artefacts de ML\nServices évolutifs: Concevoir et mettre en œuvre des services de prédiction et d'inférence évolutifs à faible latence pour répondre aux divers besoins de nos utilisateurs\nCollaboration interfonctionnelle: Collaborer avec diverses équipes, notamment des chercheurs en apprentissage automatique, des développeurs, des chefs de produit, des architectes logiciels et des opérations, en favorisant un environnement de travail collaboratif et cohésif\nLeadership architectural: Prendre en charge les composants critiques de la plateforme, fournir des orientations architecturales et contribuer au succès global de la plateforme IA/ML\n\nQualifications Minimales\n\nLicence en informatique ou expérience pratique équivalente\n3 à 8 ans d'expérience en développement et ingénierie de logiciels, avec une solide expérience dans la fourniture de systèmes et de services de production\nExpertise dans les langages de programmation tels que Python, Java, Go, les langages de script et SQL\nCompétences avérées en matière de résolution de problèmes, avec la capacité de décomposer les problèmes en éléments gérables\nExpérience approfondie des technologies cloud Amazon AWS (Amazon Web Services) ou Azure\nExcellente expérience en matière de conception de systèmes évolutifs et d'architecture logicielle distribuée\nExpérience approfondie des technologies de big data, notamment NoSQL, Hadoop, Spark, Hive et les pipelines de données\nSolide expertise des plateformes de données, englobant la conception et la mise en œuvre de systèmes évolutifs et efficaces de stockage, de récupération et de traitement des données\nExcellentes compétences en communication et en collaboration, favorisant le travail d'équipe et l'échange efficace d'informations\nConnaissance des méthodologies de développement agiles, notamment le CI/CD et le développement piloté par les tests\nConnaissance pratique du traitement, de la formation, du déploiement ou des opérations de données cloud, telles que Snowflake ou Databricks\nConnaissance pratique des principes de mise en réseau cloud et de leurs implications en matière de sécurité pour les organisations détenant des données sensibles\n\nQualifications Préférées\n\nExpérience du déploiement de projets et de solutions basés sur l'apprentissage automatique dans des environnements de production\nConnaissance des pratiques d'opérations d'apprentissage automatique\nExpérience des grands modèles de langage open source sur Hugging Face, tels que Llama et Mixtral\nExpérience des bibliothèques ML telles que PyTorch, TensorFlow, XGBoost, Pandas et ScikitLearn\nExpérience de l'analyse statistique\nCollaboration antérieure avec des scientifiques des données et des chercheurs\nExpérience pratique de la construction d'une infrastructure centrée sur Kubernetes et des processus CI/CD\nExpérience pratique de l'automatisation des corrections de vulnérabilités et du travail avec les équipes de sécurité des grandes entreprises\n\n_____________________________________________________________________________\n\n25WD84833, Senior and Principal Software Developer, AI/ML Platform\n\nPosition Overview\n\nWe are seeking a dynamic and enthusiastic senior software and principal software engineers to develop our next-generation AI/ML platform used in the development of Autodesk’s suite of products and services. Join our dynamic and rapidly expanding team to help build innovative capabilities that enable faster and more secure development of machine learning and generative AI solutions, bolstering the intelligence of Autodesk software products and services. You will collaborate with research and product engineering from various domains including design, construction, manufacturing, and media & entertainment to deliver the platform that supports full AI/ML development lifecycle.\n\nWe are hiring for multiple levels of Software Engineers, AI/ML Platform in Canada\n\nResponsibilities\n\nInnovative System Design: Lead the design and engineering of software systems for the AI/ML Platform, contributing to the full ML development lifecycle\nAutomation and Streamlining: Identify and implement opportunities to automate and streamline ML development processes, fostering efficiency and effectiveness\nWorkflow Automation: Develop comprehensive systems to automate and optimize laborious processes, integrating them seamlessly into our platform to streamline operations\nML Solution Deployment: Develop tools for building and deploying ML artifacts in production environments, facilitating a smooth transition from development to deployment\nBig Data Management: Automate and orchestrate tasks related to managing big data transformation and processing, building large-scale data stores for ML artifacts\nScalable Services: Design and implement low-latency, scalable prediction, and inference services to support the diverse needs of our users\nCross-Functional Collaboration: Collaborate across diverse teams, including machine learning researchers, developers, product managers, software architects, and operations, fostering a collaborative and cohesive work environment\nArchitectural Leadership: Take ownership of critical components of the platform, providing architectural direction, and contributing to the overall success of the AI/ML Platform\n\nMinimum Qualifications\n\nBS in Computer Science, or equivalent practical experience\n3-8 years of experience in software development and engineering, with a solid record of delivering production systems and services\nExpertise in programming languages such as Python, Java, Go, scripting languages and SQL\nDemonstrated created problem-solving skills with the ability to break down problems into manageable components\nIn-depth experience with Amazon AWS (Amazon Web Services) or Azure cloud technologies\nExcellent track record in scalable system design and distributed software architecture\nIn-depth experience working with big data technologies, including NoSQL, Hadoop, Spark, Hive, and data pipelines\nStrong expertise in data platforms, encompassing the design and implementation of scalable and efficient data storage, retrieval, and processing systems\nExcellent communication and collaboration skills, fostering teamwork and effective information exchange\nFamiliarity with agile development methodologies, including CI/CD & test-driven development\nWorking knowledge with cloud data processing, training, deployment, or operations, such as Snowflake or Databricks\nWorking knowledge of cloud networking principles and their security implications for organizations holding sensitive data\n\nPreferred Qualifications\n\nExposure to deploying ML-enabled projects and solutions to production environments\nFamiliarity with Machine Learning Operations practices\nExposure to open-source Large Language Models on Hugging Face like Llama & Mixtral\nExposure to ML libraries such as PyTorch, TensorFlow, XGBoost, Pandas, and ScikitLearn\nExposure to statistical analysis\nPast collaboration with data scientists and researchers\nHands-on experience building on Kubernetes centric infrastructure and CI/CD processes\nHands-on experience automating vulnerability fixes and working with security teams at large enterprise companies\n\nLearn More / Plus d'information\n\nAbout Autodesk / À Propos D’Autodesk\n\nWelcome to Autodesk! Amazing things are created every day with our software – from the greenest buildings and cleanest cars to the smartest factories and biggest hit movies. We help innovators turn their ideas into reality, transforming not only how things are made, but what can be made.\n\nWe take great pride in our culture here at Autodesk – our Culture Code is at the core of everything we do. Our values and ways of working help our people thrive and realize their potential, which leads to even better outcomes for our customers.\n\nWhen you’re an Autodesker, you can be your whole, authentic self and do meaningful work that helps build a better future for all. Ready to shape the world and your future? Join us!\n\nBienvenue à Autodesk ! Des choses incroyables sont créées chaque jour avec nos logiciels - des bâtiments les plus écologiques et des voitures les plus propres aux usines les plus intelligentes et aux plus grands films à succès. Nous aidons les innovateurs à transformer leurs idées en réalité, transformant non seulement la façon dont les choses sont faites, mais ce qui peut être fait.\n\nNous sommes très fiers de notre culture ici chez Autodesk - notre code en matière de culture est au cœur de tout ce que nous faisons. Nos valeurs et nos méthodes de travail aident nos employés à prospérer et à réaliser leur potentiel, ce qui conduit à des résultats encore meilleurs pour nos clients.\n\nLorsque vous êtes un employé Autodesk, vous pouvez être entier et authentique et effectuer un travail significatif qui aide à construire un avenir meilleur pour tous. Prêt à façonner le monde et votre avenir? Joignez-vous à nous !\n\nSalary transparency / Transparence salariale\n\nSalary is one part of Autodesk’s competitive compensation package. Offers are based on the candidate’s experience and geographic location. In addition to base salaries, we also have a significant emphasis on discretionary annual cash bonuses, commissions for sales roles, stock or long-term incentive cash grants, and a comprehensive benefits package.\n\nLe salaire est l'un des éléments de l'offre compétitive d'Autodesk. Les offres sont basées sur l'expérience et la situation géographique du candidat. Outre les salaires de base, nous accordons également une grande importance aux primes annuelles discrétionnaires en espèces, aux commissions pour les fonctions de vente, aux actions ou aux primes d'encouragement à long terme en espèces, ainsi qu'à un ensemble complet d'avantages sociaux.\n\nDiversity & Belonging / Diversité et appurtenance\n\nWe take pride in cultivating a culture of belonging and an equitable workplace where everyone can thrive. Learn more here: https://www.autodesk.com/company/diversity-and-belonging\n\nNous sommes fiers de cultiver une culture d’appartenance et un milieu de travail équitable où tout le monde peut s’épanouir. Pour en savoir plus, cliquez ici : https://www.autodesk.com/company/diversity-and-belonging\n\nAre you an existing contractor or consultant with Autodesk? \n\nÊtes-vous un sous-traitant ou un consultant existant d’Autodesk ?\n\nPlease search for open jobs and apply internally (not on this external site).\n\nVeuillez rechercher des emplois vacants et postuler à l’interne (pas sur ce site externe).",
    "scraped_at": "2025-06-05T14:51:00.272064"
  },
  "fe9d0daefa9491f73dcc5bda048d4c29655949de65901bcfbdf23ff376f23db8": {
    "company_name": "Autodesk",
    "company_url": "https://www.linkedin.com/company/autodesk/life",
    "job_title": "Senior and Principal Software Developer, AI/ML Platform",
    "job_url": "https://www.linkedin.com/jobs/view/4181602592/?alternateChannel=search&refId=tCzXz6JSJnALkq9IF%2FtJqw%3D%3D&trackingId=A3ZQPlCuX05zpuyShe%2FLQg%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nJob Requisition ID #\n\n25WD84833\n\n25WD84833, Développeur logiciel senior et principal, Plateforme IA/ML\n\nFrench translation will follow!/La traduction en français suivra!\n\nPrésentation du poste\n\nNous recherchons des ingénieurs logiciels seniors et principaux dynamiques et enthousiastes pour développer notre plateforme IA/ML de nouvelle génération utilisée dans le développement de la suite de produits et services d'Autodesk. Rejoignez notre équipe dynamique et en pleine expansion pour contribuer à la création de capacités innovantes permettant un développement plus rapide et plus sûr de l'apprentissage automatique et des solutions d'IA générative, renforçant ainsi l'intelligence des produits et services logiciels d'Autodesk. Vous collaborerez avec la recherche et l'ingénierie de produits de divers domaines, notamment la conception, la construction, la fabrication et les médias et divertissements, afin de fournir la plateforme qui prend en charge le cycle de vie complet du développement de l'IA/ML.\n\nNous recrutons des ingénieurs logiciels de différents niveaux pour la plateforme IA/AA au Canada.\n\nResponsabilités\n\nConception de systèmes innovants: diriger la conception et l'ingénierie de systèmes logiciels pour la plateforme IA/AA, en contribuant au cycle de développement complet de l'AA\nAutomatisation et rationalisation: identifier et mettre en œuvre des opportunités d'automatisation et de rationalisation des processus de développement de l'AA, en favorisant l'efficacité et l'efficience\nAutomatisation des flux de travail: développer des systèmes complets pour automatiser et optimiser les processus laborieux, en les intégrant de manière transparente dans notre plateforme afin de rationaliser les opérations\nDéploiement de solutions de ML: développer des outils pour créer et déployer des artefacts de ML dans des environnements de production, facilitant une transition en douceur du développement au déploiement\nGestion des Big Data: automatiser et orchestrer les tâches liées à la gestion de la transformation et du traitement des Big Data, en créant des magasins de données à grande échelle pour les artefacts de ML\nServices évolutifs: Concevoir et mettre en œuvre des services de prédiction et d'inférence évolutifs à faible latence pour répondre aux divers besoins de nos utilisateurs\nCollaboration interfonctionnelle: Collaborer avec diverses équipes, notamment des chercheurs en apprentissage automatique, des développeurs, des chefs de produit, des architectes logiciels et des opérations, en favorisant un environnement de travail collaboratif et cohésif\nLeadership architectural: Prendre en charge les composants critiques de la plateforme, fournir des orientations architecturales et contribuer au succès global de la plateforme IA/ML\n\nQualifications Minimales\n\nLicence en informatique ou expérience pratique équivalente\n3 à 8 ans d'expérience en développement et ingénierie de logiciels, avec une solide expérience dans la fourniture de systèmes et de services de production\nExpertise dans les langages de programmation tels que Python, Java, Go, les langages de script et SQL\nCompétences avérées en matière de résolution de problèmes, avec la capacité de décomposer les problèmes en éléments gérables\nExpérience approfondie des technologies cloud Amazon AWS (Amazon Web Services) ou Azure\nExcellente expérience en matière de conception de systèmes évolutifs et d'architecture logicielle distribuée\nExpérience approfondie des technologies de big data, notamment NoSQL, Hadoop, Spark, Hive et les pipelines de données\nSolide expertise des plateformes de données, englobant la conception et la mise en œuvre de systèmes évolutifs et efficaces de stockage, de récupération et de traitement des données\nExcellentes compétences en communication et en collaboration, favorisant le travail d'équipe et l'échange efficace d'informations\nConnaissance des méthodologies de développement agiles, notamment le CI/CD et le développement piloté par les tests\nConnaissance pratique du traitement, de la formation, du déploiement ou des opérations de données cloud, telles que Snowflake ou Databricks\nConnaissance pratique des principes de mise en réseau cloud et de leurs implications en matière de sécurité pour les organisations détenant des données sensibles\n\nQualifications Préférées\n\nExpérience du déploiement de projets et de solutions basés sur l'apprentissage automatique dans des environnements de production\nConnaissance des pratiques d'opérations d'apprentissage automatique\nExpérience des grands modèles de langage open source sur Hugging Face, tels que Llama et Mixtral\nExpérience des bibliothèques ML telles que PyTorch, TensorFlow, XGBoost, Pandas et ScikitLearn\nExpérience de l'analyse statistique\nCollaboration antérieure avec des scientifiques des données et des chercheurs\nExpérience pratique de la construction d'une infrastructure centrée sur Kubernetes et des processus CI/CD\nExpérience pratique de l'automatisation des corrections de vulnérabilités et du travail avec les équipes de sécurité des grandes entreprises\n\n_____________________________________________________________________________\n\n25WD84833, Senior and Principal Software Developer, AI/ML Platform\n\nPosition Overview\n\nWe are seeking a dynamic and enthusiastic senior software and principal software engineers to develop our next-generation AI/ML platform used in the development of Autodesk’s suite of products and services. Join our dynamic and rapidly expanding team to help build innovative capabilities that enable faster and more secure development of machine learning and generative AI solutions, bolstering the intelligence of Autodesk software products and services. You will collaborate with research and product engineering from various domains including design, construction, manufacturing, and media & entertainment to deliver the platform that supports full AI/ML development lifecycle.\n\nWe are hiring for multiple levels of Software Engineers, AI/ML Platform in Canada\n\nResponsibilities\n\nInnovative System Design: Lead the design and engineering of software systems for the AI/ML Platform, contributing to the full ML development lifecycle\nAutomation and Streamlining: Identify and implement opportunities to automate and streamline ML development processes, fostering efficiency and effectiveness\nWorkflow Automation: Develop comprehensive systems to automate and optimize laborious processes, integrating them seamlessly into our platform to streamline operations\nML Solution Deployment: Develop tools for building and deploying ML artifacts in production environments, facilitating a smooth transition from development to deployment\nBig Data Management: Automate and orchestrate tasks related to managing big data transformation and processing, building large-scale data stores for ML artifacts\nScalable Services: Design and implement low-latency, scalable prediction, and inference services to support the diverse needs of our users\nCross-Functional Collaboration: Collaborate across diverse teams, including machine learning researchers, developers, product managers, software architects, and operations, fostering a collaborative and cohesive work environment\nArchitectural Leadership: Take ownership of critical components of the platform, providing architectural direction, and contributing to the overall success of the AI/ML Platform\n\nMinimum Qualifications\n\nBS in Computer Science, or equivalent practical experience\n3-8 years of experience in software development and engineering, with a solid record of delivering production systems and services\nExpertise in programming languages such as Python, Java, Go, scripting languages and SQL\nDemonstrated created problem-solving skills with the ability to break down problems into manageable components\nIn-depth experience with Amazon AWS (Amazon Web Services) or Azure cloud technologies\nExcellent track record in scalable system design and distributed software architecture\nIn-depth experience working with big data technologies, including NoSQL, Hadoop, Spark, Hive, and data pipelines\nStrong expertise in data platforms, encompassing the design and implementation of scalable and efficient data storage, retrieval, and processing systems\nExcellent communication and collaboration skills, fostering teamwork and effective information exchange\nFamiliarity with agile development methodologies, including CI/CD & test-driven development\nWorking knowledge with cloud data processing, training, deployment, or operations, such as Snowflake or Databricks\nWorking knowledge of cloud networking principles and their security implications for organizations holding sensitive data\n\nPreferred Qualifications\n\nExposure to deploying ML-enabled projects and solutions to production environments\nFamiliarity with Machine Learning Operations practices\nExposure to open-source Large Language Models on Hugging Face like Llama & Mixtral\nExposure to ML libraries such as PyTorch, TensorFlow, XGBoost, Pandas, and ScikitLearn\nExposure to statistical analysis\nPast collaboration with data scientists and researchers\nHands-on experience building on Kubernetes centric infrastructure and CI/CD processes\nHands-on experience automating vulnerability fixes and working with security teams at large enterprise companies\n\nLearn More / Plus d'information\n\nAbout Autodesk / À Propos D’Autodesk\n\nWelcome to Autodesk! Amazing things are created every day with our software – from the greenest buildings and cleanest cars to the smartest factories and biggest hit movies. We help innovators turn their ideas into reality, transforming not only how things are made, but what can be made.\n\nWe take great pride in our culture here at Autodesk – our Culture Code is at the core of everything we do. Our values and ways of working help our people thrive and realize their potential, which leads to even better outcomes for our customers.\n\nWhen you’re an Autodesker, you can be your whole, authentic self and do meaningful work that helps build a better future for all. Ready to shape the world and your future? Join us!\n\nBienvenue à Autodesk ! Des choses incroyables sont créées chaque jour avec nos logiciels - des bâtiments les plus écologiques et des voitures les plus propres aux usines les plus intelligentes et aux plus grands films à succès. Nous aidons les innovateurs à transformer leurs idées en réalité, transformant non seulement la façon dont les choses sont faites, mais ce qui peut être fait.\n\nNous sommes très fiers de notre culture ici chez Autodesk - notre code en matière de culture est au cœur de tout ce que nous faisons. Nos valeurs et nos méthodes de travail aident nos employés à prospérer et à réaliser leur potentiel, ce qui conduit à des résultats encore meilleurs pour nos clients.\n\nLorsque vous êtes un employé Autodesk, vous pouvez être entier et authentique et effectuer un travail significatif qui aide à construire un avenir meilleur pour tous. Prêt à façonner le monde et votre avenir? Joignez-vous à nous !\n\nSalary transparency / Transparence salariale\n\nSalary is one part of Autodesk’s competitive compensation package. Offers are based on the candidate’s experience and geographic location. In addition to base salaries, we also have a significant emphasis on discretionary annual cash bonuses, commissions for sales roles, stock or long-term incentive cash grants, and a comprehensive benefits package.\n\nLe salaire est l'un des éléments de l'offre compétitive d'Autodesk. Les offres sont basées sur l'expérience et la situation géographique du candidat. Outre les salaires de base, nous accordons également une grande importance aux primes annuelles discrétionnaires en espèces, aux commissions pour les fonctions de vente, aux actions ou aux primes d'encouragement à long terme en espèces, ainsi qu'à un ensemble complet d'avantages sociaux.\n\nDiversity & Belonging / Diversité et appurtenance\n\nWe take pride in cultivating a culture of belonging and an equitable workplace where everyone can thrive. Learn more here: https://www.autodesk.com/company/diversity-and-belonging\n\nNous sommes fiers de cultiver une culture d’appartenance et un milieu de travail équitable où tout le monde peut s’épanouir. Pour en savoir plus, cliquez ici : https://www.autodesk.com/company/diversity-and-belonging\n\nAre you an existing contractor or consultant with Autodesk? \n\nÊtes-vous un sous-traitant ou un consultant existant d’Autodesk ?\n\nPlease search for open jobs and apply internally (not on this external site).\n\nVeuillez rechercher des emplois vacants et postuler à l’interne (pas sur ce site externe).",
    "scraped_at": "2025-06-05T14:51:02.830932"
  },
  "a1015cff355adc7ae65b5baba0fe93db48b13ced989197a997d2771ec2231e4f": {
    "company_name": "Cisco Meraki",
    "company_url": "https://www.linkedin.com/company/cisco-meraki/life",
    "job_title": "Lead Software Engineer with AI/ML skills/Ingénieur logiciel principal avec compétences en IA/ML, à distance au Canada",
    "job_url": "https://www.linkedin.com/jobs/view/4240993035/?alternateChannel=search&refId=tCzXz6JSJnALkq9IF%2FtJqw%3D%3D&trackingId=VfRuMGLlSPtGC3jBPtxS0A%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nApplications are accepted until further notice\n\nAbout Cisco Meraki and your role:\n\nAt Cisco Meraki, our intuitive products enable organizations of all sizes to deliver cloud-managed networking at scale. To provide best-in-class technologies to our customers, we've created an unrivaled company culture for our employees, one that is collaborative, flexible, and inclusive. We take pride in providing employees with the autonomy to develop technology that's intuitive, secure, and accessible for everyone.\n\nAs the Lead Machine Learning Engineer for Meraki Assurance, you will drive the engineering teams tasked with advancing the Network Assurance applications through machine learning and artificial intelligence solutions. Dashboard serves as the cornerstone of the Meraki cloud ecosystem, beloved by network administrators worldwide. Your mission will be to elevate Meraki Dashboard to new heights of innovation, leverage AI to enhance simplicity, scalability, and security, while addressing the evolving demands of administrators managing some of the largest networks globally.\n\nYour success will hinge on your ability to guide a team of skilled ML/AI engineers, fostering a collaborative environment while building strong partnerships with engineering leaders, UX designers, product management, and security experts. At Meraki, engineering thrives on collaboration, and you will work closely with your team and multi-functional partners to drive the development and integration of ML/AI based features into the Dashboard platform.\n\nYou Will:\n\nWork with the senior engineering leaders, product management, and others to set the technical vision for the Meraki Assurance ML/AI roadmap. \nGuide ML engineering team through defining short, medium, and long-term goals to achieve the vision. \nHelp with the recruiting strategy to build a diverse and inclusive team: driving decisions on whom the team needs to hire. \nMentor and coach engineers through technical challenges. \nWork on projects that span numerous networking domains and systems — to help our ML solutions scale by handling enormous amounts of data. \n\nYou are an ideal candidate if you have:\n\n12+ years of professional experience in machine learning, data engineering, software engineering, Dev/Ops or related fields. \nExperience in building large scale AI models and systems using MLOps practices; including deep learning models using frameworks such as Tensorflow, Keras, PyTorch \nExperience working in a team to write robust, maintainable, and extendable code in Python and/or R. \nExperience with complex data sets, ETL pipelines, SQL, and general data engineering \nExpertise with cloud architecture and technologies like Amazon Web Services, Spark, Kubernetes, Docker, Jenkins, Terraform \n\nBonus points:\n\nExperience building scalable and production ready Generative AI solutions \nHave understanding of Realtime technologies such as Kafka, ClickHouse. \n\nAt Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can bring new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone.\n\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.\n\nIngénieur logiciel principal avec compétences en IA/ML, à distance au Canada\n\nLes candidatures sont acceptées jusqu'à nouvel ordre\n\nÀ propos de Cisco Meraki et de vos fonctions :\n\nChez Cisco Meraki, nos produits intuitifs permettent aux organisations de toutes les tailles d’offrir des réseaux gérés dans le nuage à l'échelle. Pour fournir des technologies de pointe à nos clients, nous avons créé une culture d’entreprise inégalée pour nos employés, fondée sur la collaboration, la flexibilité et l'inclusion. Nous sommes fiers d’offrir aux employés l’autonomie nécessaire pour développer des technologies qui sont intuitives, sécurisées et accessibles à tous.\n\nEn tant que spécialiste principal en ingénierie de l’apprentissage automatique pour Meraki Assurance, vous dirigerez les équipes d’ingénierie chargées de faire progresser les applications d’assurance de réseau grâce à des solutions d’apprentissage automatique et d’intelligence artificielle. Le tableau de bord est la pierre angulaire de l’écosystème infonuagique Meraki, aimé par les administrateurs de réseau du monde entier. Votre mission consistera à hisser le Tableau de bord Cisco Meraki vers de nouveaux sommets en matière d'innovation, de tirer parti de l'IA pour renforcer la simplicité, l’évolutivité et la sécurité, tout en répondant aux besoins en constante évolution des administrateurs gérant certains des plus grands réseaux au monde.\n\nVotre réussite dépendra de votre capacité à diriger une équipe d'ingénieurs spécialisés en apprentissage automatique et en IA, à favoriser un environnement collaboratif, tout en établissant des partenariats solides avec les chefs techniques, les concepteurs d’expérience utilisateur, les chefs de gestion de produit et les experts en sécurité. Chez Cisco Meraki, l’ingénierie repose sur la collaboration. Vous travaillerez étroitement avec votre équipe et des partenaires interfonctionnels pour favoriser le développement et l’intégration de fonctionnalités basées sur l’apprentissage automatique et l’intelligence artificielle dans la plateforme du tableau de bord.\n\nVous aller :\n\nCollaborer avec les dirigeants principaux en ingénierie, les chefs de gestion des produits et d’autres personnes pour définir la vision technique de la feuille de route de l’apprentissage automatique et de l’intelligence artificielle de Meraki Assurance. \nGuider l’équipe d’ingénierie de l’apprentissage automatique en définissant les objectifs à court, à moyen et à long terme pour réaliser la vision. \nContribuer à la stratégie de recrutement pour créer une équipe diversifiée et inclusive : orienter les décisions relatives aux personnes que l’équipe doit embaucher. \nEncadrer et guider les gestionnaires et les ingénieurs au travers de défis techniques. \nTravailler sur des projets couvrant de nombreux domaines et systèmes réseau afin d’aider nos solutions d’apprentissage automatique à évoluer en traitant d’énormes volumes de données. \n\nVous êtes un candidat idéal si :\n\nvous avez au moins douze ans d’expérience professionnelle en apprentissage automatique, en ingénierie de données, en génie logiciel, en développement et en opérations ou dans des domaines connexes; \nvous avez de l'expérience dans la création de modèles et de systèmes d’intelligence artificielle évolutifs à l’aide de pratiques MLOps; y compris les modèles d’apprentissage profond utilisant des cadres tels que Tensorflow, Keras, PyTorch; \nvous avez de l'expérience de travail en équipe relativement à l'écriture de codes robustes, maintenables et évolutifs en Python ou R; \nvous avez de l'expérience avec les ensembles de données complexes, les pipelines ETL, SQL et l’ingénierie générale des données; \nvous avez de l'expertise en architecture cloud et en technologies comme Amazon Web Services, Spark, Kubernetes, Docker, Jenkins, Terraform. \n\nAtouts supplémentaires :\n\nExpérience en création de solutions d’intelligence artificielle générative qui sont évolutives et prêtes pour la production \nLa compréhension des technologies en temps réel telles que Kafka et ClickHouse. \n\nChez Cisco Meraki, nous défions le statu quo grâce à la puissance de la diversité, de l’inclusion et de la collaboration. Lorsque nous réunissons des perspectives différentes, nous pouvons faire émerger de nouvelles possibilités, inspirer l’innovation et libérer tout le potentiel de nos employés. Nous créons une expérience pour les employés qui inclut l’acceptation, l’appartenance, la croissance et des objectifs pour tous.\n\nCisco est un employeur d’action affirmative et d’égalité des chances, et tous les candidats qualifiés seront pris en considération pour un emploi sans égard à la race, à la couleur, à la religion, au sexe, à l’orientation sexuelle, à l’origine nationale, aux caractéristiques génétiques, à l’âge, à l’invalidité, au statut d’ancien combattant ou à tout autre motif protégé par la loi. Cisco envisagera pour l’emploi, au cas par cas, des candidats qualifiés avec des dossiers d’arrestation et de condamnation.\n\nCompensation Range:\n\n$155,000—$240,000 CAD\n\nMessage to applicants applying to work in the U.S. and/or Canada:\n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire, full-time salaries in U.S. and/or Canada locations, not including equity or benefits. For non-sales roles the hiring ranges reflect base salary only; employees are also eligible to receive annual bonuses. Hiring ranges for sales positions include base and incentive compensation target. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications, or training. Applicants may not be eligible for the full salary range based on their U.S. or Canada hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.\n\nU.S. employees have access to quality medical, dental and vision insurance, a 401(k) plan with a Cisco matching contribution, short and long-term disability coverage, basic life insurance and numerous wellbeing offerings.\n\nEmployees receive up to twelve paid holidays per calendar year, which includes one floating holiday (for non-exempt employees), plus a day off for their birthday. Non-Exempt new hires accrue up to 16 days of vacation time off each year, at a rate of 4.92 hours per pay period. Exempt new hires participate in Cisco’s flexible Vacation Time Off policy, which does not place a defined limit on how much vacation time eligible employees may use, but is subject to availability and some business limitations. All new hires are eligible for Sick Time Off subject to Cisco’s Sick Time Off Policy and will have eighty (80) hours of sick time off provided on their hire date and on January 1st of each year thereafter. Up to 80 hours of unused sick time will be carried forward from one calendar year to the next such that the maximum number of sick time hours an employee may have available is 160 hours. Employees in Illinois have a unique time off program designed specifically with local requirements in mind. All employees also have access to paid time away to deal with critical or emergency issues. We offer additional paid time to volunteer and give back to the community.\n\nEmployees on sales plans earn performance-based incentive pay on top of their base salary, which is split between quota and non-quota components. For quota-based incentive pay, Cisco typically pays as follows:\n\n75% of incentive target for each 1% of revenue attainment up to 50% of quota;\n\n1.5% of incentive target for each 1% of attainment between 50% and 75%;\n\n1% of incentive target for each 1% of attainment between 75% and 100%; and once performance exceeds 100% attainment, incentive rates are at or above 1% for each 1% of attainment with no cap on incentive compensation.\n\nFor non-quota-based sales performance elements such as strategic sales objectives, Cisco may pay up to 125% of target. Cisco sales plans do not have a minimum threshold of performance for sales incentive compensation to be paid.",
    "scraped_at": "2025-06-05T14:51:05.939064"
  },
  "fab9b2f5d13b8420e726de5660a8b8427aa791d2ef863016495202b9fc334d22": {
    "company_name": "Ubisoft Montréal",
    "company_url": "https://www.linkedin.com/company/ubisoft-montreal/life",
    "job_title": "Scientifique en données ML Senior _ Groupe Technologique Content Creation",
    "job_url": "https://www.linkedin.com/jobs/view/4127674354/?alternateChannel=search&refId=tCzXz6JSJnALkq9IF%2FtJqw%3D%3D&trackingId=cPJ9zCMZfZm8xiOjj3QBkg%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nDescription Du Poste\n\nLe Groupe de technologie de création de contenu (CCTG) recherche un scientifique en données ML senior pour travailler au sein d’une équipe qui développe des solutions d’apprentissage automatique pour améliorer l’expérience des joueurs, y compris un projet sur les bots qui simulent de vrais joueurs concurrents. Le scientifique en données ML créera des systèmes auto-apprenants hautement efficaces qui peuvent s’adapter et évoluer au fil du temps, repoussant les limites de la technologie de l’IA. Rejoignez-nous et soyez à la pointe de l’innovation dans le domaine de l’apprentissage automatique.\n\nResponsabilités principales : \n\n\nCréer, valider, tester et mettre à jour des algorithmes et modèles ML.\nIdentifier, préparer et analyser des données à des fins de formation et de test. \nMener des expériences, effectuer des analyses statistiques, affiner et optimiser les modèles. \nUtiliser la rigueur analytique et les méthodes statistiques pour analyser de grandes quantités de données, en développant des insights exploitables à l’aide de techniques statistiques avancées telles que les modèles statistiques prédictifs, le profilage des utilisateurs/joueurs, l’analyse de segmentation, la conception, l’analyse d’enquêtes et le data mining. \nSuperviser et concevoir diverses preuves de concept pour des projets prédictifs/prescriptifs d’IA. \nRechercher de nouvelles méthodes pour modéliser et prédire les comportements et concevoir des expériences pour répondre à des questions ciblées. \n\n\nAutres responsabilités : \n\n\nCollaborer avec des équipes interfonctionnelles pour définir les exigences et objectifs du projet. \nMener des recherches pour rester à jour avec les dernières avancées. \nDocumentation, présentations et partage de connaissances pour communiquer des concepts d’IA complexes à des collaborateurs techniques et non techniques. \nEncadrer les autres membres de l’équipe.\n\n\nQualifications\n\nFormation: \n\n\nMaster et/ou doctorat de préférence en mathématiques appliquées, statistiques, apprentissage automatique ou expérience équivalente. \n\n\nExpérience pertinente : \n\n\n3 à 5 ans d’expérience complexe et d’expertise approfondie liée au poste. \n\n\nCompétences principales : \n\n\nCapacité à utiliser et développer des algorithmes de machine learning et des méthodes éprouvées connexes. \nCapacité à utiliser des techniques avancées de science de données. \nCapacité à utiliser des statistiques pour comprendre le comportement des systèmes et/ou des joueurs. \nFamiliarité avec les technologies Big Data (Hadoop, Cassandra, MongoDB, ElasticSearch). \nPassion pour l’utilisation de la science de données pour résoudre des problèmes. \nCapacité à évaluer rapidement un problème à la fois qualitativement et quantitativement. \n\n\nAutres compétences : \n\n\nCompétences en ingénierie logicielle. \nFamiliarité avec le calcul distribué pour entraîner des modèles. \nMaîtrise de Python et expérience avec des bibliothèques et frameworks tels que PyTorch et/ou TensorFlow. \nUne bonne connaissance des plateformes infonuagiques est un atout. \nEsprit d’équipe avec d’excellentes compétences organisationnelles, de communication et interpersonnelles. \nÊtre orienté sur les valeurs d’affaire/entreprise. \nBilinguisme (français, anglais).\n\n\nInformations complémentaires\n\nQuoi nous envoyer\n\n\nVotre CV mettant en valeur votre formation, votre expérience, vos compétences et les jeux livrés",
    "scraped_at": "2025-06-05T14:51:08.805285"
  },
  "3e059fa6b2faf92dbd3998b2ed0bb8d378897d7a7dee02f82eab58a82a82c81b": {
    "company_name": "Oracle",
    "company_url": "https://www.linkedin.com/company/oracle/life",
    "job_title": "Senior Detections Developer with ML/AI",
    "job_url": "https://www.linkedin.com/jobs/view/4211300380/?alternateChannel=search&refId=tCzXz6JSJnALkq9IF%2FtJqw%3D%3D&trackingId=Ighg6mvFduPkgUOaLByQfw%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nJob Description\n\nAre you passionate about developing capabilities to protect security and privacy at cloud scale? Are you curious to understand complex systems, their inner workings and how to ensure their compliant operations? We are looking for a Senior Detections Engineer who has the right mix of software development experience, security research knowhow, and passion for solving complex security-oriented problems. Our team strives to support the business success of our customers by designing and building innovative new solutions to monitor the performance and security of their operations. Your mission will be to design, develop and productize detections capabilities for a broad range of security and privacy compliance. You will engage in the end-to-end process from requirements analysis to development and testing to detections operationalization. We value driven professionals who have passion to learn, enable others and deliver production quality software.\n\nWe offer:\n\nA world-class team of highly skilled professionals who thrive on new challenges.\nExpertise in networking, network and database security, statistical analysis and machine learning, software development and data analytics.\nDrive to deliver customer impact while valuing curiosity, commitment, and a mindset to help others.\nThe resources of a large enterprise and the energy of a start-up.\nExposure to incredibly large-scale network infrastructure and the opportunities for innovation it brings.\nA philosophy focuses on personal growth through ongoing training, skills development, and hands on experience.\n\n\nVous voulez renforcer les capacités de protection de la sécurité et de la vie privée dans le nuage? Vous désirez comprendre les systèmes complexes, notamment leur fonctionnement interne et la façon de garantir la conformité de leurs opérations? Nous cherchons un expert en détection qui possède un mélange optimal d'expérience en développement de logiciels, de savoir-faire en recherche sur la sécurité et un intérêt marqué pour la résolution de problèmes de sécurité complexes. Notre équipe s'efforce de soutenir la réussite de nos clients en concevant et en concrétisant des solutions innovatrices pour contrôler la performance et la sécurité des opérations. Vous aurez pour mission de concevoir et de produire des outils de détection pour une vaste gamme d’éléments de conformité, en sécurité et en protection de la vie privée. Vous participerez au processus complet, de l'analyse des besoins à l'opérationnalisation des détections, en passant par le développement et les essais. Nous aimons les professionnels qui désirent apprendre, stimuler leurs collègues et créer des logiciels de qualité.\n\nNous offrons :\n\nUne équipe de calibre mondial, composée de professionnels chevronnés qui aiment relever des défis.\nExpertise en réseautage, en sécurité des réseaux et des BD, en analyse statistique et en apprentissage automatique, en développement de logiciels et en analyse de données.\nCapacité d'influer sur les clients tout en valorisant la curiosité, l'engagement et la volonté d'aider les autres.\nRessources d'une grande organisation et énergie d'une jeune entreprise.\nInfrastructure de réseau de très grande envergure et possibilités d'innovation qui en résultent.\nPhilosophie axée sur le développement personnel grâce à la formation continue, au développement des compétences et à l'expérience pratique.\n\n\nResponsibilities\n\n RESPONSIBILITIES \n\nThreat modeling and requirements analysis of complex systems. \nRisk analysis and identifying gaps in current monitoring.\nData collection requirements and data quality assessment. \nDesign and the implementation of capabilities to monitor application and network traffic behavior.\nOversee compliance of detections with information security standards and corporate security policies. \nSupport investigations and root cause analyses of detections.\n\n\nBasic Qualifications\n\nMaster’s Degree or PhD in Computer Science or related field.\n6+ years of experience in detections engineering, network security or a related field. \nComfortable with writing non-trivial code in Python, Scala, and good skills in Java.\nBackground in statistical analysis and ML/AI.\nStrong background in distributed systems incl. Spark and automation.\nExperience in working in a (ML) DevOps model using any of the major cloud providers Azure, AWS, GCP, OCI, etc.\nCritical thinking skills and ability to solve complex problems.\nExcellent organizational, verbal, and written communication skills.\nStrong teamwork and collaboration skills.\nExperience of working on SIEM tools like Splunk to analyze logs and correlate events is a plus.\nGood understanding of security principles, security standards, MITRA matrix is a plus.\n\n\nResponsabilités :\n\nModélisation des menaces et analyse des besoins de systèmes complexes. \nAnalyse des risques et repérage des lacunes dans le suivi actuel. \nExigences de collecte de données et évaluation de la qualité des données. \nConception et mise en œuvre d’outils de surveillance du comportement des applications et du trafic réseau.\nSupervision de la conformité des détections au moyen des normes de sécurité de l'information et des politiques de sécurité de l'organisation. \nSoutien des enquêtes et des analyses des causes profondes des détections.\n\n\nCompétences de base :\n\nDiplôme de 2e ou de 3e cycle en informatique ou dans un domaine connexe.\nSix ans ou plus d'expérience en détection, en sécurité des réseaux ou dans un domaine connexe. \nBien connaître l'écriture de code non trivial en Python et Scalal; bonne connaissance de Java.\nConnaissances souhaitées en analyse statistique, en AA (apprentissage automatique) et en IA.\nSolide expérience en systèmes distribués, y compris Spark et automatisation.\nExpérience en modèle (AA) DevOps s’appuyant sur l'un des principaux fournisseurs de nuage (Azure, AWS, GCP, OCI, etc.).\nEsprit critique et capacité à résoudre des problèmes complexes.\nExcellentes compétences en matière d’organisation et de communications orales et écrites.\nFortes aptitudes au travail en équipe et à la collaboration.\nBonne compréhension des principes et des normes de sécurité, ainsi que de la matrice MITRA. \nExpérience souhaitée avec des outils SIEM comme Splunk pour analyser les journaux et corréler les événements.\n\n\nQualifications\n\nRange and benefit information provided in this posting are specific to the stated locations only\n\nCA: Hiring Range in CAD from: $76,700 - $167,600 per year.\n\nOracle maintains broad salary ranges for its roles in order to account for variations in knowledge, skills, experience, market conditions and locations, as well as reflect Oracle’s differing products, industries and lines of business.\n\nCandidates are typically placed into the range based on the preceding factors as well as internal peer equity.\n\nThis job requires proficiency in the English language. Oracle is a global company with operations in dozens of countries around the world and our teams, including the team this position is part of, are comprised of individuals located in various jurisdictions. As is required of employees in all jobs at Oracle in North America, candidates for this position are required to understand, and communicate, in English so that in the course of performing their work, they can interact with teammates in other locations who are not fluent in the French language.\n\nFor applicants located in the Province of Quebec, a basic proficiency of the French language is required.\n\nAbout Us\n\nAs a world leader in cloud solutions, Oracle uses tomorrow’s technology to tackle today’s challenges. We’ve partnered with industry-leaders in almost every sector—and continue to thrive after 40+ years of change by operating with integrity.\n\nWe know that true innovation starts when everyone is empowered to contribute. That’s why we’re committed to growing an inclusive workforce that promotes opportunities for all.\n\nOracle careers open the door to global opportunities where work-life balance flourishes. We offer competitive benefits based on parity and consistency and support our people with flexible medical, life insurance, and retirement options. We also encourage employees to give back to their communities through our volunteer programs.\n\nWe’re committed to including people with disabilities at all stages of the employment process. If you require accessibility assistance or accommodation for a disability at any point, let us know by emailing accommodation-request_mb@oracle.com or by calling +1 888 404 2494 in the United States.\n\nOracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans’ status, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.",
    "scraped_at": "2025-06-05T14:51:11.755091"
  },
  "dc2b24f0cd04adfebc53ba092ba09a47c9e514eab6102f44c8e6dd13ececda48": {
    "company_name": "MaintainX",
    "company_url": "https://www.linkedin.com/company/getmaintainx/life",
    "job_title": "Responsable de l'ingénierie, AI/ML",
    "job_url": "https://www.linkedin.com/jobs/view/4228497044/?alternateChannel=search&refId=tCzXz6JSJnALkq9IF%2FtJqw%3D%3D&trackingId=0muQ3W37oxt9VbHMjZz%2FTQ%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nMaintainX est la première plateforme mobile de gestion des procédures pour les travailleurs de l'industrie et les travailleurs de première ligne. Nous construisons le GitHub pour les procédures de travail réelles telles que la maintenance, la sécurité et les opérations, et nous améliorons l'efficacité opérationnelle de plus de 10,000+ entreprises, dont Duracell, Univar Solutions Inc., Titan America, McDonalds, Brenntag, Cintas, Michaels, and Shell.\n\nNous avons levé 104 millions de dollars en capital-risque à la suite d'un récent tour de table de série C mené par Bain Capital Ventures, Bessemer Ventures, August Capital, Amity Ventures, Ridge Ventures ainsi que des PDG de GE, Twilio, Toast et PagerDuty, MaintainX construit la couche d'intelligence pour le monde industriel.\n\nAlors que nous entamons la prochaine phase de notre croissance, nous investissons massivement dans l'IA, les LLM et l'IoT industriel pour transformer la façon dont les équipes de première ligne opèrent — en prédisant les pannes avant qu'elles ne surviennent, en automatisant les tâches répétitives et en intégrant l'intelligence dans chaque actif et procédure.\n\nNous recherchons un gestionnaire en ingénierie pour diriger une équipe hybride de développeurs fullstack et de développeurs IA/ML, responsable de la création d'expériences produits et de l'intégration de l'intelligence directement dans nos opérations. Vous gérerez une équipe multidisciplinaire composée de développeurs en apprentissage automatique appliqué, de scientifiques des données et de développeurs logiciels, responsable du développement et du déploiement de bout en bout de produits IA/ML — y compris, mais sans s'y limiter, des modèles de maintenance prédictive et prescriptive, des recommandations de tâches intelligentes, des procédures pilotées par LLM et de la détection d'anomalies en temps réel.\n\nCe rôle est idéal pour une personne qui excelle à l'intersection de l'ingénierie produit fullstack et de l'IA appliquée, et qui peut faire évoluer une équipe pour livrer dans les deux domaines.\n\nVous aiderez à définir la vision technique de l'IA chez MaintainX, en collaborant étroitement avec les équipes de produit et d’Ingénierie des données pour opérationnaliser l'intelligence à grande échelle.\n\nCe Que Vous Ferez\n\nDiriger des équipes interfonctionnelles de 6 à 10 développeurs, comprenant des développeurs fullstack (React/Node.js), des développeurs en apprentissage machine (Python) et des scientifiques des données.\nPosséder la feuille de route et la stratégie technique en collaboration avec les équipes Produit, Design et Ingénierie pour définir la portée et aider les équipes à livrer des fonctionnalités alimentées par l'IA.\nFavoriser une culture d'expérimentation, de recherche appliquée et de mesure rigoureuse — en s'assurant que nous déployons des modèles efficaces dans le monde réel.\nDiriger, développer et encadrer les développeurs de votre équipe, les aider à acquérir de nouvelles compétences et expériences, et à progresser dans leur carrière.\nComprendre les besoins de votre équipe et permettre à chaque développeur de contribuer aux objectifs de l'équipe.\nMettre en évidence l'impact de l'équipe auprès de la haute direction.\nRecruter et encadrer des talents en intelligence artificielle de classe mondiale, en construisant une équipe performante capable d'avancer rapidement et de penser en grand.\n\nA Propos De Vous\n\n4 ans ou plus d'expérience en gestion d'ingénierie, dont au moins 2 ans à la tête d'équipes performantes en IA/ML et/ou en science appliquée.\nExpérience dans la gestion d'équipes comprenant des développeurs fullstack, des développeurs IA/ML et des scientifiques des données.\nExcellentes compétences en communication, avec la capacité d'influencer les parties prenantes techniques et commerciales.\nConnaissance des frameworks modernes de développement web (React, Node.js) et de la conception d'API.\nCompréhension des technologies en IA/ML : Python, PyTorch/TensorFlow, scikit-learn, Airflow, Spark, Kubernetes, ainsi que JavaScript/TypeScript.\nFamiliarité avec les écosystèmes ML/LLM (par exemple, fine-tuning, RAG, orchestration de prompts, bases de données vectorielles, LlamaIndex ou frameworks similaires).\nFort instinct produit — capable de traduire des problèmes ambigus en expériences mesurables et en produits de données.\n\nUne attention particulière est accordée aux candidats présentant les caractéristiques suivantes:\n\nExpérience dans des domaines réels tels que les systèmes industriels, la fabrication, l'IoT, la logistique ou la gestion d'actifs.\nFamiliarité avec la modélisation de séries temporelles, la détection d'anomalies, la fusion de capteurs et l'inférence ML en temps réel.\nExpérience avec les outils ML basés sur le cloud (AWS, Databricks, etc.).\n\nPourquoi choisir MaintainX?\n\nC'est une occasion rare d'apporter l'IA/ML de pointe dans l'une des industries les plus influentes au monde. Vous ne vous contenterez pas de construire des modèles — vous transformerez la manière dont les gens opèrent les machines, maintiennent les actifs et prennent des décisions concrètes.\n\nCe Que Vous y Gagnerez \n\nUn salaire compétitif et des opportunités d'équité significatives.\nCouverture des soins de santé, des soins dentaires et des soins de la vue.\nProgramme d'inscription 401(k) / RRSP.\nPrenez les congés dont vous avez besoin.\nUne culture du travail où:\nVous travaillerez aux côtés de personnes du monde entier qui reflètent les valeurs de MaintainX : Intelligents, Humbles, Optimistes.\nNous croyons en la méritocratie, où les idées et les efforts sont publiquement célébré.\nA Propos De Nous\n\nNotre mission est de faciliter la vie des ouvriers dans le monde entier en créant des logiciels qui répondent à leurs besoins et à leurs réalités. Notre produit change véritablement la vie des 80% de la population active qui ne travaillent pas derrière un bureau et qui ont besoin d'un logiciel d'entreprise à portée de main.\n\nMaintainX s'engage à créer un environnement diversifié. Tous les candidats qualifiés seront pris en considération pour un emploi sans tenir compte de la race, de la couleur, de la religion, du sexe, de l'identité ou de l'expression sexuelle, de l'orientation sexuelle, de l'origine nationale, de la génétique, du handicap, de l'âge ou du statut d'ancien combattant.",
    "scraped_at": "2025-06-05T14:51:14.926518"
  },
  "d6e30efe228ce2089ae6feb019ee230fe73990f96567b391437938ead24c6298": {
    "company_name": "Amazon Games",
    "company_url": "https://www.linkedin.com/company/amazongames/life",
    "job_title": "Développeuse, Développeur de jeux sénior.e - IA/ML / Senior Game Developer - AI/ML, Amazon Games AI Research",
    "job_url": "https://www.linkedin.com/jobs/view/4092718523/?alternateChannel=search&refId=tCzXz6JSJnALkq9IF%2FtJqw%3D%3D&trackingId=xZPsULmfEXkRuGIbe8rBGg%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nDescription\n\nAmazon Games recherche une développeuse ou un développeur de jeux sénior.e - IA/ML pour construire et intégrer des systèmes et outils d'IA innovants dans nos processus de développement de jeux et expériences gameplay. Notre mission d'être l'entreprise de jeux vidéo la plus obsédée par les joueuses et les joueurs nécessite l'exploration de ces outils de pointe pour créer de nouvelles expériences, tout en assurant leur mise en œuvre éthique et responsable.\n\nChez Amazon Games, notre ambition est de créer de expériences inédites et audacieuses qui rassemblent et cultivent les communautés de joueurs et de joueuses. Notre équipe d'experts de l'industrie développe des jeux multijoueurs AAA et des propriétés intellectuelles originales, avec des équipes à Seattle, Orange County, San Diego, Montréal et Bucarest. À travers nos divisions Studios, Publishing et Prime Gaming et en collaboration avec des partenaires externes, nous développons, publions et livrons des jeux et des expériences de contenu exceptionnelles pour les joueurs et joueuses.\n\n///\n\nAmazon Games is seeking a highly effective Senior Game Developer - AI/ML to build and integrate innovative AI systems and tools into our game pipelines and customer experiences. Our mission to be the most customer obsessed video game company requires exploration into these cutting-edge tools to improve the quality and quantity of fun gameplay for our players; while ensuring their ethical and responsible implementation.\n\nAt Amazon Games, our ambition is to create bold new experiences that foster community in and around our games. Our team of game industry veterans develops AAA multiplayer games and original IPs, with teams in Seattle, Orange County, San Diego, Montreal, and Bucharest. Amazon Games, through its Studios, Publishing, and Prime Gaming divisions collaborating with external partners, aims to develop, publish, and deliver compelling AAA games and content experiences for gamers to discover.\n\nKey job responsibilities\n\nResponsabilités\n\n Diriger la conception et le développement de composants de moteur robustes, évolutifs et réutilisables qui implémentent des techniques de ML, RL et Gen AI embarquées.\n Collaborer étroitement avec les scientifiques pour transformer leurs recherches et prototypes en fonctionnalités de moteur de jeu prêtes pour la production.\n\n///\n\nKey job responsibilities\n\n Implement libraries and middleware for advanced ML and AI use cases using a combination of cloud services and embedded models provided by our scientists.\n Collaborate with game teams—directly embedding when required—to deliver the generative AI & ML features their game designs require.\n\nA day in the life\n\nUne journée type\n\n Vous vous épanouissez dans un environnement collaboratif où vos décisions ont un impact et une influence significatifs.\n Vous exprimer votre passion par la création d'expériences de jeu qui ravissent les joueurs et les joueuses.\n Vous proposez d'excellents flux de travail, outils et innovations de jeu à vos collègues et aux équipes de développement et recherchez constamment l'amélioration.\n Vous souhaitez faire partie de quelque chose d'excitant et unique dans l'écosystème du jeu.\n\n///\n\nA day in the life\n\n You thrive in a collaborative environment where your decisions have significant impact and influence.\n You are passionate about building game experiences that delight players.\n You deliver great workflows, tools, and game innovations to your fellow developers and constantly seek improvement.\n You want to be part of something exciting and unique in the gaming ecosystem.\n\nAbout The Team\n\nÀ propos de l'équipe\n\nL'équipe de recherche en IA d'Amazon Games Studio se concentre sur l'innovation en intelligence artificielle dans le domaine du jeu vidéo. Notre équipe hautement qualifiée et multidisciplinaire travaille sur l'apprentissage automatique, l'apprentissage par renforcement et l'IA générative pour réinventer le développement des jeux. Nous travaillons de près avec les équipe internes et nos studios partenaires pour donner vie à leur vision créative. Notre mission est d'utiliser l'IA de manière responsable pour transformer l'expérience de jeu, enrichir les récits, et fournir aux créateurs et créatrices des outils pratiques pour optimiser leurs chaînes de production.\n\n///\n\nAbout The Team\n\nThe Amazon Games Studio AI Research team focuses on artificial intelligence innovation in gaming. Our highly skilled, multi-discipline team works across Machine Learning, Reinforcement Learning, and Generative AI to reimagine game development. We work closely with first-party game developers and partner studios to bring creative visions to life. Our mission is to use AI responsibly to transform gameplay experiences, enrich narratives, and provide creators with practical tools to optimize their production pipelines.\n\nBasic Qualifications\n\nQualifications de base\n\n BAC en informatique, génie logiciel ou domaine connexe\n 8+ ans d'expérience professionnelle en développement logiciel hors stage, dont au moins 5 ans dans le développement de jeux\n Forte compétence en C++ et expérience avec les moteurs de jeu (Unreal, Unity ou propriétaire)\n 5+ ans d'expérience en direction de la conception ou de l'architecture (modèles de conception, fiabilité et mise à l'échelle) de systèmes nouveaux et existants\n 1+ an d'intégration de l'IA/ML dans les jeux\n Expérience en tant que mentor, responsable technique ou dirigeant d'une équipe d'ingénierie\n Maîtrise du français et de l’anglais, à l'oral et à l'écrit; puisque ce rôle nécessite d'interagir avec d’autres entités d’Amazon à l’échelle mondiale ainsi qu’avec des collègues et intervenant.es dans d’autres provinces canadiennes, la connaissance du français et de l’anglais est exigée pour ce poste.\n\n///\n\nBasic Qualifications\n\n Bachelor's degree in Computer Science, Software Engineering, or related field\n 8+ years of non-internship professional software development experience, with at least 5 years in game development\n Strong proficiency in C++ and experience with game engines (Unreal, Unity, or proprietary)\n 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\n 1+ year of AI/ML integration in games\n Experience as a mentor, tech lead or leading an engineering team\n Strong verbal and written communication skills, in French and English; due to the nature of the role, which requires interaction with other Amazon entities globally and with Amazon employees and stakeholders in other provinces in Canada, bilingual French and English is required for this position\n\nPreferred Qualifications\n\nQualifications souhaitables\n\n Expérience de travail avec des frameworks ML (PyTorch, TensorFlow, etc.) et de leur intégration dans des moteurs de jeu\n Expérience avec l'apprentissage par renforcement et les architectures ML distribuées\n Expérience dans la conception et le déploiement de services et produits exploitant des modèles d'IA générative\n Expérience avec les services d'IA basés sur l'infonuagique et leur intégration dans les systèmes de jeu\n\nNous savons que votre talent et vos habilités peuvent s’exprimer par des expériences variées et pertinentes. Nous vous incitons donc à postuler, même si vous ne présentez peut-être pas toutes les qualifications listées.\n\n///\n\nPreferred Qualifications\n\n Experience working with ML frameworks (PyTorch, TensorFlow, etc.) and integrating them into game engines\n Experience with RL, DRL, and distributed ML architectures\n Experience with designing and deploying services and products that leverage generative AI models\n Experience with cloud-based AI services and their integration into game systems\n\nWe know that your talent and skills can be expressed through a variety of relevant experiences. We encourage you to apply, even though you may not have all the qualifications listed.\n\nAmazon est un employeur garantissant l'égalité des chances et ne fait aucune discrimination sur la base du statut d'ancien combattant protégé, d'un handicap ou de tout autre statut protégé par la loi.\n\nNotre culture inclusive permet aux Amazoniens d'offrir les meilleurs résultats à nos clients. Si vous avez un handicap et que vous avez besoin de mesures d'adaptation ou d'adaptation en milieu de travail pendant le processus de candidature et d'embauche, y compris du soutien pour l'entrevue ou le processus d'intégration, veuillez visiter https://amazon.jobs/content/en/how-we-hire/accommodations pour plus d'informations. Si le pays ou la région dans lequel vous postulez ne figure pas dans la liste, veuillez communiquer avec votre partenaire de recrutement.\n\nAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - Amazon Development Centre Canada ULC\n\nJob ID: A2848093",
    "scraped_at": "2025-06-05T14:51:17.586960"
  },
  "06141ea02b8204c25367a8a855d48604e5432aa8a94951c37f201f9a6007f069": {
    "company_name": "AMD",
    "company_url": "https://www.linkedin.com/company/amd/life",
    "job_title": "SoC System Performance Architect AI/ML",
    "job_url": "https://www.linkedin.com/jobs/view/4224762015/?alternateChannel=search&refId=tCzXz6JSJnALkq9IF%2FtJqw%3D%3D&trackingId=mDPcgiI9%2B7vCvrzJRqI4Ag%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nWHAT YOU DO AT AMD CHANGES EVERYTHING\n\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences - the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives.\n\nAMD together we advance_\n\nSoC System Performance Architect AI \n\nThe Team\n\nAMD's Data Center GPU organization is transforming the industry with our AI based Graphic Processors. Our primary objective is to design exceptional products that drive the evolution of computing experiences, serving as the cornerstone for enterprise Data Centers, (AI) Artificial Intelligence, HPC and Embedded systems. If this resonates with you, come and joining our Data Center GPU organization where we are building amazing AI powered products with amazing people.\n\nThe Role\n\nArchitect, Analyze and optimize high-performance SoCs for Cloud computing, and machine learning acceleration. Propose solutions to enhance performance and optimize power. Explore, analyze and optimize next-generation data center systems.\n\nThe Person\n\nDo you seek the most sophisticated challenges in the computing industry? As a passionate system performance architect on our design engineering team, you will propose and implement solutions to our next generation GPU SoC and data center system application performance issues.\n\nKey Responsibilities\n\nServe as a Performance Architect in AMD's electronics design engineering team.\nParticipate in microarchitecture exploration, performance modeling, and analysis for next-generation GPU systems.\nIntimately understand design architecture and propose solutions to enhance performance \nResponsible for micro-benchmarking, workload characterization, competitive analysis, bottleneck identification, and optimization.\nDevelop tools and methodology for performance analysis of workloads.\nCommunicate, propose, and implement solutions to processor and system performance issues.\n\n\nPreferred Experience\n\nExperience with GPU, CPU or computer system microarchitecture\nExperience with the development and usage of computer system performance models\nExperience with computer workload analysis\nStrong programming skills, including experience with C++ and Python (or similar)\n\n\nAcademic Credentials\n\nPhD in Computer Engineering, Electrical Engineering, Computer Science, or a closely related field of study.\nMS in Computer Engineering, Electrical Engineering, Computer Science, or a closely related field of study plus experience as a Computer Architect, Design Engineer, or in a closely related processor design role\n\n\nLocation: Markham, Ontario\n\nBenefits offered are described: AMD benefits at a glance.\n\nAMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law. We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
    "scraped_at": "2025-06-05T14:51:22.337236"
  },
  "63679a92a584b80aa3acd374809526760ee2d8d8579a6b11f45a5b8b3ac7889c": {
    "company_name": "Loblaw Companies Limited",
    "company_url": "https://www.linkedin.com/company/loblaw-companies-limited/life",
    "job_title": "Director, ML & Data Engineering",
    "job_url": "https://www.linkedin.com/jobs/view/4241376738/?alternateChannel=search&refId=tCzXz6JSJnALkq9IF%2FtJqw%3D%3D&trackingId=A2bDkdvr9TfE9%2B5US7optQ%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nCome make your difference in communities across Canada, where authenticity, trust and making connections is valued – as we shape the future of Canadian retail, together. Our unique position as one of the country's largest employers, coupled with our commitment to positively impact the lives of all Canadians, provides our colleagues a range of opportunities and experiences to help Canadians Live Life Well®.\n\nAt Loblaw Companies Limited, we succeed through collaboration and commitment and set a high bar for ourselves and those around us. Whether you are just starting your career, re-entering the workforce, or looking for a new job, this is where you belong.\n\nDoes working with some of Canada’s most talented minds in innovation supporting retail, digital consumer solutions and analytical platforms excite you? Loblaw Technology powers some of Canada’s most game-changing retail solutions, giving our customers the ability to live their lives well.\n\nCome work with a team that values diverse ideas, fosters a culture of inclusion and develops our talent from within. Loblaw Technology gives you the chance to excel, and helps you to strive for success in a big way. Keep reading to learn more!\n\nKey Responsibilities\n\nLead, mentor, and scale high-performing teams of data and ML engineers, fostering a culture of technical excellence, innovation, and collaboration\nDefine and execute the organization’s machine learning strategy, ensuring alignment with business goals and driving impactful AI/ML initiatives.\nOversee the end-to-end ML lifecycle, including data preparation, feature engineering, model development, training, evaluation, deployment, monitoring, and retraining.\nArchitect and implement robust MLOps pipelines to automate and streamline model deployment, versioning, monitoring, and governance.\nOversee the design, implementation, and optimization of scalable, secure, and reliable data pipelines and ML infrastructure, leveraging Google Cloud Platform (GCP).\nCollaborate cross-functionally with product, engineering, analytics, and business stakeholders to deliver robust data and ML solutions supporting analytics, reporting, Customer 360, and GenAI initiatives\nEnsure data integrity, governance, security, and compliance across all data engineering and ML initiatives\nProvide hands-on technical and architectural leadership in cloud-native data platforms, distributed systems, and real-time data processing\nOversee performance monitoring, quality assurance, and continuous optimization of data and ML systems\nStay current with emerging technologies and industry trends in data engineering, ML, and GenAI, driving continuous improvement and innovation.\nManage project delivery, resource allocation, and stakeholder communication to ensure successful execution of complex, high-impact data and ML projects.\nRequired Qualifications\nBachelor’s or Master’s degree in Computer Science, Data Science, Engineering, or a related field\n10+ years of experience in data engineering, ML engineering, Data Science, or related domains, with 5+ years in a leadership role managing large, multi-disciplinary teams\nProven expertise in designing and operating large-scale data platforms and ML systems on cloud.\nDeep technical knowledge of data/ML architecture, ML models, ETL/ELT, and distributed computing frameworks.\nExpertise in machine learning frameworks (TensorFlow, PyTorch, Scikit-learn), MLOps tools (MLflow, Kubeflow, Vertex AI Pipelines), and cloud-native ML services.\nExcellent communication, stakeholder management, and cross-functional collaboration skills\n\nWhat Loblaw Offers You\n\nWe offer flexibility and balance, and an environment that sets you up for success no matter where your workspace is located.\n\nHere, you will find a great team to help you achieve your goals as you help us achieve ours! Work in our fast-paced, exciting Technology environment, helping our stores, colleagues and customers every day.\n\nLoblaw colleagues also enjoy:\n\nWork Perks Program\nOn-site GoodLife Fitness, Basketball & Volleyball courts, Ice Rink, Dry Cleaning services (1PCC Office)\nTuition Reimbursement & Online Learning\nPension & Benefits\nPaid Vacation\n\nIf you’re up to the challenge, then we would love to hear from you. Apply today, and get the process started. \n\nLoblaw recognizes Canada's diversity as a source of national pride and strength. We have made it a priority to reflect our nation’s evolving diversity in the products we sell, the people we hire, and the culture we create in our organization. At Loblaw, we celebrate diversity and strive to build a culture of inclusion where differences are embraced, valued and supported. We are committed to being an equal opportunity employer and encourage people from all backgrounds and identities to apply to our jobs. Accommodation in the recruitment, assessment, and hiring process is available upon request for applicants with disabilities. \n\nWe thank all candidates for their interest but please note, those candidates who meet the minimum requirements for the position will be contacted. \n\nwww.Loblaw.ca/careers\n\nOur commitment to Sustainability and Social Impact is an essential part of the way we do business, and we focus our attention on areas where we can have the greatest impact. Our approach to sustainability and social impact is based on three pillars – Environment, Sourcing and Community – and we are constantly looking for ways to demonstrate leadership in these important areas. Our CORE Values – Care, Ownership, Respect and Excellence – guide all our decision-making and come to life through our Blue Culture. We offer our colleagues progressive careers, comprehensive training, flexibility, and other competitive benefits – these are some of the many reasons why we are one of Canada’s Top Employers, Canada’s Best Diversity Employers, Canada’s Greenest Employers & Canada’s Top Employers for Young People.\n\nIf you are unsure whether your experience matches every requirement above, we encourage you to apply anyway. We are looking for varied perspectives which include diverse experiences that we can add to our team.\n\nWe have a long-standing focus on diversity, equity and inclusion because we know it will make our company a better place to work and shop. We are committed to creating accessible environments for our colleagues, candidates and customers. Requests for accommodation due to a disability (which may be visible or invisible, temporary or permanent) can be made at any stage of application and employment. We encourage candidates to make their accommodation needs known so that we can provide equitable opportunities.\n\nPlease Note:\n\nCandidates who are 18 years or older are required to complete a criminal background check. Details will be provided through the application process.\n\n#EN\n\n#SS #LTnA #ON",
    "scraped_at": "2025-06-05T14:51:25.113657"
  },
  "b8e5b1ea032f47025bdf5bc3d55d378ed674ea5f337799cbfa820db17d3d2fe2": {
    "company_name": "Loblaw Companies Limited",
    "company_url": "https://www.linkedin.com/company/loblaw-companies-limited/life",
    "job_title": "Director, ML & Data Engineering",
    "job_url": "https://www.linkedin.com/jobs/view/4241384133/?alternateChannel=search&refId=tCzXz6JSJnALkq9IF%2FtJqw%3D%3D&trackingId=LsYuFIJyhOeQ6P%2FT%2BPek2g%3D%3D&trk=d_flagship3_search_srp_jobs",
    "job_description": "About the job\nL’utilisation du masculin à pour but d’alléger le texte\n\nVenez faire votre différence dans les communautés à travers le Canada, où l'authenticité, la confiance et l'établissement de liens sont valorisés - alors que nous façonnons l'avenir du commerce de détail au Canada, ensemble. Notre position unique en tant que l'un des plus grands employeurs du pays, celle associée à notre engagement à avoir un impact positif sur la vie de tous les Canadiens, viens offrir à nos collègues une gamme d'opportunités et d'expériences pour aider les Canadiens à Vivre Bien, Vivre Pleinement.\n\nChez Les Compagnies Loblaw Limitée, nous réussissons grâce à la collaboration, à l'engagement et nous plaçons la barre haute pour nous-mêmes et ceux qui nous entourent. Que vous débutiez votre carrière, que vous réintégriez le marché du travail ou que vous recherchiez un nouvel emploi, votre place est avec nous.\n\nDoes working with some of Canada’s most talented minds in innovation supporting retail, digital consumer solutions and analytical platforms excite you? Loblaw Technology powers some of Canada’s most game-changing retail solutions, giving our customers the ability to live their lives well.\n\nCome work with a team that values diverse ideas, fosters a culture of inclusion and develops our talent from within. Loblaw Technology gives you the chance to excel, and helps you to strive for success in a big way. Keep reading to learn more!\n\nKey Responsibilities\n\nLead, mentor, and scale high-performing teams of data and ML engineers, fostering a culture of technical excellence, innovation, and collaboration\nDefine and execute the organization’s machine learning strategy, ensuring alignment with business goals and driving impactful AI/ML initiatives.\nOversee the end-to-end ML lifecycle, including data preparation, feature engineering, model development, training, evaluation, deployment, monitoring, and retraining.\nArchitect and implement robust MLOps pipelines to automate and streamline model deployment, versioning, monitoring, and governance.\nOversee the design, implementation, and optimization of scalable, secure, and reliable data pipelines and ML infrastructure, leveraging Google Cloud Platform (GCP).\nCollaborate cross-functionally with product, engineering, analytics, and business stakeholders to deliver robust data and ML solutions supporting analytics, reporting, Customer 360, and GenAI initiatives\nEnsure data integrity, governance, security, and compliance across all data engineering and ML initiatives\nProvide hands-on technical and architectural leadership in cloud-native data platforms, distributed systems, and real-time data processing\nOversee performance monitoring, quality assurance, and continuous optimization of data and ML systems\nStay current with emerging technologies and industry trends in data engineering, ML, and GenAI, driving continuous improvement and innovation.\nManage project delivery, resource allocation, and stakeholder communication to ensure successful execution of complex, high-impact data and ML projects.\nRequired Qualifications\nBachelor’s or Master’s degree in Computer Science, Data Science, Engineering, or a related field\n10+ years of experience in data engineering, ML engineering, Data Science, or related domains, with 5+ years in a leadership role managing large, multi-disciplinary teams\nProven expertise in designing and operating large-scale data platforms and ML systems on cloud.\nDeep technical knowledge of data/ML architecture, ML models, ETL/ELT, and distributed computing frameworks.\nExpertise in machine learning frameworks (TensorFlow, PyTorch, Scikit-learn), MLOps tools (MLflow, Kubeflow, Vertex AI Pipelines), and cloud-native ML services.\nExcellent communication, stakeholder management, and cross-functional collaboration skills\n\nWhat Loblaw Offers You\n\nWe offer flexibility and balance, and an environment that sets you up for success no matter where your workspace is located.\n\nHere, you will find a great team to help you achieve your goals as you help us achieve ours! Work in our fast-paced, exciting Technology environment, helping our stores, colleagues and customers every day.\n\nLoblaw colleagues also enjoy:\n\nWork Perks Program\nOn-site GoodLife Fitness, Basketball & Volleyball courts, Ice Rink, Dry Cleaning services (1PCC Office)\nTuition Reimbursement & Online Learning\nPension & Benefits\nPaid Vacation\n\nIf you’re up to the challenge, then we would love to hear from you. Apply today, and get the process started. \n\nLoblaw recognizes Canada's diversity as a source of national pride and strength. We have made it a priority to reflect our nation’s evolving diversity in the products we sell, the people we hire, and the culture we create in our organization. At Loblaw, we celebrate diversity and strive to build a culture of inclusion where differences are embraced, valued and supported. We are committed to being an equal opportunity employer and encourage people from all backgrounds and identities to apply to our jobs. Accommodation in the recruitment, assessment, and hiring process is available upon request for applicants with disabilities. \n\nWe thank all candidates for their interest but please note, those candidates who meet the minimum requirements for the position will be contacted. \n\nwww.Loblaw.ca/careers\n\nNotre engagement envers la durabilité et l'impact social est un élément essentiel de notre façon de faire des affaires. Nous concentrons notre attention sur les domaines où nous pouvons avoir le plus grand impact. Notre approche de la durabilité et de l'impact social repose sur trois piliers - l'environnement, l'approvisionnement et la communauté. Nous recherchons constamment des moyens de faire preuve de leadership dans ces domaines importants. Nos valeurs ÊTRE – Engagement, Tient à coeur, Respect et Excellence – guident toutes nos prises de décision et prennent vie à travers notre culture bleue. Nous offrons à nos collègues des carrières progressives, une formation complète, de la flexibilité ainsi que les nombreux avantages compétitifs - voici quelques-unes des nombreuses raisons pour lesquelles nous sommes classés au palmarès des meilleurs employeurs du Canada, au palmarès des meilleurs employeurs pour la diversité au Canada, au palmarès des employeurs les plus verts au Canada et au palmarès des meilleurs employeurs pour les jeunes au Canada.\n\nSi vous ne savez pas si votre expérience correspond à toutes les exigences ci-dessus, nous vous encourageons à postuler quand même. Nous recherchons des perspectives de candidatures variées, qui incluent des expériences diverses que nous pouvons ajouter à notre équipe.\n\nNous nous concentrons depuis longtemps sur la diversité, l'équité et l'inclusion, car nous savons que cela fera de notre entreprise un meilleur lieu de travail et de magasinage. Nous nous engageons à créer des environnements accessibles pour nos collègues, candidats et clients. Les demandes d'aménagement en raison d'un handicap (qui peut être visible ou pas, temporaire ou permanent) peuvent être faites à n'importe quel stade de la demande et de l'emploi. Nous encourageons les candidats à faire connaître leurs besoins en matière d'accommodation afin que nous puissions offrir des opportunités équitables.\n\nVeuillez noter:\n\nLes candidats âgés de 18 ans ou plus doivent effectuer une vérification des antécédents criminels. Les détails seront fournis lors du processus d’embauche.\n\n#FR\n\n#SS #LTnA #ON",
    "scraped_at": "2025-06-05T14:51:27.794647"
  }
}